GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/dosfs_core.c
/*
 * Copyright (c) 2014-2020 Thomas Roell.  All rights reserved.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to
 * deal with the Software without restriction, including without limitation the
 * rights to use, copy, modify, merge, publish, distribute, sublicense, and/or
 * sell copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 *  1. Redistributions of source code must retain the above copyright notice,
 *     this list of conditions and the following disclaimers.
 *  2. Redistributions in binary form must reproduce the above copyright
 *     notice, this list of conditions and the following disclaimers in the
 *     documentation and/or other materials provided with the distribution.
 *  3. Neither the name of Thomas Roell, nor the names of its contributors
 *     may be used to endorse or promote products derived from this Software
 *     without specific prior written permission.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.  IN NO EVENT SHALL THE
 * CONTRIBUTORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING
 * FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS
 * WITH THE SOFTWARE.
 */

#include <stdlib.h>
#include <stdint.h>
#include <stdbool.h>
#include <stdio.h>

#include "armv7m.h"
#include "stm32wb_rtc.h"
#include "stm32wb_random.h"
#include "dosfs_core.h"

static int dosfs_volume_init(dosfs_volume_t *volume, dosfs_device_t *device);
static int dosfs_volume_mount(dosfs_volume_t *volume);
static int dosfs_volume_unmount(dosfs_volume_t *volume);
static int dosfs_volume_lock(dosfs_volume_t *volume);
static int dosfs_volume_lock_noinit(dosfs_volume_t *volume);
static int dosfs_volume_lock_nomount(dosfs_volume_t *volume);
static int dosfs_volume_unlock(dosfs_volume_t *volume, int status);
static int dosfs_volume_read(dosfs_volume_t *volume, uint32_t address, uint8_t *data);
static int dosfs_volume_write(dosfs_volume_t *volume, uint32_t address, const uint8_t *data);
static int dosfs_volume_zero(dosfs_volume_t *volume, uint32_t address, uint32_t length, bool wait);
#if (DOSFS_CONFIG_FSINFO_SUPPORTED == 1)
static int dosfs_volume_fsinfo(dosfs_volume_t *volume, uint32_t free_clscnt, uint32_t next_clsno);
#endif /* (DOSFS_CONFIG_FSINFO_SUPPORTED == 1) */
#if (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 0)
static int dosfs_volume_dirty(dosfs_volume_t *volume);
static int dosfs_volume_clean(dosfs_volume_t *volume, int status_o);
#else /* (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 0) */
static int dosfs_volume_record(dosfs_volume_t *volume);
static int dosfs_volume_commit(dosfs_volume_t *volume);
#endif /* (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 0) */
static int dosfs_volume_format(dosfs_volume_t *volume);
static int dosfs_volume_hardformat(dosfs_volume_t *volume);

static int dosfs_dir_cache_write(dosfs_volume_t *volume);
static int dosfs_dir_cache_fill(dosfs_volume_t *volume, uint32_t blkno, int zero);
static int dosfs_dir_cache_read(dosfs_volume_t *volume, uint32_t blkno, dosfs_cache_entry_t **p_entry);
static int dosfs_dir_cache_zero(dosfs_volume_t *volume, uint32_t blkno, dosfs_cache_entry_t **p_entry);
static int dosfs_dir_cache_flush(dosfs_volume_t *volume);

#if (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 1)
static int dosfs_map_cache_fill(dosfs_volume_t *volume, uint32_t page);
static int dosfs_map_cache_write(dosfs_volume_t *volume, uint32_t blkno, const uint8_t *data);
static int dosfs_map_cache_read(dosfs_volume_t *volume, uint32_t blkno, uint8_t *data);
static int dosfs_map_cache_flush(dosfs_volume_t *volume);
static int dosfs_map_cache_resolve(dosfs_volume_t *volume);
#endif /* (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 1) */

static int dosfs_fat_cache_write(dosfs_volume_t *volume, dosfs_cache_entry_t *entry);
static int dosfs_fat_cache_fill(dosfs_volume_t *volume, uint32_t blkno, dosfs_cache_entry_t **p_entry);
static int dosfs_fat_cache_read(dosfs_volume_t *volume, uint32_t blkno, dosfs_cache_entry_t **p_entry);
static void dosfs_fat_cache_modify(dosfs_volume_t *volume, dosfs_cache_entry_t *entry);
static int dosfs_fat_cache_flush(dosfs_volume_t *volume);

static int dosfs_data_cache_write(dosfs_volume_t *volume, dosfs_file_t *file);
static int dosfs_data_cache_fill(dosfs_volume_t *volume, dosfs_file_t *file, uint32_t blkno, int zero);
static int dosfs_data_cache_read(dosfs_volume_t *volume, dosfs_file_t *file, uint32_t blkno, dosfs_cache_entry_t ** p_entry);
static int dosfs_data_cache_zero(dosfs_volume_t *volume, dosfs_file_t *file, uint32_t blkno, dosfs_cache_entry_t ** p_entry);
static void dosfs_data_cache_modify(dosfs_volume_t *volume, dosfs_file_t *file);
static int dosfs_data_cache_flush(dosfs_volume_t *volume, dosfs_file_t *file);

static int dosfs_cluster_read_uncached(dosfs_volume_t *volume, uint32_t clsno, uint32_t *p_clsdata);
static int dosfs_cluster_read(dosfs_volume_t *volume, uint32_t clsno, uint32_t *p_clsdata);
static int dosfs_cluster_write(dosfs_volume_t *volume, uint32_t clsno, uint32_t clsdata, int allocate);
static int dosfs_cluster_chain_seek(dosfs_volume_t *volume, uint32_t clsno, uint32_t clscnt, uint32_t *p_clsno);
static int dosfs_cluster_chain_create(dosfs_volume_t *volume, uint32_t clsno, uint32_t clscnt, uint32_t *p_clsno_a, uint32_t *p_clsno_l);
#if (DOSFS_CONFIG_SEQUENTIAL_SUPPORTED == 1)
static int dosfs_cluster_chain_create_sequential(dosfs_volume_t *volume, uint32_t clsno, uint32_t clscnt, uint32_t *p_clsno_a, uint32_t *p_clsno_l);
#endif /* (DOSFS_CONFIG_SEQUENTIAL_SUPPORTED == 1) */
#if (DOSFS_CONFIG_CONTIGUOUS_SUPPORTED == 1)
static int dosfs_cluster_chain_create_contiguous(dosfs_volume_t *volume, uint32_t clscnt, uint32_t *p_clsno_a);
#endif /* (DOSFS_CONFIG_CONTIGUOUS_SUPPORTED == 1) */
static int dosfs_cluster_chain_destroy(dosfs_volume_t *volume, uint32_t clsno, uint32_t clsdata);

