GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/dosfs_core.c
static unsigned int dosfs_name_ascii_upcase(unsigned int cc);
#if (DOSFS_CONFIG_VFAT_SUPPORTED == 0)
static const char *dosfs_name_cstring_to_dosname(const char *cstring, uint8_t *dosname);
static const char *dosfs_name_cstring_to_pattern(const char *cstring, char *pattern);
#endif /* (DOSFS_CONFIG_VFAT_SUPPORTED == 0) */
static const char *dosfs_name_cstring_to_label(const char *cstring, uint8_t *label);
static char *dosfs_name_dosname_to_cstring(const uint8_t *dosname, unsigned int doscase, char *cstring, char *cstring_e);
static char *dosfs_name_label_to_cstring(const uint8_t *label, char *cstring, char *cstring_e);
#if (DOSFS_CONFIG_VFAT_SUPPORTED == 1)
#if (DOSFS_CONFIG_UTF8_SUPPORTED == 1)
static unsigned int dosfs_name_cstring_to_unicode(const char *cstring, const char **p_cstring);
static char * dosfs_name_unicode_to_cstring(unsigned int cc, char *cstring, char *cstring_e);
static unsigned int dosfs_name_unicode_upcase(unsigned int cc);
#endif /* (DOSFS_CONFIG_UTF8_SUPPORTED == 1) */
static const char *dosfs_name_cstring_to_uniname(const char *cstring, dosfs_unicode_t *uniname, uint8_t *p_unicount, uint8_t *dosname, uint8_t *p_doscase);
static char *dosfs_name_uniname_to_cstring(const dosfs_unicode_t *uniname, unsigned int unicount, char *cstring, char *cstring_e);
static void dosfs_name_uniname_to_dosname(const dosfs_unicode_t *uniname, unsigned int unicount, uint8_t *dosname, unsigned int *p_dosprefix);
static uint8_t dosfs_name_checksum_dosname(const uint8_t *dosname);
static uint16_t dosfs_name_checksum_uniname(const dosfs_unicode_t *uniname, unsigned int unicount);
#endif /* (DOSFS_CONFIG_VFAT_SUPPORTED == 1) */

static int dosfs_path_convert_filename(dosfs_volume_t *volume, const char *filename, const char **p_filename);
static int dosfs_path_find_entry(dosfs_volume_t *volume, uint32_t clsno, uint32_t index, uint32_t count, dosfs_find_callback_t callback, void *private, uint32_t *p_clsno, uint32_t *p_index, dosfs_dir_t **p_dir);
static int dosfs_path_find_directory(dosfs_volume_t *volume, const char *filename, const char **p_filename, uint32_t *p_clsno);
static int dosfs_path_find_file(dosfs_volume_t *volume, const char *filename, uint32_t *p_clsno, uint32_t *p_index, dosfs_dir_t **p_dir);
static int dosfs_path_find_pattern(dosfs_volume_t *volume, F_DIR *parent, char *pattern, char *filename, dosfs_dir_t **p_dir);

static void dosfs_path_setup_entry(dosfs_volume_t *volume, const char *dosname, uint8_t attr, uint32_t first_clsno, uint16_t ctime, uint16_t cdate, dosfs_dir_t *dir);
static int dosfs_path_create_entry(dosfs_volume_t *volume, uint32_t clsno_d, uint32_t clsno, uint32_t index, const char *dosname, uint8_t attr, uint32_t first_clsno, uint16_t ctime, uint16_t cdate);
#if (DOSFS_CONFIG_VFAT_SUPPORTED == 1)
static int dosfs_path_destroy_entry(dosfs_volume_t *volume, uint32_t clsno, uint32_t index, uint32_t entries, uint32_t first_clsno);
#else /* (DOSFS_CONFIG_VFAT_SUPPORTED == 1) */
static int dosfs_path_destroy_entry(dosfs_volume_t *volume, uint32_t clsno, uint32_t index, uint32_t first_clsno);
#endif /* (DOSFS_CONFIG_VFAT_SUPPORTED == 1) */

static dosfs_file_t *dosfs_file_enumerate(dosfs_volume_t *volume, dosfs_file_t *file, uint32_t clsno, uint32_t index);
static int dosfs_file_sync(dosfs_volume_t *volume, dosfs_file_t *file, int access, int modify, uint32_t first_clsno, uint32_t length);
static int dosfs_file_flush(dosfs_volume_t *volume, dosfs_file_t *file, int close);
static int dosfs_file_seek(dosfs_volume_t *volume, dosfs_file_t *file, uint32_t position);
static int dosfs_file_shrink(dosfs_volume_t *volume, dosfs_file_t *file);
static int dosfs_file_extend(dosfs_volume_t *volume, dosfs_file_t *file, uint32_t length);
#if (DOSFS_CONFIG_CONTIGUOUS_SUPPORTED == 1)
static int dosfs_file_reserve(dosfs_volume_t *volume, dosfs_file_t *file, uint32_t size);
#endif /* (DOSFS_CONFIG_CONTIGUOUS_SUPPORTED == 1) */
static int dosfs_file_open(dosfs_volume_t *volume, dosfs_file_t *file, const char *filename, uint32_t mode, uint32_t size);
static int dosfs_file_close(dosfs_volume_t *volume, dosfs_file_t *file);
static int dosfs_file_read(dosfs_volume_t *volume, dosfs_file_t *file, uint8_t *data, uint32_t count, uint32_t *p_count);
static int dosfs_file_write(dosfs_volume_t *volume, dosfs_file_t *file, const uint8_t *data, uint32_t count, uint32_t *p_count);


dosfs_volume_t dosfs_volume;

__attribute__((section(".noinit"))) static uint32_t dosfs_cache[(((DOSFS_CONFIG_FAT_CACHE_ENTRIES == 2) ? 1 : 0)+
                                                                 ((DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 1) ? 1 : 0) +
                                                                 DOSFS_CONFIG_DATA_CACHE_ENTRIES)
                                                                * (DOSFS_BLK_SIZE / sizeof(uint32_t))];

static const char dosfs_dirname_dot[11]    = ".          ";
static const char dosfs_dirname_dotdot[11] = "..         ";

#if (DOSFS_CONFIG_VFAT_SUPPORTED == 1)

static const uint8_t dosfs_path_ldir_name_table[13] = {
    offsetof(dosfs_ldir_t, ldir_name_1[0]),
    offsetof(dosfs_ldir_t, ldir_name_1[2]),
    offsetof(dosfs_ldir_t, ldir_name_1[4]),
    offsetof(dosfs_ldir_t, ldir_name_1[6]),
    offsetof(dosfs_ldir_t, ldir_name_1[8]),
    offsetof(dosfs_ldir_t, ldir_name_2[0]),
    offsetof(dosfs_ldir_t, ldir_name_2[2]),
    offsetof(dosfs_ldir_t, ldir_name_2[4]),
    offsetof(dosfs_ldir_t, ldir_name_2[6]),
    offsetof(dosfs_ldir_t, ldir_name_2[8]),
    offsetof(dosfs_ldir_t, ldir_name_2[10]),
    offsetof(dosfs_ldir_t, ldir_name_3[0]),
    offsetof(dosfs_ldir_t, ldir_name_3[2]),
};

#endif /* (DOSFS_CONFIG_VFAT_SUPPORTED == 1) */

#define Y2K_TO_GPS_OFFSET    630720000

static void stm32wb_rtc_timedate(uint16_t *p_time, uint16_t *p_date)
{
    stm32wb_rtc_tod_t tod;
    uint32_t seconds, ticks;
    int32_t utc_offset;

    stm32wb_rtc_time_read(&seconds, &ticks);

    utc_offset = stm32wb_rtc_time_to_utc_offset(seconds);

    seconds -= Y2K_TO_GPS_OFFSET;

    stm32wb_rtc_time_to_tod(seconds - utc_offset, ticks, &tod);
    
    *p_time = ((tod.seconds >> 1) | (tod.minutes << 5) | (tod.hours << 11));
    *p_date = ((tod.day << 0) | (tod.month << 5) | ((tod.year + 20) << 9));
}

#define DOSFS_PORT_CORE_TIMEDATE(_ctime, _cdate) stm32wb_rtc_timedate((_ctime),(_cdate))

static int dosfs_volume_init(dosfs_volume_t *volume, dosfs_device_t *device)
{
    int status = F_NO_ERROR;
    uint8_t *cache;

#if (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 1)
    /* In order not to mess up dosfs_volume_t too much, the dosfs_boot_t.bpblog struct is aliased to
     * dosfs_volume_t. The asserts below ensure that the struct elements don't move and mirror
     * the location relative to dosfs_boot_t.
     */
    DOSFS_CT_ASSERT(offsetof(dosfs_boot_t, bpblog.log_map_flags) >= offsetof(dosfs_boot_t, bpb40.bs_reserved_1));
    DOSFS_CT_ASSERT(offsetof(dosfs_boot_t, bpblog.log_map_flags) >= offsetof(dosfs_boot_t, bpb71.bs_reserved_2));
    DOSFS_CT_ASSERT(offsetof(dosfs_boot_t, bpblog.bs_trail_sig) == 510);

    DOSFS_CT_ASSERT(offsetof(dosfs_boot_t, bpblog.log_map_flags) == (offsetof(dosfs_volume_t, map_flags) - offsetof(dosfs_volume_t, bs_data)));
    DOSFS_CT_ASSERT(offsetof(dosfs_boot_t, bpblog.log_map_entries) == (offsetof(dosfs_volume_t, map_entries) - offsetof(dosfs_volume_t, bs_data)));
    DOSFS_CT_ASSERT(offsetof(dosfs_boot_t, bpblog.log_map_table) == (offsetof(dosfs_volume_t, map_table) - offsetof(dosfs_volume_t, bs_data)));
    DOSFS_CT_ASSERT(offsetof(dosfs_boot_t, bpblog.log_map_blkno) == (offsetof(dosfs_volume_t, map_blkno) - offsetof(dosfs_volume_t, bs_data)));
    DOSFS_CT_ASSERT(offsetof(dosfs_boot_t, bpblog.log_free_clscnt) == (offsetof(dosfs_volume_t, free_clscnt) - offsetof(dosfs_volume_t, bs_data)));
    DOSFS_CT_ASSERT(offsetof(dosfs_boot_t, bpblog.log_next_clsno) == (offsetof(dosfs_volume_t, next_clsno) - offsetof(dosfs_volume_t, bs_data)));
    DOSFS_CT_ASSERT(offsetof(dosfs_boot_t, bpblog.log_dir) == (offsetof(dosfs_volume_t, dir) - offsetof(dosfs_volume_t, bs_data)));
    DOSFS_CT_ASSERT(offsetof(dosfs_boot_t, bpblog.log_dir_flags) == (offsetof(dosfs_volume_t, dir_flags) - offsetof(dosfs_volume_t, bs_data)));
    DOSFS_CT_ASSERT(offsetof(dosfs_boot_t, bpblog.log_dir_entries) == (offsetof(dosfs_volume_t, dir_entries) - offsetof(dosfs_volume_t, bs_data)));
    DOSFS_CT_ASSERT(offsetof(dosfs_boot_t, bpblog.log_dir_index) == (offsetof(dosfs_volume_t, dir_index) - offsetof(dosfs_volume_t, bs_data)));
    DOSFS_CT_ASSERT(offsetof(dosfs_boot_t, bpblog.log_dir_clsno) == (offsetof(dosfs_volume_t, dir_clsno) - offsetof(dosfs_volume_t, bs_data)));
    DOSFS_CT_ASSERT(offsetof(dosfs_boot_t, bpblog.log_dot_clsno) == (offsetof(dosfs_volume_t, dot_clsno) - offsetof(dosfs_volume_t, bs_data)));
    DOSFS_CT_ASSERT(offsetof(dosfs_boot_t, bpblog.log_del_clsno) == (offsetof(dosfs_volume_t, del_clsno) - offsetof(dosfs_volume_t, bs_data)));
    DOSFS_CT_ASSERT(offsetof(dosfs_boot_t, bpblog.log_del_index) == (offsetof(dosfs_volume_t, del_index) - offsetof(dosfs_volume_t, bs_data)));
    DOSFS_CT_ASSERT(offsetof(dosfs_boot_t, bpblog.log_del_entries) == (offsetof(dosfs_volume_t, del_entries) - offsetof(dosfs_volume_t, bs_data)));

#if (DOSFS_CONFIG_VFAT_SUPPORTED == 1)
    DOSFS_CT_ASSERT(offsetof(dosfs_boot_t, bpblog.log_lfn_count) == (offsetof(dosfs_volume_t, lfn_count) - offsetof(dosfs_volume_t, bs_data)));
    DOSFS_CT_ASSERT(offsetof(dosfs_boot_t, bpblog.log_lfn_blkno) == (offsetof(dosfs_volume_t, lfn_blkno) - offsetof(dosfs_volume_t, bs_data)));
#if (DOSFS_CONFIG_UTF8_SUPPORTED == 0)
    DOSFS_CT_ASSERT(offsetof(dosfs_boot_t, bpblog.log_lfn_name) == (offsetof(dosfs_volume_t, lfn_name) - offsetof(dosfs_volume_t, bs_data)));
    DOSFS_CT_ASSERT(offsetof(dosfs_boot_t, bpblog.bs_trail_sig) == (offsetof(dosfs_volume_t, bs_trail_sig) - offsetof(dosfs_volume_t, bs_data)));
#else /* (DOSFS_CONFIG_UTF8_SUPPORTED == 0) */
    DOSFS_CT_ASSERT(offsetof(dosfs_boot_t, bpblog.bs_trail_sig) == (offsetof(dosfs_volume_t, bs_trail_sig) - offsetof(dosfs_volume_t, lfn_name)));
#endif /* (DOSFS_CONFIG_UTF8_SUPPORTED == 0) */
#else /* (DOSFS_CONFIG_VFAT_SUPPORTED == 1) */
    DOSFS_CT_ASSERT(offsetof(dosfs_boot_t, bpblog.bs_trail_sig) == (offsetof(dosfs_volume_t, bs_trail_sig) - offsetof(dosfs_volume_t, bs_data)));
#endif /* (DOSFS_CONFIG_VFAT_SUPPORTED == 1) */
#endif /* (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 1) */

    cache = (uint8_t*)&dosfs_cache[0];
    volume->dir_cache.data = (uint8_t*)&device->cache[0];
#if (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 1)
    volume->map_cache.data = cache;
    cache += DOSFS_BLK_SIZE;
#endif /* (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 1) */

