GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/dosfs_core.c
#if (DOSFS_CONFIG_FAT_CACHE_ENTRIES != 0)
#if (DOSFS_CONFIG_FAT_CACHE_ENTRIES == 1)
    volume->fat_cache.data =  (uint8_t*)&device->cache[0] + DOSFS_BLK_SIZE;
#else /* (DOSFS_CONFIG_FAT_CACHE_ENTRIES == 1) */
    volume->fat_cache[0].data = (uint8_t*)&device->cache[0] + DOSFS_BLK_SIZE;
    volume->fat_cache[1].data = cache;
    cache += DOSFS_BLK_SIZE;
#endif /* (DOSFS_CONFIG_FAT_CACHE_ENTRIES == 1) */
#endif /* (DOSFS_CONFIG_FAT_CACHE_ENTRIES != 0) */

#if (DOSFS_CONFIG_DATA_CACHE_ENTRIES != 0)
#if (DOSFS_CONFIG_FILE_DATA_CACHE == 0)
    volume->data_cache.data = cache;
    cache += DOSFS_BLK_SIZE;
#endif /* (DOSFS_CONFIG_FILE_DATA_CACHE == 0) */
#endif /* (DOSFS_CONFIG_DATA_CACHE_ENTRIES != 0) */

    if (device->interface)
    {
        volume->state = DOSFS_VOLUME_STATE_INITIALIZED;
        volume->flags = 0;
        volume->media = DOSFS_MEDIA_NONE;
    }
    else
    {
        status = F_ERR_INITFUNC;
    }

    return status;
}

static int dosfs_volume_mount(dosfs_volume_t * volume)
{
    int status = F_NO_ERROR;
    dosfs_device_t *device;
    uint8_t media, write_protected;
    uint32_t boot_blkno, tot_sec, cls_mask, cls_shift, blkcnt, au_size, product;
#if (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 1)
    uint32_t boot_blkcnt;
#endif /* (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 1) */
#if (DOSFS_CONFIG_FSINFO_SUPPORTED == 1)
    uint32_t next_clsno;
#endif /* (DOSFS_CONFIG_FSINFO_SUPPORTED == 1) */
    dosfs_boot_t *boot;
#if (DOSFS_CONFIG_CLUSTER_CACHE_ENTRIES != 0)
    unsigned int index;
#endif /* (DOSFS_CONFIG_CLUSTER_CACHE_ENTRIES != 0) */

    device = DOSFS_VOLUME_DEVICE(volume);

#if (DOSFS_CONFIG_STATISTICS == 1)
    memset(&volume->statistics, 0, sizeof(volume->statistics));
#endif /* (DOSFS_CONFIG_STATISTICS == 1) */

    status = (*device->interface->info)(device->context, &media, &write_protected, &blkcnt, &au_size, &product);

    if (status == F_NO_ERROR)
    {
        if (volume->state == DOSFS_VOLUME_STATE_CARDREMOVED)
        {
            if (volume->product != product)
            {
                volume->state = DOSFS_VOLUME_STATE_UNUSABLE;
                
                status = F_ERR_UNUSABLE;
            }
#if (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 1)
            else
            {
                /* Check whether the log needs to be replayed after a SDCARD power failure.
                 */
                if ((volume->log_lead_sig == DOSFS_HTOFL(DOSFS_LOG_LEAD_SIG)) &&
                    (volume->log_struct_sig == DOSFS_HTOFL(DOSFS_LOG_STRUCT_SIG)))
                {
                    status = dosfs_volume_commit(volume);
                }
            }
#endif /* (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 1) */
        }
        else
        {
            volume->flags = 0;
        
            if (write_protected)
            {
                volume->flags |= DOSFS_VOLUME_FLAG_WRITE_PROTECTED;
            }

            volume->media = media;
            volume->product = product;
            volume->serial = 0;

            boot_blkno = 0;

#if (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 1)
            /* For a FAT32 file system TRANSACTION_SAFE needs 3 blocks,
             * which are #3, #4 & #5, which are conveniantly reserved
             * by the FAT32 spec. FAT16 is somewhat more tricky. There
             * are 2 ways to lay out the BPB relative to FAT/DIR and still
             * respect the erase boundary. One is to used a fixed value
             * of 1 for bpb_rsvd_sec_cnt. That implies that there is at
             * least 1 unused block before the BPB (since FAT/DIR always
             * have an even count). The other variant is to anchor the BPB
             * at an erase boundary, which then results in a bpb_rsvd_sec_cnt
             * of at least 2, again 1 reserved block.
             */
            boot_blkcnt = 0;

            boot = (dosfs_boot_t*)((void*)&volume->bs_data[0]);

#else /* (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 1) */

            boot = (dosfs_boot_t*)((void*)volume->dir_cache.data);

#endif /* (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 1) */

            status = dosfs_volume_read(volume, boot_blkno, (uint8_t*)boot);

            if (status == F_NO_ERROR)
            {
                /* This is somewhat iffy. MMC/SDSC do support a FILE_FORMAT setting in CSD
                 * that points to a FDC descriptor, without partition table. However the
                 * default is to use a partition table (with BPB or extended BPB). Thus
                 * there are checks in place for the presence of a FDC descriptor, and
                 * a validation check for the partition table to filter out exFAT for SDXC.
                 */
               
                if (boot->bs.bs_trail_sig != DOSFS_HTOFS(0xaa55))
                {
                    status = F_ERR_NOTFORMATTED;
                }
                else
                {
                    if (!((boot->bpb.bs_jmp_boot[0] == 0xe9) ||
                          ((boot->bpb.bs_jmp_boot[0] == 0xeb) && (boot->bpb.bs_jmp_boot[2] == 0x90))))
                    {
                        if ((boot->mbr.mbr_par_table[0].mbr_sys_id == 0x01) ||
                            (boot->mbr.mbr_par_table[0].mbr_sys_id == 0x04) ||
                            (boot->mbr.mbr_par_table[0].mbr_sys_id == 0x06) ||
                            (boot->mbr.mbr_par_table[0].mbr_sys_id == 0x0b) ||
                            (boot->mbr.mbr_par_table[0].mbr_sys_id == 0x0c))
                        {
                            boot_blkno = DOSFS_FTOHL(boot->mbr.mbr_par_table[0].mbr_rel_sec);

#if (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 1)
                            if ((boot->mbr.mbr_par_table[1].mbr_sys_id == 0x00) &&
                                (boot->mbr.mbr_par_table[2].mbr_sys_id == 0x00) &&
                                (boot->mbr.mbr_par_table[3].mbr_sys_id == 0x00))
                            {
                                boot_blkcnt = boot_blkno -1;
                            }
#endif /* (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 1) */

                            status = dosfs_volume_read(volume, boot_blkno, (uint8_t*)boot);
                        
                            if (status == F_NO_ERROR)
                            {
                                if ((boot->bs.bs_trail_sig != DOSFS_HTOFS(0xaa55)) ||
                                    !((boot->bpb.bs_jmp_boot[0] == 0xe9) ||
                                      ((boot->bpb.bs_jmp_boot[0] == 0xeb) && (boot->bpb.bs_jmp_boot[2] == 0x90))))
                                {
                                    status = F_ERR_NOTFORMATTED;
                                }
                            }
                        }
                        else
                        {
                            status = F_ERR_INVALIDMEDIA;
                        }
                    }
                }

                if (status == F_NO_ERROR)
                {
                    /* Here we have a valid PBR signature, check whether there is a valid BPB.
                     */

                    /* Legal values for bpb_byts_per_sec are 512, 1024, 2048 and 4096.
                     * Hence if 0x8000 is ored in, it will be illegal. This 0x8000 mask is
                     * used to figure out whether TRANSACTION_SAFE was in dosfs_volume_commit
                     * or not.
                     */

