GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/dosfs_core.c
                    if ((boot->bpb.bpb_byts_per_sec != DOSFS_HTOFS(DOSFS_BLK_SIZE))
#if (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 1)
                        && ((boot->bpb.bpb_byts_per_sec != (0x8000 | DOSFS_HTOFS(DOSFS_BLK_SIZE))) ||
                            (boot->bpblog.log_lead_sig != DOSFS_HTOFL(DOSFS_LOG_LEAD_SIG)) ||
                            (boot->bpblog.log_struct_sig != DOSFS_HTOFL(DOSFS_LOG_STRUCT_SIG)))
#endif /* (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 1) */
                        )
                    {
                        status = F_ERR_NOTSUPPSECTORSIZE;
                    }
                    else if (!boot->bpb.bpb_sec_per_clus || (boot->bpb.bpb_sec_per_clus & (boot->bpb.bpb_sec_per_clus -1)))
                    {
                        status = F_ERR_INVALIDMEDIA;
                    }
                    else if ((boot->bpb.bpb_num_fats == 0) || (boot->bpb.bpb_num_fats > 2))
                    {
                        status = F_ERR_INVALIDMEDIA;
                    }
                    else if (!((boot->bpb.bpb_media == 0xf0) || (boot->bpb.bpb_media >= 0xf8)))
                    {
                        status = F_ERR_INVALIDMEDIA;
                    }
                    else
                    {
#if (DOSFS_CONFIG_VOLUME_DIRTY_SUPPORTED == 1) && (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 0)
                        memcpy(&volume->bs_data[0], boot, sizeof(volume->bs_data));
#endif /* (DOSFS_CONFIG_VOLUME_DIRTY_SUPPORTED == 1) && (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 0) */

                        volume->cls_size = (boot->bpb.bpb_sec_per_clus * DOSFS_BLK_SIZE);
                        volume->cls_mask = volume->cls_size -1;

                        for (cls_mask = 0x8000, cls_shift = 16; !(volume->cls_mask & cls_mask); cls_mask >>= 1, cls_shift--) { }

                        volume->cls_shift = cls_shift;
                        volume->cls_blk_shift = cls_shift - DOSFS_BLK_SHIFT;
                        volume->cls_blk_size = (1 << volume->cls_blk_shift);
                        volume->cls_blk_mask = volume->cls_blk_size -1;

                        volume->boot_blkno = boot_blkno;

                        /* FAT32 differs from FAT12/FAT16 by having bpb_fat_sz_16 forced to 0. 
                         * The bpb_root_ent_cnt is ignored for the decision.
                         */
                        if (boot->bpb.bpb_fat_sz_16 != 0)
                        {
                            /* FAT12/FAT16 */

                            volume->fsinfo_blkofs = 0;
                            volume->bkboot_blkofs = 0;

                            if (boot->bpb.bpb_tot_sec_16 != 0)
                            {
                                tot_sec = DOSFS_FTOHS(boot->bpb.bpb_tot_sec_16);
                            }
                            else
                            {
                                tot_sec = DOSFS_FTOHL(boot->bpb40.bpb_tot_sec_32);
                            }

                            volume->fat_blkcnt = DOSFS_FTOHS(boot->bpb.bpb_fat_sz_16);
                            volume->fat1_blkno = volume->boot_blkno + DOSFS_FTOHS(boot->bpb40.bpb_rsvd_sec_cnt);

                            if (boot->bpb.bpb_num_fats == 1)
                            {
                                volume->fat2_blkno = 0;
                                volume->root_blkno = volume->fat1_blkno + volume->fat_blkcnt;

                            }
                            else
                            {
                                volume->fat2_blkno = volume->fat1_blkno + volume->fat_blkcnt;
                                volume->root_blkno = volume->fat2_blkno + volume->fat_blkcnt;
                            }

                            volume->root_clsno = DOSFS_CLSNO_NONE;
                            volume->root_blkcnt = ((DOSFS_FTOHS(boot->bpb40.bpb_root_ent_cnt) * 32) + DOSFS_BLK_MASK) >> DOSFS_BLK_SHIFT;

                            volume->cls_blk_offset = (volume->root_blkno + volume->root_blkcnt) - (2 << volume->cls_blk_shift);

                            if (boot->bpb40.bs_boot_sig == 0x29)
                            {
                                volume->serial = DOSFS_FTOHL(boot->bpb40.bs_vol_id);

#if (DOSFS_CONFIG_VOLUME_DIRTY_SUPPORTED == 1)
                                if (boot->bpb40.bs_nt_reserved & 0x01)
                                {
                                    volume->flags |= DOSFS_VOLUME_FLAG_MOUNTED_DIRTY;
                                }
#endif /* (DOSFS_CONFIG_VOLUME_DIRTY_SUPPORTED == 1) */
                            }
                        }
                        else
                        {
                            /* FAT32 */

                            volume->fsinfo_blkofs = DOSFS_FTOHS(boot->bpb71.bpb_fsinfo);
                            volume->bkboot_blkofs = DOSFS_FTOHS(boot->bpb71.bpb_bkboot);

                            tot_sec = DOSFS_FTOHL(boot->bpb71.bpb_tot_sec_32);

                            volume->fat_blkcnt = DOSFS_FTOHL(boot->bpb71.bpb_fat_sz_32);
                            volume->fat1_blkno = volume->boot_blkno + DOSFS_FTOHS(boot->bpb71.bpb_rsvd_sec_cnt);

                            /* It's tempting to use bpb71.bpb_ext_flags here to modify mirroring, 
                             * it seems to be problematic. For one most of the OSes do not support
                             * or respect this flag. The other minor detail is that Win95/Win98
                             * do use different settings than Win2k/WinXP/Win7.
                             */
                            if (boot->bpb.bpb_num_fats == 1)
                            {
                                volume->fat2_blkno = 0;

                                volume->cls_blk_offset = (volume->fat1_blkno + volume->fat_blkcnt) - (2 << volume->cls_blk_shift);
                            }
                            else
                            {
                                volume->fat2_blkno = volume->fat1_blkno + volume->fat_blkcnt;

                                volume->cls_blk_offset = (volume->fat2_blkno + volume->fat_blkcnt) - (2 << volume->cls_blk_shift);
                            }

                            volume->root_clsno = DOSFS_FTOHL(boot->bpb71.bpb_root_clus);
                            volume->root_blkno = volume->cls_blk_offset + (volume->root_clsno << volume->cls_blk_shift);
                            volume->root_blkcnt = volume->cls_blk_size;

                            if (boot->bpb71.bs_boot_sig == 0x29)
                            {
                                volume->serial = DOSFS_FTOHL(boot->bpb71.bs_vol_id);

