GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/dosfs_core.c
#if (DOSFS_CONFIG_VOLUME_DIRTY_SUPPORTED == 1)
                                if (boot->bpb71.bs_nt_reserved & 0x01)
                                {
                                    volume->flags |= DOSFS_VOLUME_FLAG_MOUNTED_DIRTY;
                                }
#endif /* (DOSFS_CONFIG_VOLUME_DIRTY_SUPPORTED == 1) */
                            }
                        }

                        if (status == F_NO_ERROR)
                        {
                            volume->last_clsno = (((boot_blkno + tot_sec) - volume->cls_blk_offset) >> volume->cls_blk_shift) -1;

#if (DOSFS_CONFIG_SEQUENTIAL_SUPPORTED == 1) || (DOSFS_CONFIG_CONTIGUOUS_SUPPORTED == 1)
                            if (au_size == 0)
                            {
                                if (media == DOSFS_MEDIA_SFLASH)
                                {
                                    /* NOR based sflash has a virtual AU size of 64k ...
                                     */
                                    au_size = 128;
                                }
                                else
                                {
                                    /* Estimate the upper limit of the AU Size according to 4.13.1.8.1 from
                                     * the blkcnt to compute volume->au_size, used to align contiguous
                                     * cluster allocations.
                                     */
                                    
                                    if (blkcnt < 4209984)
                                    {
                                        if (blkcnt <= 131072)        /* <= 64MB  -> 512k */
                                        {
                                            au_size = 1024;
                                        }
                                        else if (blkcnt <= 524288)   /* <= 256MB -> 1MB  */
                                        {
                                            au_size = 2048;
                                        }
                                        else                         /* <= 1GB   -> 2MB  */
                                        {
                                            au_size = 4096;
                                        }
                                    }
                                    else
                                    {
                                        /* SDXC may have a larger AU size, but the spec calls out for speed class recording
                                         * to use 4MB as a basis.
                                         */
                                        au_size = 8192;
                                    }
                                }
                            }

                            volume->au_size = au_size;
                            
                            volume->start_clsno = ((((volume->cls_blk_offset + (2 << volume->cls_blk_shift) + au_size -1)
                                                     / au_size) * au_size)
                                                   - volume->cls_blk_offset) >> volume->cls_blk_shift;
                            volume->end_clsno = ((((((volume->last_clsno +1) << volume->cls_blk_shift) + volume->cls_blk_offset)
                                                   / au_size) * au_size)
                                                 - volume->cls_blk_offset) >> volume->cls_blk_shift;
#endif /* (DOSFS_CONFIG_SEQUENTIAL_SUPPORTED == 1) || (DOSFS_CONFIG_CONTIGUOUS_SUPPORTED == 1) */

                            if (status == F_NO_ERROR)
                            {
                                if ((volume->last_clsno -1) < 4085)
                                {
#if (DOSFS_CONFIG_FAT12_SUPPORTED == 1)
                                    volume->type = DOSFS_VOLUME_TYPE_FAT12;
#else /* (DOSFS_CONFIG_FAT12_SUPPORTED == 1) */
                                    status = F_ERR_INVALIDMEDIA;
#endif /* (DOSFS_CONFIG_FAT12_SUPPORTED == 1) */
                                }
                                else
                                {
                                    if ((volume->last_clsno -1) < 65525)
                                    {
                                        volume->type = DOSFS_VOLUME_TYPE_FAT16;
                                    }
                                    else
                                    {
                                        volume->type = DOSFS_VOLUME_TYPE_FAT32;
                                    }
                                }

                                if (status == F_NO_ERROR)
                                {
                                    /* Assign the caches.
                                     */
                                    volume->dir_cache.blkno = DOSFS_BLKNO_INVALID;

#if (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 1)
                                    volume->map_cache.blkno = DOSFS_BLKNO_INVALID;
#endif /* (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 1) */

#if (DOSFS_CONFIG_FAT_CACHE_ENTRIES != 0)
#if (DOSFS_CONFIG_FAT_CACHE_ENTRIES == 1)
                                    volume->fat_cache.blkno = DOSFS_BLKNO_INVALID;
#else /* (DOSFS_CONFIG_FAT_CACHE_ENTRIES == 1) */
                                    volume->fat_cache[0].blkno = DOSFS_BLKNO_INVALID;
                                    volume->fat_cache[1].blkno = DOSFS_BLKNO_INVALID;
#endif /* (DOSFS_CONFIG_FAT_CACHE_ENTRIES == 1) */
#endif /* (DOSFS_CONFIG_FAT_CACHE_ENTRIES != 0) */
                            
#if (DOSFS_CONFIG_FILE_DATA_CACHE == 0)
                                    volume->data_file = NULL;
#if (DOSFS_CONFIG_DATA_CACHE_ENTRIES != 0)
                                    volume->data_cache.blkno = DOSFS_BLKNO_INVALID;
#endif /* (DOSFS_CONFIG_DATA_CACHE_ENTRIES != 0) */
#endif /* (DOSFS_CONFIG_FILE_DATA_CACHE == 0) */
                            
#if (DOSFS_CONFIG_CLUSTER_CACHE_ENTRIES != 0)
                                    for (index = 0; index < DOSFS_CONFIG_CLUSTER_CACHE_ENTRIES; index++)
                                    {
                                        volume->cluster_cache[index].clsno   = DOSFS_CLSNO_NONE;
                                        volume->cluster_cache[index].clsdata = DOSFS_CLSNO_NONE;
                                    }
#endif /* (DOSFS_CONFIG_CLUSTER_CACHE_ENTRIES != 0) */
                            
                                    volume->cwd_clsno = DOSFS_CLSNO_NONE;

                                    volume->files = NULL;

#if (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 1)
                                    if (!write_protected)
                                    {
                                        /* Check whether the log needs to be replayed, or whether
                                         * the BPB has to be set up in memory.
                                         */
                                        if ((boot->bpblog.log_lead_sig == DOSFS_HTOFL(DOSFS_LOG_LEAD_SIG)) &&
                                            (boot->bpblog.log_struct_sig == DOSFS_HTOFL(DOSFS_LOG_STRUCT_SIG)))
                                        {
                                            status = dosfs_volume_commit(volume);
                                        }
                                        else
                                        {
                                            if ((boot->bpb.bpb_num_fats == 2) && (volume->fat_blkcnt <= 8192))
                                            {
                                                if (volume->type != DOSFS_VOLUME_TYPE_FAT32)
                                                {
                                                    if (DOSFS_FTOHS(boot->bpb40.bpb_rsvd_sec_cnt) != 1)
                                                    {
                                                        boot->bpblog.log_lfn_blkno = volume->boot_blkno +1;
                                                    }
                                                    else
                                                    {
                                                        if (boot_blkcnt == 0)
                                                        {
                                                            status = F_ERR_UNUSABLE;
                                                        }
                                                        else
                                                        {
                                                            boot->bpblog.log_lfn_blkno = volume->boot_blkno -1;
                                                        }
                                                    }
                                            
                                                    boot->bpblog.log_map_blkno = DOSFS_BLKNO_RESERVED;
                                                }
                                                else
                                                {
                                                    if ((volume->fsinfo_blkofs != 1) || (volume->bkboot_blkofs != 6))
                                                    {
                                                        status = F_ERR_UNUSABLE;
                                                    }
                                                    else
                                                    {
                                                        boot->bpblog.log_lfn_blkno = volume->boot_blkno +3;
                                                        boot->bpblog.log_map_blkno = volume->boot_blkno +4;
                                                    }
                                                }
                                        
                                                if (status == F_NO_ERROR)
                                                {
                                                    boot->bpblog.log_map_flags = 0;
                                                    boot->bpblog.log_map_entries = 0;
                                                    boot->bpblog.log_dir_flags = 0;
                                                    boot->bpblog.log_lead_sig = DOSFS_HTOFL(0x00000000);
                                                    boot->bpblog.log_struct_sig = DOSFS_HTOFL(0x00000000);
                                                }
                                            }
                                            else
                                            {
                                                status = F_ERR_UNUSABLE;
                                            }
                                        }
                                    }
                                    else
                                    {
                                        status = F_ERR_WRITEPROTECT;
                                    }
                                
#if (DOSFS_CONFIG_FSINFO_SUPPORTED == 1)
                                    /* For TRANSACTION_SAFE the FSINFO might have been already read
                                     * throu dosfs_volume_commit(). In this case DOSFS_VOLUME_FLAG_FSINFO_VALID
                                     * would be already set ...
                                     */
                                    if (!(volume->flags & DOSFS_VOLUME_FLAG_FSINFO_VALID))
#endif /* (DOSFS_CONFIG_FSINFO_SUPPORTED == 1) */
#endif /* (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 1) */
                                    {
                                        volume->next_clsno = 2;
                                
#if (DOSFS_CONFIG_FSINFO_SUPPORTED == 1)
                                        volume->free_clscnt = 0;

                                        if (status == F_NO_ERROR)
                                        {
                                            if (volume->fsinfo_blkofs != 0)
                                            {
                                                dosfs_fsinfo_t *fsinfo = (dosfs_fsinfo_t*)((void*)volume->dir_cache.data);

                                                status = dosfs_volume_read(volume, volume->boot_blkno + volume->fsinfo_blkofs, (uint8_t*)fsinfo);
                                    
                                                if (status == F_NO_ERROR)
                                                {
                                                    if ((fsinfo->fsi_lead_sig  == DOSFS_HTOFL(0x41615252)) &&
                                                        (fsinfo->fsi_struc_sig == DOSFS_HTOFL(0x61417272)) &&
                                                        (fsinfo->fsi_trail_sig == DOSFS_HTOFL(0xaa550000)))
                                                    {
#if (DOSFS_CONFIG_VOLUME_DIRTY_SUPPORTED == 1)
                                                        if (!(volume->flags & DOSFS_VOLUME_FLAG_MOUNTED_DIRTY))
#endif /* (DOSFS_CONFIG_VOLUME_DIRTY_SUPPORTED == 1) */
                                                        {
                                                            if (fsinfo->fsi_free_count != 0xffffffff)
                                                            {
                                                                volume->free_clscnt = DOSFS_FTOHL(fsinfo->fsi_free_count);
                                                        
                                                                if (volume->free_clscnt <= (volume->last_clsno -1))
                                                                {
                                                                    volume->flags |= DOSFS_VOLUME_FLAG_FSINFO_VALID;
                                                                }
                                                            }
                                                        }

                                                        if (fsinfo->fsi_nxt_free != 0xffffffff)
                                                        {
                                                            next_clsno = DOSFS_FTOHL(fsinfo->fsi_nxt_free);

                                                            if ((next_clsno >= 2) && (next_clsno <= volume->last_clsno))
                                                            {
                                                                volume->next_clsno = next_clsno;
                                                            }
                                                        }
                                                    }
                                                }
                                            }
                                        }
#endif /* (DOSFS_CONFIG_FSINFO_SUPPORTED == 1) */
                                    }

                                    if (status == F_NO_ERROR)
                                    {
#if (DOSFS_CONFIG_SEQUENTIAL_SUPPORTED == 1) 
                                        volume->free_clsno = volume->start_clsno;
                                        volume->base_clsno = volume->start_clsno;
                                        volume->limit_clsno = volume->start_clsno;
#endif /* (DOSFS_CONFIG_SEQUENTIAL_SUPPORTED == 1) */
                                    }
                                }
                            }
                        }
                    }
                }
            }
        }
        
        if (status == F_NO_ERROR)
        {
            volume->state = DOSFS_VOLUME_STATE_MOUNTED;
        }
    }

