GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/dosfs_core.c
    return status;
}


static int dosfs_volume_unmount(dosfs_volume_t * volume)
{
    int status = F_NO_ERROR;

    if (volume->state >= DOSFS_VOLUME_STATE_MOUNTED)
    {
        while ((status == F_NO_ERROR) && volume->files)
        {
            status = dosfs_file_close(volume, volume->files);
        }

        if (status == F_NO_ERROR)
        {
            /* Revert the state to be DOSFS_VOLUME_STATE_INITIALIZED, so that can be remounted.
             */
            volume->state = DOSFS_VOLUME_STATE_INITIALIZED;
        }
    }

    return status;
}

static int dosfs_volume_lock(dosfs_volume_t *volume)
{
    int status = F_NO_ERROR;

    if (volume->state == DOSFS_VOLUME_STATE_NONE)
    {
        status = F_ERR_INITFUNC;
    }
    else
    {
        if (volume->state == DOSFS_VOLUME_STATE_UNUSABLE)
        {
            status = F_ERR_UNUSABLE;
        }
        else
        {
            /*
             * Check here whether the volume is mounted. If not mount it. If it cannot
             * be mounted, throw an error.
             */
            
            if (volume->state != DOSFS_VOLUME_STATE_MOUNTED)
            {
                if (volume->state == DOSFS_VOLUME_STATE_NONE)
                {
                    status = F_ERR_INITFUNC;
                }
                else
                {
                    status = dosfs_volume_mount(volume);
                }
            }
        }
    }

    return status;
}

static int dosfs_volume_lock_noinit(dosfs_volume_t *volume)
{
    int status = F_NO_ERROR;

    return status;
}

static int  dosfs_volume_lock_nomount(dosfs_volume_t *volume)
{
    int status = F_NO_ERROR;

    if (volume->state == DOSFS_VOLUME_STATE_NONE)
    {
        status = F_ERR_INITFUNC;
    }

    return status;
}

static int dosfs_volume_unlock(dosfs_volume_t *volume, int status)
{
    if (status != F_NO_ERROR)
    {
#if (DOSFS_CONFIG_MEDIA_FAILURE_SUPPORTED == 1)
        if (status == F_ERR_INVALIDSECTOR)
        {
            volume->flags |= DOSFS_VOLUME_FLAG_MEDIA_FAILURE;
        }
        else
#endif /* (DOSFS_CONFIG_MEDIA_FAILURE_SUPPORTED == 1) */
        {
            if (status == F_ERR_CARDREMOVED)
            {
                volume->state = DOSFS_VOLUME_STATE_CARDREMOVED;
            }

            if (status == F_ERR_UNUSABLE)
            {
                volume->state = DOSFS_VOLUME_STATE_UNUSABLE;
            }
        }
    }

    return status;
}

static int dosfs_volume_read(dosfs_volume_t *volume, uint32_t address, uint8_t *data)
{
    int status = F_NO_ERROR;
    dosfs_device_t *device;
#if (DOSFS_CONFIG_META_DATA_RETRIES != 0)
    unsigned int retries = DOSFS_CONFIG_META_DATA_RETRIES +1;
#else /* (DOSFS_CONFIG_META_DATA_RETRIES != 0) */
    unsigned int retries = 0;
#endif /* (DOSFS_CONFIG_META_DATA_RETRIES != 0) */

    device = DOSFS_VOLUME_DEVICE(volume);

    do
    {
        status = (*device->interface->read)(device->context, address, data, 1, false);
                
        if ((status == F_ERR_ONDRIVE) && (retries >= 1))
        {
            status = F_NO_ERROR;
            retries--;
        }
        else
        {
            retries = 0;
        }
    }
    while ((status == F_NO_ERROR) && retries);

#if (DOSFS_CONFIG_MEDIA_FAILURE_SUPPORTED == 1)
    if (status == F_ERR_INVALIDSECTOR)
    {
        volume->flags |= DOSFS_VOLUME_FLAG_MEDIA_FAILURE;
    }
#endif /* (DOSFS_CONFIG_MEDIA_FAILURE_SUPPORTED == 1) */

    if (status != F_NO_ERROR)
    {
        if (status != F_ERR_CARDREMOVED)
        {
            status = F_ERR_UNUSABLE;
        }
    }

    return status;
}

static int dosfs_volume_write(dosfs_volume_t *volume, uint32_t address, const uint8_t *data)
{
    int status = F_NO_ERROR;
    dosfs_device_t *device;
#if (DOSFS_CONFIG_META_DATA_RETRIES != 0)
    unsigned int retries = DOSFS_CONFIG_META_DATA_RETRIES +1;
#else /* (DOSFS_CONFIG_META_DATA_RETRIES != 0) */
    unsigned int retries = 0;
#endif /* (DOSFS_CONFIG_META_DATA_RETRIES != 0) */

    device = DOSFS_VOLUME_DEVICE(volume);

    do
    {
	status = (*device->interface->write)(device->context, address, data, 1, 0, true);
                
        if ((status == F_ERR_ONDRIVE) && (retries >= 1))
        {
            status = F_NO_ERROR;
            retries--;
        }
        else
        {
            retries = 0;
        }
    }
    while ((status == F_NO_ERROR) && retries);

#if (DOSFS_CONFIG_MEDIA_FAILURE_SUPPORTED == 1)
    if (status == F_ERR_INVALIDSECTOR)
    {
        volume->flags |= DOSFS_VOLUME_FLAG_MEDIA_FAILURE;
    }
#endif /* (DOSFS_CONFIG_MEDIA_FAILURE_SUPPORTED == 1) */

    if (status != F_NO_ERROR)
    {
        if (status != F_ERR_CARDREMOVED)
        {
            status = F_ERR_UNUSABLE;
        }
    }

    if (status == F_NO_ERROR)
    {
	armv7m_atomic_or(&device->lock, DOSFS_DEVICE_LOCK_MODIFIED);
    }

    return status;
}

static int  dosfs_volume_zero(dosfs_volume_t *volume, uint32_t address, uint32_t length, bool wait)
{
    int status = F_NO_ERROR;
    dosfs_device_t *device;
    uint32_t total;
    uint8_t *data;

    device = DOSFS_VOLUME_DEVICE(volume);

    status = dosfs_dir_cache_flush(volume);

    if (status == F_NO_ERROR)
    {
        data = volume->dir_cache.data;
        volume->dir_cache.blkno = DOSFS_BLKNO_INVALID;
        
        memset(data, 0, DOSFS_BLK_SIZE);

	total = (length == 1) ? 0 : length;
	
        do
        {
            status = (*device->interface->write)(device->context, address, data, 1, total, ((length == 1) ? wait : false));

            if (status == F_NO_ERROR)
            {
                armv7m_atomic_or(&device->lock, DOSFS_DEVICE_LOCK_MODIFIED);
            }

            address++;
            length--;
	    total = 0;
        }
        while ((status == F_NO_ERROR) && length);
    }

#if (DOSFS_CONFIG_MEDIA_FAILURE_SUPPORTED == 1)
    if (status == F_ERR_INVALIDSECTOR)
    {
        volume->flags |= DOSFS_VOLUME_FLAG_MEDIA_FAILURE;
    }
#endif /* (DOSFS_CONFIG_MEDIA_FAILURE_SUPPORTED == 1) */

    if (wait)
    {
        if (status != F_NO_ERROR)
        {
            if (status != F_ERR_CARDREMOVED)
            {
                status = F_ERR_UNUSABLE;
            }
        }
    }

