GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/dosfs_core.c
    return status;
}

#if (DOSFS_CONFIG_FSINFO_SUPPORTED == 1)

static int dosfs_volume_fsinfo(dosfs_volume_t *volume, uint32_t free_clscnt, uint32_t next_clsno)
{
    int status = F_NO_ERROR;
    uint32_t blkno;
    dosfs_fsinfo_t *fsinfo;
    
    status = dosfs_dir_cache_flush(volume);
            
    if (status == F_NO_ERROR)
    {
        blkno = (volume->boot_blkno + volume->fsinfo_blkofs);
        fsinfo = (dosfs_fsinfo_t*)((void*)volume->dir_cache.data);
        
        if (volume->dir_cache.blkno != blkno)
        {
            memset((uint8_t*)fsinfo, 0, DOSFS_BLK_SIZE);
            
            fsinfo->fsi_lead_sig   = DOSFS_HTOFL(0x41615252);
            fsinfo->fsi_struc_sig  = DOSFS_HTOFL(0x61417272);
            fsinfo->fsi_trail_sig  = DOSFS_HTOFL(0xaa550000);
            
            volume->dir_cache.blkno = blkno;
        }               
        
        fsinfo->fsi_free_count = DOSFS_HTOFL(free_clscnt);
        fsinfo->fsi_nxt_free   = DOSFS_HTOFL(next_clsno);
        
        status = dosfs_volume_write(volume, blkno, (uint8_t*)fsinfo);
    }

    return status;
}

#endif /* (DOSFS_CONFIG_FSINFO_SUPPORTED == 1) */

#if (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 0)

static int dosfs_volume_dirty(dosfs_volume_t *volume)
{
    int status = F_NO_ERROR;
#if (DOSFS_CONFIG_VOLUME_DIRTY_SUPPORTED == 1)
    dosfs_boot_t *boot;
#endif /* (DOSFS_CONFIG_VOLUME_DIRTY_SUPPORTED == 1) */

    if (volume->state == DOSFS_VOLUME_STATE_MOUNTED)
    {
#if (DOSFS_CONFIG_VOLUME_DIRTY_SUPPORTED == 1)
        if (!(volume->flags & DOSFS_VOLUME_FLAG_MOUNTED_DIRTY) &&
            !(volume->flags & DOSFS_VOLUME_FLAG_VOLUME_DIRTY))
        {
            status = dosfs_dir_cache_flush(volume);

            if (status == F_NO_ERROR)
            {
                boot = (dosfs_boot_t*)((void*)volume->dir_cache.data);

                if (volume->dir_cache.blkno != volume->boot_blkno)
                {
                    memcpy((uint8_t*)boot, volume->bs_data, sizeof(volume->bs_data));
                    memset((uint8_t*)boot + sizeof(volume->bs_data), 0, 510 - sizeof(volume->bs_data));

                    boot->bpb.bs_trail_sig = DOSFS_HTOFS(0xaa55);

                    volume->dir_cache.blkno = volume->boot_blkno;
                }

                if (status == F_NO_ERROR)
                {
                    if (volume->type == DOSFS_VOLUME_TYPE_FAT32)
                    {
                        boot->bpb71.bs_nt_reserved |= 0x01;
                    }
                    else
                    {
                        boot->bpb40.bs_nt_reserved |= 0x01;
                    }

#if (DOSFS_CONFIG_MEDIA_FAILURE_SUPPORTED == 1)
                    if (volume->flags & DOSFS_VOLUME_FLAG_MEDIA_FAILURE)
                    {
                        if (volume->type == DOSFS_VOLUME_TYPE_FAT32)
                        {
                            boot->bpb71.bs_nt_reserved |= 0x02;
                        }
                        else
                        {
                            boot->bpb40.bs_nt_reserved |= 0x02;
                        }
                    }
#endif /* (DOSFS_CONFIG_MEDIA_FAILURE_SUPPORTED == 1) */
                    
                    status = dosfs_volume_write(volume, volume->boot_blkno, (uint8_t*)boot);

                    if (status == F_NO_ERROR)
                    {
                        volume->flags |= DOSFS_VOLUME_FLAG_VOLUME_DIRTY;
                    }
                }
            }
        }
#endif /* (DOSFS_CONFIG_VOLUME_DIRTY_SUPPORTED == 1) */
    }

    return status;
}

static int dosfs_volume_clean(dosfs_volume_t *volume, int status_o)
{
    int status = F_NO_ERROR;
#if (DOSFS_CONFIG_VOLUME_DIRTY_SUPPORTED == 1)
    dosfs_boot_t *boot;
#endif /* (DOSFS_CONFIG_VOLUME_DIRTY_SUPPORTED == 1) */

    if (volume->state == DOSFS_VOLUME_STATE_MOUNTED)
    {
#if (DOSFS_CONFIG_VOLUME_DIRTY_SUPPORTED == 1)
#if (DOSFS_CONFIG_FSINFO_SUPPORTED == 1)
        if ((volume->fsinfo_blkofs != 0) &&
            (volume->flags & DOSFS_VOLUME_FLAG_FSINFO_DIRTY))
        {
            if (!(volume->flags & DOSFS_VOLUME_FLAG_MOUNTED_DIRTY) &&
                (volume->flags & DOSFS_VOLUME_FLAG_FSINFO_VALID))
            {
                status = dosfs_volume_fsinfo(volume, volume->free_clscnt, volume->next_clsno);
            }
            else
            {
                status = dosfs_volume_fsinfo(volume, 0xffffffff, volume->next_clsno);
            }
            
            if (status == F_NO_ERROR)
            {
                volume->flags &= ~DOSFS_VOLUME_FLAG_FSINFO_DIRTY;
            }
        }
#endif /* (DOSFS_CONFIG_FSINFO_SUPPORTED == 1) */

        if (!(volume->flags & DOSFS_VOLUME_FLAG_MOUNTED_DIRTY) &&
            (volume->flags & DOSFS_VOLUME_FLAG_VOLUME_DIRTY))
        {
            status = dosfs_dir_cache_flush(volume);

            if (status == F_NO_ERROR)
            {
                boot = (dosfs_boot_t*)((void*)volume->dir_cache.data);

                if (volume->dir_cache.blkno != volume->boot_blkno)
                {
                    memcpy((uint8_t*)boot, volume->bs_data, 90);
                    memset((uint8_t*)boot + 90, 0, 510 - 90);

                    boot->bpb.bs_trail_sig = DOSFS_HTOFS(0xaa55);

                    volume->dir_cache.blkno = volume->boot_blkno;
                }

                if (status == F_NO_ERROR)
                {
                    if (volume->type == DOSFS_VOLUME_TYPE_FAT32)
                    {
                        boot->bpb71.bs_nt_reserved &= ~0x01;
                    }
                    else
                    {
                        boot->bpb40.bs_nt_reserved &= ~0x01;
                    }

#if (DOSFS_CONFIG_MEDIA_FAILURE_SUPPORTED == 1)
                    if (volume->flags & DOSFS_VOLUME_FLAG_MEDIA_FAILURE)
                    {
                        if (volume->type == DOSFS_VOLUME_TYPE_FAT32)
                        {
                            boot->bpb71.bs_nt_reserved |= 0x02;
                        }
                        else
                        {
                            boot->bpb40.bs_nt_reserved |= 0x02;
                        }
                    }
#endif /* (DOSFS_CONFIG_MEDIA_FAILURE_SUPPORTED == 1) */
                    
                    status = dosfs_volume_write(volume, volume->boot_blkno, (uint8_t*)boot);

                    if (status == F_NO_ERROR)
                    {
                        volume->flags &= ~DOSFS_VOLUME_FLAG_VOLUME_DIRTY;
                    }
                }
            }
        }

#else /* (DOSFS_CONFIG_VOLUME_DIRTY_SUPPORTED == 1) */
#if (DOSFS_CONFIG_FSINFO_SUPPORTED == 1)
        if ((volume->fsinfo_blkofs != 0) &&
            (volume->flags & DOSFS_VOLUME_FLAG_FSINFO_DIRTY))
        {
            status = dosfs_volume_fsinfo(volume, 0xffffffff, volume->next_clsno);
            
            if (status == F_NO_ERROR)
            {
                volume->flags &= ~DOSFS_VOLUME_FLAG_FSINFO_DIRTY;
            }
        }
#endif /* (DOSFS_CONFIG_FSINFO_SUPPORTED == 1) */
#endif /* (DOSFS_CONFIG_VOLUME_DIRTY_SUPPORTED == 1) */
    }

    if (status_o != F_NO_ERROR)
    {
        status = status_o;
    }

