GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/dosfs_core.c
    return status;
}

#else /* (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 0) */

static int dosfs_volume_record(dosfs_volume_t *volume)
{
    int status = F_NO_ERROR;
#if (DOSFS_CONFIG_VFAT_SUPPORTED == 1) && (DOSFS_CONFIG_UTF8_SUPPORTED == 1)
    uint16_t bs_trail_sig;
#endif /* (DOSFS_CONFIG_VFAT_SUPPORTED == 1) && (DOSFS_CONFIG_UTF8_SUPPORTED == 1) */
    dosfs_boot_t *boot;

    status = dosfs_map_cache_flush(volume);

    if (status == F_NO_ERROR)
    {
        if (volume->map_flags
            || ((volume->dir_flags & (DOSFS_DIR_FLAG_DESTROY_ENTRY | DOSFS_DIR_FLAG_CREATE_ENTRY)) == (DOSFS_DIR_FLAG_DESTROY_ENTRY | DOSFS_DIR_FLAG_CREATE_ENTRY))
#if (DOSFS_CONFIG_VFAT_SUPPORTED == 1)
            || ((volume->dir_flags & DOSFS_DIR_FLAG_DESTROY_ENTRY) && volume->del_entries)
            || ((volume->dir_flags & DOSFS_DIR_FLAG_CREATE_ENTRY) && volume->dir_entries)
#endif /* (DOSFS_CONFIG_VFAT_SUPPORTED == 1) */
            )
        {
            boot = (dosfs_boot_t*)((void*)&volume->bs_data[0]);

            /* Make sure the file system is marked unusable other
             * than for TRANSACTION_SAFE recovery.
             */
            boot->bpb.bpb_byts_per_sec |= 0x8000;

            /* Fill in the heads to signal an uncomitted dosfs_volume_record().
             */
            boot->bpblog.log_lead_sig = DOSFS_HTOFL(DOSFS_LOG_LEAD_SIG);
            boot->bpblog.log_struct_sig = DOSFS_HTOFL(DOSFS_LOG_STRUCT_SIG);

#if (DOSFS_CONFIG_MEDIA_FAILURE_SUPPORTED == 1)
            if (volume->flags & DOSFS_VOLUME_FLAG_MEDIA_FAILURE)
            {
                if (volume->type == DOSFS_VOLUME_TYPE_FAT32)
                {
                    boot->bpb71.bs_nt_reserved |= 0x02;
                }
                else
                {
                    boot->bpb40.bs_nt_reserved |= 0x02;
                }
            }
#endif /* (DOSFS_CONFIG_MEDIA_FAILURE_SUPPORTED == 1) */
            
#if (DOSFS_CONFIG_VFAT_SUPPORTED == 1) && (DOSFS_CONFIG_UTF8_SUPPORTED == 1)
            /* If VFAT and UTF8 are enabled, VFAT uses uint16_t per lfn_name character. That will
             * overflow the boot sector with the maximum length of 255. Hence detect the overflow
             * case, and write the lfn_name to a separate block, patch in the bs_trail_sig, 
             * write the boot block, and then undo the patching of the bs_trail_sig.
             */
            if ((volume->dir_flags & DOSFS_DIR_FLAG_CREATE_ENTRY) &&
                (volume->dir_entries != 0) &&
                (volume->lfn_count > 128))
            {
                status = dosfs_volume_write(volume, volume->lfn_blkno, (uint8_t*)volume->lfn_name);
            }
            
            if (status == F_NO_ERROR)
            {
                bs_trail_sig = boot->bpb.bs_trail_sig;
                
                boot->bpb.bs_trail_sig = DOSFS_HTOFS(0xaa55);
                
                status = dosfs_volume_write(volume, volume->boot_blkno, (uint8_t*)boot);
                
                boot->bpb.bs_trail_sig = bs_trail_sig;
            }
#else /* (DOSFS_CONFIG_VFAT_SUPPORTED == 1) && (DOSFS_CONFIG_UTF8_SUPPORTED == 1) */
            status = dosfs_volume_write(volume, volume->boot_blkno, (uint8_t*)boot);
#endif /* (DOSFS_CONFIG_VFAT_SUPPORTED == 1) && (DOSFS_CONFIG_UTF8_SUPPORTED == 1) */
        }

        if (status == F_NO_ERROR)
        {
            status = dosfs_volume_commit(volume);
        }
    }

    return status;
}

static int dosfs_volume_commit(dosfs_volume_t *volume)
{
    int status = F_NO_ERROR;
    uint32_t clsno, blkno, index, clsno_s;
#if (DOSFS_CONFIG_VFAT_SUPPORTED == 1)
    unsigned int sequence, chksum, s, i, cc;
    uint32_t blkno_e, offset;
#if (DOSFS_CONFIG_UTF8_SUPPORTED == 1)
    uint16_t bs_trail_sig;
#endif /* (DOSFS_CONFIG_UTF8_SUPPORTED == 1) */
    dosfs_dir_t *dir_e;
#endif /* (DOSFS_CONFIG_VFAT_SUPPORTED == 1) */
    dosfs_dir_t *dir;
    dosfs_cache_entry_t *entry;
    dosfs_boot_t *boot;

    boot = (dosfs_boot_t*)((void*)&volume->bs_data[0]);
        
    if (boot->bpblog.log_lead_sig == DOSFS_HTOFL(DOSFS_LOG_LEAD_SIG))
    {
#if (DOSFS_CONFIG_VFAT_SUPPORTED == 1) && (DOSFS_CONFIG_UTF8_SUPPORTED == 1)
        /* At this point, the boot block had been loaded. For VFAT and UTF8
         * the remaining lfn_name[] characters have to be loaded as there is
         * not enough space for 255 unicode characters.
         */
        if ((volume->dir_flags & DOSFS_DIR_FLAG_CREATE_ENTRY) &&
            (volume->dir_entries != 0) &&
            (volume->lfn_count > 128))
        {
            status = dosfs_volume_read(volume, volume->lfn_blkno, (uint8_t*)volume->lfn_name);
        }
#endif /* (DOSFS_CONFIG_VFAT_SUPPORTED == 1) && (DOSFS_CONFIG_UTF8_SUPPORTED == 1) */
    }

    if (status == F_NO_ERROR)
    {
        if (volume->map_flags & DOSFS_MAP_FLAG_MAP_CHANGED)
        {
            status = dosfs_map_cache_resolve(volume);
        }
    }

#if (DOSFS_CONFIG_FSINFO_SUPPORTED == 1)
    /* Update the FSINFO before dealing with DOSFS_DIR_FLAG_CREATE_ENTRY, so that
     * volume->dir_cache is valid and not nuked by dosfs_volume_fsinfo.
     * N.b. DOSFS_VOLUME_FLAG_FSINFO_VALID & DOSFS_VOLUME_FLAG_FSINFO_DIRTY are 
     * set if DOSFS_MAP_FLAG_FSINFO was set (which only gets set if there was
     * a map/fat update pending).
     */
    if (status == F_NO_ERROR)
    {
        if ((volume->fsinfo_blkofs != 0) &&
            (volume->flags & DOSFS_VOLUME_FLAG_FSINFO_VALID) &&
            (volume->flags & DOSFS_VOLUME_FLAG_FSINFO_DIRTY))
        {
            status = dosfs_volume_fsinfo(volume, volume->free_clscnt, volume->next_clsno);

            if (status == F_NO_ERROR)
            {
                volume->flags &= ~DOSFS_VOLUME_FLAG_FSINFO_DIRTY;
            }
        }
    }
#endif /* (DOSFS_CONFIG_FSINFO_SUPPORTED == 1) */

    if (status == F_NO_ERROR)
    {
        if (volume->dir_flags & (DOSFS_DIR_FLAG_SYNC_ENTRY | DOSFS_DIR_FLAG_ACCESS_ENTRY | DOSFS_DIR_FLAG_MODIFY_ENTRY))
        {
            clsno = volume->dir_clsno;
            index = volume->dir_index;

            if (clsno == DOSFS_CLSNO_NONE)
            {
                blkno = volume->root_blkno + DOSFS_INDEX_TO_BLKCNT_ROOT(index);
            }
            else
            {
                blkno = DOSFS_CLSNO_TO_BLKNO(clsno) + DOSFS_INDEX_TO_BLKCNT(index);
            }
    
            status = dosfs_dir_cache_read(volume, blkno, &entry);

            if (status == F_NO_ERROR)
            {
                dir = (dosfs_dir_t*)((void*)(entry->data + DOSFS_INDEX_TO_BLKOFS(index)));

                dir->dir_clsno_lo = volume->dir.dir_clsno_lo;
                dir->dir_file_size = volume->dir.dir_file_size;
                
                if (volume->type == DOSFS_VOLUME_TYPE_FAT32)
                {
                    dir->dir_clsno_hi = volume->dir.dir_clsno_hi;
                }
                
                if (volume->dir_flags & DOSFS_DIR_FLAG_ACCESS_ENTRY)
                {
                    dir->dir_acc_date = volume->dir.dir_acc_date;
                }
                
                if (volume->dir_flags & DOSFS_DIR_FLAG_MODIFY_ENTRY)
                {
                    dir->dir_attr |= DOSFS_DIR_ATTR_ARCHIVE;
                    dir->dir_wrt_time = volume->dir.dir_wrt_time;
                    dir->dir_wrt_date = volume->dir.dir_wrt_date;
                }

                status = dosfs_dir_cache_write(volume);

                if (status == F_NO_ERROR)
                {
                    volume->dir_flags &= ~(DOSFS_DIR_FLAG_SYNC_ENTRY | DOSFS_DIR_FLAG_ACCESS_ENTRY | DOSFS_DIR_FLAG_MODIFY_ENTRY);
                }
            }
        }
    }

    if (status == F_NO_ERROR)
    {
        if (volume->dir_flags & DOSFS_DIR_FLAG_DESTROY_ENTRY)
        {
            clsno = volume->del_clsno;
            index = volume->del_index;

            if (clsno == DOSFS_CLSNO_NONE)
            {
                clsno = volume->root_clsno;
                blkno = volume->root_blkno + DOSFS_INDEX_TO_BLKCNT_ROOT(index);
#if (DOSFS_CONFIG_VFAT_SUPPORTED == 1)
                blkno_e = volume->root_blkno + volume->root_blkcnt;
#endif /* (DOSFS_CONFIG_VFAT_SUPPORTED == 1) */
            }
            else
            {
                blkno = DOSFS_CLSNO_TO_BLKNO(clsno) + DOSFS_INDEX_TO_BLKCNT(index);
#if (DOSFS_CONFIG_VFAT_SUPPORTED == 1)
                blkno_e = DOSFS_CLSNO_TO_BLKNO(clsno) + volume->cls_blk_size;
#endif /* (DOSFS_CONFIG_VFAT_SUPPORTED == 1) */
            }
    
            status = dosfs_dir_cache_read(volume, blkno, &entry);

            if (status == F_NO_ERROR)
            {
                dir = (dosfs_dir_t*)((void*)(entry->data + DOSFS_INDEX_TO_BLKOFS(index)));

#if (DOSFS_CONFIG_VFAT_SUPPORTED == 1)
                if (volume->del_entries != 0)
                {
                    sequence = volume->del_entries;
                    
                    dir_e = (dosfs_dir_t*)((void*)(entry->data + DOSFS_BLK_SIZE));
                    
                    do
                    {
                        dir->dir_name[0] = 0xe5;
                        
