GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/dosfs_core.c
                        dir++;
                        
                        if (dir == dir_e)
                        {
                            status = dosfs_dir_cache_write(volume);
                            
                            blkno++;
                            
                            if (blkno == blkno_e)
                            {
                                status = dosfs_cluster_read(volume, clsno, &clsno);
                                
                                if (status == F_NO_ERROR)
                                {
                                    blkno = DOSFS_CLSNO_TO_BLKNO(clsno);
                                    blkno_e = blkno + volume->cls_blk_size;
                                }
                            }
                            
                            if (status == F_NO_ERROR)
                            {
                                status = dosfs_dir_cache_read(volume, blkno, &entry);

                                if (status == F_NO_ERROR)
                                {
                                    dir = (dosfs_dir_t*)((void*)(entry->data));
                                }
                            }
                        }
                        
                        sequence--;
                    }
                    while ((status == F_NO_ERROR) && (sequence != 0));
                }

                if (status == F_NO_ERROR)
#endif /* (DOSFS_CONFIG_VFAT_SUPPORTED == 1) */
                {
                    dir->dir_name[0] = 0xe5;
                    
                    status = dosfs_dir_cache_write(volume);

                    if (status == F_NO_ERROR)
                    {
                        volume->dir_flags &= ~DOSFS_DIR_FLAG_DESTROY_ENTRY;
                    }
                }
            }
        }
    }

    if (status == F_NO_ERROR)
    {
        if (volume->dir_flags & DOSFS_DIR_FLAG_CREATE_ENTRY)
        {
            clsno = volume->dir_clsno;
            index = volume->dir_index;

            if (clsno == DOSFS_CLSNO_NONE)
            {
                clsno = volume->root_clsno;
                blkno = volume->root_blkno + DOSFS_INDEX_TO_BLKCNT_ROOT(index);
#if (DOSFS_CONFIG_VFAT_SUPPORTED == 1)
                blkno_e = volume->root_blkno + volume->root_blkcnt;
#endif /* (DOSFS_CONFIG_VFAT_SUPPORTED == 1) */
            }
            else
            {
                blkno = DOSFS_CLSNO_TO_BLKNO(clsno) + DOSFS_INDEX_TO_BLKCNT(index);
#if (DOSFS_CONFIG_VFAT_SUPPORTED == 1)
                blkno_e = DOSFS_CLSNO_TO_BLKNO(clsno) + volume->cls_blk_size;
#endif /* (DOSFS_CONFIG_VFAT_SUPPORTED == 1) */
            }
    
            status = dosfs_dir_cache_read(volume, blkno, &entry);

            if (status == F_NO_ERROR)
            {
                dir = (dosfs_dir_t*)((void*)(entry->data + DOSFS_INDEX_TO_BLKOFS(index)));
                
#if (DOSFS_CONFIG_VFAT_SUPPORTED == 1)
                if (volume->dir_entries)
                {
                    sequence = 0x40 | volume->dir_entries;
                    chksum = dosfs_name_checksum_dosname(volume->dir.dir_name);

                    dir_e = (dosfs_dir_t*)((void*)(entry->data + DOSFS_BLK_SIZE));

                    do
                    {
                        s = 0;
                        i = ((sequence & 0x1f) - 1) * 13;
                
                        dir->dir_name[0] = sequence;
                        dir->dir_attr = DOSFS_DIR_ATTR_LONG_NAME;
                        dir->dir_nt_reserved = 0x00;
                        dir->dir_crt_time_tenth = chksum;
                        dir->dir_clsno_lo = 0x0000;
                
                        do
                        {
                            offset = dosfs_path_ldir_name_table[s++];
                    
                            if (i < volume->lfn_count)
                            {
                                cc = volume->lfn_name[i];
                        
                                ((uint8_t*)dir)[offset +0] = cc;
                                ((uint8_t*)dir)[offset +1] = cc >> 8;
                            }
                            else
                            {
                                if (i == volume->lfn_count)
                                {
                                    ((uint8_t*)dir)[offset +0] = 0x00;
                                    ((uint8_t*)dir)[offset +1] = 0x00;
                                }
                                else
                                {
                                    ((uint8_t*)dir)[offset +0] = 0xff;
                                    ((uint8_t*)dir)[offset +1] = 0xff;
                                }
                            }

                            i++;
                        }
                        while (s < 13);
                
                        dir++;

                        if (dir == dir_e)
                        {
                            status = dosfs_dir_cache_write(volume);

                            blkno++;

                            if (blkno == blkno_e)
                            {
                                status = dosfs_cluster_read(volume, clsno, &clsno);
                
                                if (status == F_NO_ERROR)
                                {
                                    blkno = DOSFS_CLSNO_TO_BLKNO(clsno);
                                    blkno_e = blkno + volume->cls_blk_size;
                                }
                            }

                            if (status == F_NO_ERROR)
                            {
                                status = dosfs_dir_cache_read(volume, blkno, &entry);

                                if (status == F_NO_ERROR)
                                {
                                    dir = (dosfs_dir_t*)((void*)(entry->data));
                                }
                            }
                        }

                        sequence = (sequence & 0x1f) -1;
                    }
                    while ((status == F_NO_ERROR) && (sequence != 0));
                }

                if (status == F_NO_ERROR)
#endif /* (DOSFS_CONFIG_VFAT_SUPPORTED == 1) */
                {
                    memcpy(dir, &volume->dir, sizeof(dosfs_dir_t));

                    status = dosfs_dir_cache_write(volume);

                    if (status == F_NO_ERROR)
                    {
                        if (volume->dir.dir_attr & DOSFS_DIR_ATTR_DIRECTORY)
                        {
                            if (volume->type == DOSFS_VOLUME_TYPE_FAT32)
                            {
                                clsno_s = ((uint32_t)DOSFS_FTOHS(volume->dir.dir_clsno_hi) << 16) | (uint32_t)DOSFS_FTOHS(volume->dir.dir_clsno_lo);
                            }
                            else
                            {
                                clsno_s = (uint32_t)DOSFS_FTOHS(volume->dir.dir_clsno_lo);
                            }
                            
                            blkno = DOSFS_CLSNO_TO_BLKNO(clsno_s);
                            
                            status = dosfs_dir_cache_read(volume, blkno, &entry);
                                                                    
                            if (status == F_NO_ERROR)
                            {
                                dir = (dosfs_dir_t*)((void*)(entry->data + DOSFS_INDEX_TO_BLKOFS(1)));
                                
                                dir->dir_clsno_lo = volume->dot_clsno;
                                
                                if (volume->type == DOSFS_VOLUME_TYPE_FAT32)
                                {
                                    dir->dir_clsno_hi = volume->dot_clsno >> 16;
                                }
                                
                                status = dosfs_dir_cache_write(volume);
                            }
                        }
                    }

                    if (status == F_NO_ERROR)
                    {
                        volume->dir_flags &= ~DOSFS_DIR_FLAG_CREATE_ENTRY;
                    }
                }
            }
        }
    }

    if (status == F_NO_ERROR)
    {
        if (boot->bpblog.log_lead_sig == DOSFS_HTOFL(DOSFS_LOG_LEAD_SIG))
        {
            boot->bpb.bpb_byts_per_sec &= ~0x8000;

            boot->bpblog.log_lead_sig = DOSFS_HTOFL(0x00000000);
            boot->bpblog.log_struct_sig = DOSFS_HTOFL(0x00000000);

#if (DOSFS_CONFIG_MEDIA_FAILURE_SUPPORTED == 1)
            if (volume->flags & DOSFS_VOLUME_FLAG_MEDIA_FAILURE)
            {
                if (volume->type == DOSFS_VOLUME_TYPE_FAT32)
                {
                    boot->bpb71.bs_nt_reserved |= 0x02;
                }
                else
                {
                    boot->bpb40.bs_nt_reserved |= 0x02;
                }
            }
#endif /* (DOSFS_CONFIG_MEDIA_FAILURE_SUPPORTED == 1) */

#if (DOSFS_CONFIG_VFAT_SUPPORTED == 1) && (DOSFS_CONFIG_UTF8_SUPPORTED == 1)
            /* For VFAT and UTF8 the lfn_name[] needs to patched to contain
             * the bs_trail_sig before writing the boot block, and the unpatched
             * afterwards.
             */
            bs_trail_sig = boot->bpb.bs_trail_sig;

            boot->bpb.bs_trail_sig = DOSFS_HTOFS(0xaa55);
        
            status = dosfs_volume_write(volume, volume->boot_blkno, (uint8_t*)boot);
        
            boot->bpb.bs_trail_sig = bs_trail_sig;

#else /* (DOSFS_CONFIG_VFAT_SUPPORTED == 1) && (DOSFS_CONFIG_UTF8_SUPPORTED == 1) */

            status = dosfs_volume_write(volume, volume->boot_blkno, (uint8_t*)boot);

#endif /* (DOSFS_CONFIG_VFAT_SUPPORTED == 1) && (DOSFS_CONFIG_UTF8_SUPPORTED == 1) */
        }
    }

