GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/dosfs_core.c
    return status;
}

#endif /* (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 0) */


static int dosfs_volume_format(dosfs_volume_t *volume)
{
    int status = F_NO_ERROR;
    dosfs_device_t *device;
    uint32_t clscnt;
    uint32_t boot_blkno, fat1_blkno, fat2_blkno, root_blkno, fat_blkcnt, root_blkcnt, user_blkno, user_blkcnt;
    uint32_t bkboot_blkofs, fsinfo_blkofs;
    dosfs_boot_t *boot;
    dosfs_fsinfo_t *fsinfo;
    void *data;

    device = DOSFS_VOLUME_DEVICE(volume);

    boot = (dosfs_boot_t*)((void*)volume->dir_cache.data);
    volume->dir_cache.blkno = DOSFS_BLKNO_INVALID;

    boot_blkno = volume->boot_blkno;    
    bkboot_blkofs = volume->bkboot_blkofs;
    fsinfo_blkofs = volume->fsinfo_blkofs;
    
    fat_blkcnt = volume->fat_blkcnt;
    fat1_blkno = volume->fat1_blkno;
    fat2_blkno = volume->fat2_blkno;

    clscnt = volume->last_clsno -1;

    if (volume->type != DOSFS_VOLUME_TYPE_FAT32)
    {
        root_blkno = volume->root_blkno;
        root_blkcnt = volume->root_blkcnt;
    }
    else
    {
        root_blkno = ((fat2_blkno == 0) ? (fat1_blkno + fat_blkcnt) : (fat2_blkno + fat_blkcnt));
        root_blkcnt = volume->cls_blk_size;
        
        status = dosfs_volume_read(volume, boot_blkno, (uint8_t*)boot);
        
        if (status == F_NO_ERROR)
        {
            boot->bpb71.bpb_ext_flags = DOSFS_HTOFS(0x0000);
            boot->bpb71.bpb_root_clus = DOSFS_HTOFL(2);
            
            if (bkboot_blkofs)
            {
                status = dosfs_volume_write(volume, boot_blkno + bkboot_blkofs, (uint8_t*)boot);
            }
            
            if (status == F_NO_ERROR)
            {
                status = dosfs_volume_write(volume, boot_blkno, (uint8_t*)boot);
            }
        }
    }

    if (status == F_NO_ERROR)
    {
        /* For FAT32 above root_clsno got forced to be 2, so that fat1/fat2/root are contiguous.
         */
        status = dosfs_volume_zero(volume, fat1_blkno, ((root_blkno - fat1_blkno) + root_blkcnt), true);
        
        if (status == F_NO_ERROR)
        {
            /* Write first FAT1/FAT2 entry */
            
            data = (void*)volume->dir_cache.data;
            memset(data, 0, DOSFS_BLK_SIZE);

#if (DOSFS_CONFIG_FAT12_SUPPORTED == 1)
            if (volume->type == DOSFS_VOLUME_TYPE_FAT12)
            {
                ((uint8_t*)data)[0] = 0xf8;
                ((uint8_t*)data)[1] = 0xff;
                ((uint8_t*)data)[2] = 0xff;
            }
            else
#endif /* (DOSFS_CONFIG_FAT12_SUPPORTED == 1) */
            {
                if (volume->type == DOSFS_VOLUME_TYPE_FAT16)
                {
                    ((uint16_t*)data)[0] = DOSFS_HTOFS(0xfff8);
                    ((uint16_t*)data)[1] = DOSFS_HTOFS(0xffff);
                }
                else
                {
                    ((uint32_t*)data)[0] = DOSFS_HTOFS(0x0ffffff8);
                    ((uint32_t*)data)[1] = DOSFS_HTOFS(0x0fffffff);
                    ((uint32_t*)data)[2] = DOSFS_HTOFS(0x0fffffff);
                }
            }

            status = dosfs_volume_write(volume, fat1_blkno, data);
                
            if (status == F_NO_ERROR)
            {
                if (fat2_blkno)
                {
                    status = dosfs_volume_write(volume, fat2_blkno, data);
                }
            }

            if (fsinfo_blkofs)
            {
                if (status == F_NO_ERROR)
                {
                    fsinfo = (dosfs_fsinfo_t*)((void*)volume->dir_cache.data);
                    memset(fsinfo, 0, DOSFS_BLK_SIZE);

                    fsinfo->fsi_lead_sig   = DOSFS_HTOFL(0x41615252);
                    fsinfo->fsi_struc_sig  = DOSFS_HTOFL(0x61417272);
                    fsinfo->fsi_free_count = DOSFS_HTOFL(clscnt);
                    fsinfo->fsi_nxt_free   = DOSFS_HTOFL(3);
                    fsinfo->fsi_trail_sig  = DOSFS_HTOFL(0xaa550000);
                        
                    status = dosfs_volume_write(volume, boot_blkno + fsinfo_blkofs, (uint8_t*)fsinfo);
                        
                    if (status == F_NO_ERROR)
                    {
                        if (bkboot_blkofs)
                        {
                            status = dosfs_volume_write(volume, boot_blkno + bkboot_blkofs + fsinfo_blkofs, (uint8_t*)fsinfo);
                        }
                    }
                }
            }
        }
    }

    if (status == F_NO_ERROR)
    {
        if (volume->type != DOSFS_VOLUME_TYPE_FAT32)
        {
            user_blkno = (root_blkno + root_blkcnt);
            user_blkcnt = ((volume->last_clsno -1) << volume->cls_blk_shift);
        }
        else
        {
            user_blkno = (root_blkno + root_blkcnt);
            user_blkcnt = ((volume->last_clsno -2) << volume->cls_blk_shift);
        }

        status = (*device->interface->discard)(device->context, user_blkno, user_blkcnt);
    }

    return status;
}


static int dosfs_volume_hardformat(dosfs_volume_t *volume)
{
    int status = F_NO_ERROR;
    dosfs_device_t *device;
    uint8_t media, write_protected;
    unsigned int fattype, sys_id;
    uint32_t blkno, blkcnt, blktotal, blk_unit_size, cls_blk_shift, clscnt, clscnt_e, tot_sec, num_fats;
    uint32_t boot_blkno, fat1_blkno, fat2_blkno, root_blkno, clus_blkno, fat_blkcnt, root_blkcnt, user_blkno, user_blkcnt;
    uint32_t hpc, spt, start_h, start_s, start_c, end_h, end_s, end_c;
    uint32_t au_size, product, serial;
    dosfs_boot_t *boot;
    dosfs_fsinfo_t *fsinfo;
    void *data;
    
    device = DOSFS_VOLUME_DEVICE(volume);

    status = (*device->interface->info)(device->context, &media, &write_protected, &blkcnt, &au_size, &product);

    if (status == F_NO_ERROR)
    {
        if (write_protected)
        {
            status = F_ERR_WRITEPROTECT;
        }
        else
        {
#if (DOSFS_CONFIG_FAT12_SUPPORTED == 0)
            /* SDSC with 64MB or less end up being FAT12. So let's reject them
             * early.
             */
            if (blkcnt <= 131072)
            {
                status = F_ERR_MEDIATOOSMALL;
            }
            else
#endif /* (DOSFS_CONFIG_FAT12_SUPPORTED == 0) */
            {
                /* SDSC/SDHC are limited to 32GB. Above it's a SDXC,
                 * which would exFAT ... but a 128GB SDXC still works
                 * fine with FAT32.
                 */
                if (blkcnt > 268435456)
                {
                    status = F_ERR_MEDIATOOLARGE;
                }
            }
        }

        if (status == F_NO_ERROR)
        {
            armv7m_atomic_or(&device->lock, DOSFS_DEVICE_LOCK_MODIFIED);

	    {
		volatile uint8_t status;
		
