GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/dosfs_core.c
		while (!stm32wb_random((uint8_t*)&serial, sizeof(serial), &status, NULL, NULL)) { }

		while (status == STM32WB_RANDOM_STATUS_BUSY) { }
	    }
	    
            /*
             * There is a upper limit of 4153344 blocks for SDSC cards, and
             * a lower limit of 4211712 for SDHC cards as per SD spec (CSD description).
             *
             * Hower the real lower limit for SHDC is:
             *
             *    16384 + (65525 * 64) = 4209984
             *    4211712 = 8192 + 8192 + (65552 * 64)
             *
             *    (16384 is the required padding upfront for SDHC at this size)
             *
             * The upper legal limit for SDSC is also slightly different from the
             * spec if one thinks about it:
             *
             *    768 + (65524 * 64) = 4194304
             *    4153344 = 768 + (64884 * 64)
             *
             *    (768 is the required padding upfront for SDSC at this size)
             *
             * Thus use those corrected limits to figure out SDSC/SDHC.
             */
    
            if ((media == DOSFS_MEDIA_SFLASH) || (blkcnt < 4209984))
            {
                /* SFLASH, SDSC, FAT12/FAT16 */

                /* Number of Heads and Sectors Per Track ...
                 *
                 * See Microsoft's MBR specs and the term "translation mode".
                 * 
                 * We want to use powers of 2, which means the upper limit for
                 * that representation is 1024 * 128 * 32  = 4194304. That happens
                 * to be also the upper limit for SDSC here. If the size is smaller
                 * than 2 * 16, use "hpc" 2 and "spt" 16, otherwise "spt" is 32, and 
                 * "hpc" is the smallest power of 2.
                 */

                if (blkcnt <= (1024 * 2 * 16))
                {
                    hpc = 2;
                    spt = 16;
                }
                else
                {
                    hpc = 2;
                    spt = 32;
                    
                    while (hpc < 128)
                    {
                        if (blkcnt <= (1024 * hpc * spt))
                        {
                            break;
                        }

                        hpc <<= 1;
                    }
                }

                if (media == DOSFS_MEDIA_SFLASH)
                {
                    /* For SFLASH we follow the default FAT settings with a cluster size
                     * adjusted to fit into FAT12. This means that a 16MB device will need
		     * 64 blocks for PAR/MBR/FAT1/FAT2/DIR.
                     */

                    num_fats = 2;

                    if (blkcnt <= 4906)            /* <= 2MB   -> 512/4k  */
                    {
                        cls_blk_shift = 0;
                    }
                    if (blkcnt <= 8192)            /* <= 4MB   -> 1k/4k   */
                    {
                        cls_blk_shift = 1;
                    }
                    else if (blkcnt <= 16384)      /* <= 8MB   -> 2k/4k   */
                    {
                        cls_blk_shift = 2;
                    }
                    else if (blkcnt <= 32768)      /* <= 16MB  -> 4k/4k   */
		    {
                        cls_blk_shift = 3;
		    }
                    else                           /* <= 32MB  -> 8k/4k   */
                    {
                        cls_blk_shift = 4;
                    }

                    blk_unit_size = 8;
                }
                else
                {
                    /* This table is derived from a ScanDisk SDCARD Product Manual.
                     *
                     * "au_blk_size", is derived by assuming that "Total LBAs" - "User Data Sectors"
                     * needs to be a multiple of a power of 2. It was assumed that the maximum value
                     * would map to the proper "au_blk_size". Next "Total LBAs" - "Total Paration Sectors"
                     * allows to compute the number of blocks per FAT. Assuming that the FAT does not
                     * contain more than one partial populated blocks, this allows to compute the
                     * cluster size picked.
                     * 
                     * The 16MB threshold was derived from a ScanDisk MMC Card Product Manual.
                     * Cards with 4MB and 8MB capacity have an erase size of 8k, hence it's assumed
                     * here that this would map to SDCARDs as well. In reality it probably does not
                     * matter as there are not such cards out there.
                     */

                    num_fats = 2;

#if (DOSFS_CONFIG_FAT12_SUPPORTED == 1)
                    if (blkcnt <= 16384)            /* <= 8MB   -> 8k/8k   */
                    {
                        cls_blk_shift = 4;
                        blk_unit_size = 16;
                    }
                    else if (blkcnt <= 131072)      /* <= 64MB  -> 16k/16k */
                    {
                        cls_blk_shift = 5;
                        blk_unit_size = 32;
                    }
                    else
#endif /* (DOSFS_CONFIG_FAT12_SUPPORTED == 1) */
                    {
                        if (blkcnt <= 524288)       /* <= 256MB -> 16k/32k */
                        {
                            cls_blk_shift = 5;
                            blk_unit_size = 64;
                        }
                        else if (blkcnt <= 2097152) /* <= 1GB   -> 16k/64k */
                        {
                            cls_blk_shift = 5;
                            blk_unit_size = 128;
                        }
                        else                        /* <= 2GB   -> 32k/64k */
                        {
                            cls_blk_shift = 6;
                            blk_unit_size = 128;
                        }
                    }
                }

                /*
                 * FAT12/FAT16 layout requires that the MBR takes up "blk_unit_size" blocks for an SDCARD. There is
                 * also 32 blocks for the root directory. Then there is one boot sector
                 *
                 * To compute fat_blkcnt, first estimate clscnt_e based upon the minimum system area, then compute
                 * the required system area based upon this clscnt_e. With the required system area size recompute clscnt.
                 * If clscnt is less than clscnt_e, use clscnt as clscnt_e and restart the process.
                 *
                 * The will incrementally adjust the clscnt estimate downwards, minimizing the required system area.
                 */

