GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/dosfs_core.c
                root_blkcnt = 32;

                if (media == DOSFS_MEDIA_SFLASH)
                {
                    clscnt = ((blkcnt - blk_unit_size) & ~(blk_unit_size -1)) >> cls_blk_shift;
                }
                else
                {
                    clscnt = ((blkcnt - 2 * blk_unit_size) & ~(blk_unit_size -1)) >> cls_blk_shift;
                }

#if (DOSFS_CONFIG_FAT12_SUPPORTED == 1)
                if (clscnt < 4085)
                {
                    fattype = DOSFS_VOLUME_TYPE_FAT12;
                }
                else
#endif /* (DOSFS_CONFIG_FAT12_SUPPORTED == 1) */
                {
                    fattype = DOSFS_VOLUME_TYPE_FAT16;

                    if (clscnt > 65524)
                    {
                        clscnt = 65524;
                    }
                }


                do 
                {
                    clscnt_e = clscnt;
                            
#if (DOSFS_CONFIG_FAT12_SUPPORTED == 1)
                    if (fattype == DOSFS_VOLUME_TYPE_FAT12)
                    {
                        fat_blkcnt = (((((clscnt + 2) * 3) + 1) / 2) + (DOSFS_BLK_SIZE -1)) >> DOSFS_BLK_SHIFT;
                    }
                    else
#endif /* (DOSFS_CONFIG_FAT12_SUPPORTED == 1) */
                    {
                        fat_blkcnt = ((clscnt + 2) * 2 + (DOSFS_BLK_SIZE -1)) >> DOSFS_BLK_SHIFT;
                    }
                    
                    if (media == DOSFS_MEDIA_SFLASH)
                    {
                        /* ### For a TRANSACTION SAFE, FAT12/FAT16 needs on extra block, so there need to be 3 extra blocks in total.
                         */
                        clus_blkno = ((2 + num_fats * fat_blkcnt + root_blkcnt + (blk_unit_size -1)) & ~(blk_unit_size -1));
                    }
                    else
                    {
                        clus_blkno = blk_unit_size + ((1 + num_fats * fat_blkcnt + root_blkcnt + (blk_unit_size -1)) & ~(blk_unit_size -1));
                    }
                                
                    clscnt = ((blkcnt - clus_blkno) & ~(blk_unit_size -1)) >> cls_blk_shift;

                    if (clscnt > clscnt_e)
                    {
                        clscnt = clscnt_e;
                    }
                }
                while (clscnt != clscnt_e);

                root_blkno = (clus_blkno - 32);

                if (num_fats == 1)
                {
                    fat2_blkno = 0;
                    fat1_blkno = root_blkno - fat_blkcnt;
                }
                else
                {
                    fat2_blkno = root_blkno - fat_blkcnt;
                    fat1_blkno = fat2_blkno - fat_blkcnt;
                }

                if (media == DOSFS_MEDIA_SFLASH)
                {
                    boot_blkno = 1;
                }
                else
                {
                    boot_blkno = fat1_blkno - 1;
                }
            }
            else
            {
                /* SDHC, FAT32 */

                /* Number of Heads and Sectors Per Track ...
                 *
                 * See Microsoft's MBR specs and the term "translation mode".
                 */

                if (blkcnt <= 8388608)
                {
                    hpc = 128;
                    spt = 63;
                }
                else
                {
                    hpc = 255;
                    spt = 63;
                }

                num_fats = 2;

                if (blkcnt <= 67108864) /* <= 32GB  -> 4MB  */
                {
                    cls_blk_shift = 6;
                    blk_unit_size = 8192;
                            
                    if (blkcnt <= 33554432)
                    {
                        /* For a 16GB SDHC one has to make sure that the FAT1/FAT2 do not
                         * overflow the 1 allocation unit that is available for the 
                         * "System Area".
                         *
                         * (8192 - 9) / 2     = 4091     blocks are available per FAT
                         * (4091 * 128) - 2   = 523646   data clusters
                         * 523646 * 64        = 33513344 data blocks
                         * 33513344 + 8192    = 33521536 total blocks
                         * 33521536 & ~8191   = 33513472 usable blocks
                         */
                                
                        if (blkcnt > 33513472)
                        {
                            blkcnt = 33513472;
                        }

                        clus_blkno = 16384;
                    }
                    else
                    {
                        /* For a 32GB SDHC one has to make sure that the FAT1/FAT2 do not
                         * overflow the a 2 allocation units that are available for the 
                         * "System Area".
                         *
                         * (16384 - 9) / 2    = 8187     blocks are available per FAT
                         * (8187 * 128) - 2   = 1047934  data clusters
                         * 1047934 * 64       = 67067776 data blocks
                         * 67067776 + 8192    = 67075968 total blocks
                         * 67075968 & ~8191   = 67067904 usable blocks
                         */
                                
                        if (blkcnt > 67067904)
                        {
                            blkcnt = 67067904;
                        }

                        clus_blkno = 24576;
                    }
                }
                else                   /* <= 128GB -> 16MB */
                {
                    /* The guess "blk_unit_size" for a 64GB card has been confirmed
                     * by looking at various available SDXC cards which all were formatted
                     * the same way.
                     */

                    cls_blk_shift = 7;
                    blk_unit_size = 32768;

                    /* For a 128GB SDXC one has to make sure that the FAT1/FAT2 do not
                     * overflow the single allocation unit that is available for the 
                     * "System Area".
                     *
                     * (32768 - 9) / 2    = 16379     blocks are available per FAT
                     * (16379 * 128) - 2  = 2096510   data clusters
                     * 2096510 * 128      = 268353280 data blocks
                     * 268353280 + 65536  = 268418816 total blocks
                     * 268418816 & ~32767 = 268402688 usable blocks
                     */

