GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/dosfs_core.c
                    if (blkcnt > 268402688)
                    {
                        blkcnt = 268402688;
                    }

                    clus_blkno = 65536;
                }

                /* FAT32 is layed out different than FAT12/FAT16. There is no root_blkno, and we know
                 * that there are at least 65525 clusters. Also there are at least 9 reserved blocks
                 * minimum.
                 */

                root_blkcnt = (1 << cls_blk_shift);

                fattype = DOSFS_VOLUME_TYPE_FAT32;

                clscnt = ((blkcnt - clus_blkno) & ~(blk_unit_size -1)) >> cls_blk_shift;
                fat_blkcnt = ((clscnt + 2) * 4 + (DOSFS_BLK_SIZE -1)) >> DOSFS_BLK_SHIFT;

                root_blkno = clus_blkno;
                fat2_blkno = clus_blkno - fat_blkcnt;
                fat1_blkno = fat2_blkno - fat_blkcnt;
                boot_blkno = blk_unit_size;
            }

            if (status == F_NO_ERROR)
            {
                blkcnt = clus_blkno + (clscnt << cls_blk_shift);

                tot_sec = (blkcnt - boot_blkno);

                if (fattype != DOSFS_VOLUME_TYPE_FAT32)
                {
                    if (tot_sec < 32680)
                    {
                        sys_id = 0x01;
                    }
                    else if (tot_sec < 65536)
                    {
                        sys_id = 0x04;
                    }
                    else
                    {
                        sys_id = 0x06;
                    }
                }
                else
                {
                    /* Select sys_id to get either CHS/LBA or LBA.
                     */
                    if (blkcnt <= 16450560)
                    {
                        sys_id = 0x0b;
                    }
                    else
                    {
                        sys_id = 0x0c;
                    }
                }

                /* CHS has max legal values (0..1023) * (0..254) * (1..63). If the LBA is outside
                 * this CHS range, then use the maximum value. This can only happen with FAT32,
                 * in which case the partition type signals to use LBA anyway.
                 */

                start_c = boot_blkno / (hpc * spt);
                start_h = (boot_blkno - (start_c * hpc * spt)) / spt;
                start_s = boot_blkno - (start_c * hpc * spt) - (start_h * spt) + 1;
                        
                if (blkcnt <= 16450560)
                {
                    end_c = (blkcnt-1) / (hpc * spt);
                    end_h = ((blkcnt-1) - (end_c * hpc * spt)) / spt;
                    end_s = (blkcnt-1) - (end_c * hpc * spt) - (end_h * spt) + 1;
                }
                else
                {
                    end_c   = 1023;
                    end_h   = 254;
                    end_s   = 63;
                }

                /* Write the MBR */

                boot = (dosfs_boot_t*)volume->dir_cache.data;
		volume->dir_cache.blkno = DOSFS_BLKNO_INVALID;

                memset(boot, 0, DOSFS_BLK_SIZE);

                boot->mbr.mbr_par_table[0].mbr_boot_ind     = 0x00;
                boot->mbr.mbr_par_table[0].mbr_start_chs[0] = start_h;
                boot->mbr.mbr_par_table[0].mbr_start_chs[1] = ((start_c << 6) | start_s);
                boot->mbr.mbr_par_table[0].mbr_start_chs[2] = (start_c >> 2);
                boot->mbr.mbr_par_table[0].mbr_sys_id       = sys_id;
                boot->mbr.mbr_par_table[0].mbr_end_chs[0]   = end_h; 
                boot->mbr.mbr_par_table[0].mbr_end_chs[1]   = ((end_c << 6) | end_s);
                boot->mbr.mbr_par_table[0].mbr_end_chs[2]   = (end_c >> 2);
                boot->mbr.mbr_par_table[0].mbr_rel_sec      = DOSFS_HTOFL(boot_blkno);
                boot->mbr.mbr_par_table[0].mbr_tot_sec      = DOSFS_HTOFL(tot_sec);
                boot->bs.bs_trail_sig                       = DOSFS_HTOFS(0xaa55);

                status = (*device->interface->write)(device->context, 0, (uint8_t*)boot, 1, 0, true);

                if (status == F_NO_ERROR)
                {
                    /* Write the PBR */
                
                    memset(boot, 0, DOSFS_BLK_SIZE);

                    boot->bpb.bs_jmp_boot[0]   = 0xeb;
                    boot->bpb.bs_jmp_boot[1]   = 0x00;
                    boot->bpb.bs_jmp_boot[2]   = 0x90;
                    boot->bpb.bs_oem_name[0]   = 'M';
                    boot->bpb.bs_oem_name[1]   = 'S';
                    boot->bpb.bs_oem_name[2]   = 'D';
                    boot->bpb.bs_oem_name[3]   = 'O';
                    boot->bpb.bs_oem_name[4]   = 'S';
                    boot->bpb.bs_oem_name[5]   = '5';
                    boot->bpb.bs_oem_name[6]   = '.';
                    boot->bpb.bs_oem_name[7]   = '0';
                    boot->bpb.bpb_byts_per_sec = DOSFS_HTOFS(DOSFS_BLK_SIZE);
                    boot->bpb.bpb_sec_per_clus = (1 << cls_blk_shift);
                    boot->bpb.bpb_rsvd_sec_cnt = DOSFS_HTOFS(fat1_blkno - boot_blkno);
                    boot->bpb.bpb_num_fats     = num_fats;
                    boot->bpb.bpb_media        = 0xf8;
                    boot->bpb.bpb_sec_per_trk  = spt;
                    boot->bpb.bpb_num_heads    = hpc;
                    boot->bs.bs_trail_sig      = DOSFS_HTOFS(0xaa55);

                    if (fattype != DOSFS_VOLUME_TYPE_FAT32)
                    {
                        boot->bpb.bpb_root_ent_cnt   = DOSFS_HTOFS(512);
                        boot->bpb.bpb_tot_sec_16     = DOSFS_HTOFS((tot_sec >= 65536) ? 0 : tot_sec);
                        boot->bpb.bpb_fat_sz_16      = DOSFS_HTOFS(fat_blkcnt);
                        boot->bpb40.bpb_hidd_sec_32  = DOSFS_HTOFL(boot_blkno);
                        boot->bpb40.bpb_tot_sec_32   = DOSFS_HTOFS((tot_sec >= 65536) ? tot_sec : 0);
                        boot->bpb40.bs_drv_num       = 0x80;
                        boot->bpb40.bs_nt_reserved   = 0x00;
                        boot->bpb40.bs_boot_sig      = 0x29;
                        boot->bpb40.bs_vol_id        = DOSFS_HTOFL(serial);

                        memcpy(boot->bpb40.bs_vol_lab, "NO NAME    ", sizeof(boot->bpb40.bs_vol_lab));

#if (DOSFS_CONFIG_FAT12_SUPPORTED == 1)
                        if (fattype == DOSFS_VOLUME_TYPE_FAT12)
                        {
                            memcpy(boot->bpb40.bs_fil_sys_type, "FAT12   ", sizeof(boot->bpb40.bs_fil_sys_type));
                        }
                        else
#endif /* (DOSFS_CONFIG_FAT12_SUPPORTED == 1) */
                        {
                            memcpy(boot->bpb40.bs_fil_sys_type, "FAT16   ", sizeof(boot->bpb40.bs_fil_sys_type));
                        }

