GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/dosfs_core.c
                        status = (*device->interface->write)(device->context, boot_blkno, (uint8_t*)boot, 1, 0, true);
                    }
                    else
                    {
                        boot->bpb.bpb_root_ent_cnt   = DOSFS_HTOFS(0);
                        boot->bpb.bpb_tot_sec_16     = DOSFS_HTOFS(0);
                        boot->bpb.bpb_fat_sz_16      = DOSFS_HTOFS(0);
                        boot->bpb71.bpb_hidd_sec_32  = DOSFS_HTOFL(boot_blkno);
                        boot->bpb71.bpb_tot_sec_32   = DOSFS_HTOFL(tot_sec);
                        boot->bpb71.bpb_fat_sz_32    = DOSFS_HTOFL(fat_blkcnt);
                        boot->bpb71.bpb_ext_flags    = DOSFS_HTOFS(0x0000);
                        boot->bpb71.bpb_fs_ver       = DOSFS_HTOFS(0x0000);
                        boot->bpb71.bpb_root_clus    = DOSFS_HTOFL(2);
                        boot->bpb71.bpb_fsinfo       = DOSFS_HTOFS(1);
                        boot->bpb71.bpb_bkboot       = DOSFS_HTOFS(6);
                        boot->bpb71.bs_drv_num       = 0x80;
                        boot->bpb71.bs_nt_reserved   = 0x00;
                        boot->bpb71.bs_boot_sig      = 0x29;
                        boot->bpb71.bs_vol_id        = DOSFS_HTOFL(serial);

                        memcpy(boot->bpb71.bs_vol_lab, "NO NAME    ", sizeof(boot->bpb71.bs_vol_lab));
                        memcpy(boot->bpb71.bs_fil_sys_type, "FAT32   ", sizeof(boot->bpb71.bs_fil_sys_type));

                        status = (*device->interface->write)(device->context, boot_blkno, (uint8_t*)boot, 1, 0, true);

                        if (status == F_NO_ERROR)
                        {
                            status = (*device->interface->write)(device->context, boot_blkno +6, (uint8_t*)boot, 1, 0, true);

                            if (status == F_NO_ERROR)
                            {
                                fsinfo = (dosfs_fsinfo_t*)volume->dir_cache.data;
				volume->dir_cache.blkno = DOSFS_BLKNO_INVALID;

                                memset(fsinfo, 0, DOSFS_BLK_SIZE);

                                fsinfo->fsi_lead_sig   = DOSFS_HTOFL(0x41615252);
                                fsinfo->fsi_struc_sig  = DOSFS_HTOFL(0x61417272);
                                fsinfo->fsi_free_count = DOSFS_HTOFL(clscnt);
                                fsinfo->fsi_nxt_free   = DOSFS_HTOFL(3);
                                fsinfo->fsi_trail_sig  = DOSFS_HTOFL(0xaa550000);
                                        
                                status = (*device->interface->write)(device->context, boot_blkno +1, (uint8_t*)fsinfo, 1, 0, true);
                                        
                                if (status == F_NO_ERROR)
                                {
                                    status = (*device->interface->write)(device->context, boot_blkno +7, (uint8_t*)fsinfo, 1, 0, true);

                                    if (status == F_NO_ERROR)
                                    {
                                        memset(boot, 0, DOSFS_BLK_SIZE);
                                    
                                        boot->bs.bs_trail_sig = DOSFS_HTOFS(0xaa55);
                                                
                                        status = (*device->interface->write)(device->context, boot_blkno +2, (uint8_t*)boot, 1, 0, true);
                                    
                                        if (status == F_NO_ERROR)
                                        {
                                            status = (*device->interface->write)(device->context, boot_blkno +8, (uint8_t*)boot, 1, 0, true);
                                        }
                                    }
                                }
                            }
                        }
                    }

                    if (status == F_NO_ERROR)
                    {
                        /* For FAT32 above root_clsno got forced to be 2, so that fat1/fat2/root are contiguous.
                         */

			data = (void*)volume->dir_cache.data;
			volume->dir_cache.blkno = DOSFS_BLKNO_INVALID;

                        memset(data, 0, DOSFS_BLK_SIZE);
                        
                        blkno = fat1_blkno;
                        blkcnt = (root_blkno - fat1_blkno) + root_blkcnt;
                        blktotal = (blkcnt == 1) ? 0 : blkcnt;
			
                        do
                        {
                            status = (*device->interface->write)(device->context, blkno, data, 1, blktotal, (blkcnt == 1) ? true : false);
                            
                            blkno++;
                            blkcnt--;
			    blktotal = 0;
                        }
                        while ((status == F_NO_ERROR) && blkcnt);
                        
                        if (status == F_NO_ERROR)
                        {
                            /* Write first FAT1/FAT2 entry */

#if (DOSFS_CONFIG_FAT12_SUPPORTED == 1)
                            if (fattype == DOSFS_VOLUME_TYPE_FAT12)
                            {
                                ((uint8_t*)data)[0] = 0xf8;
                                ((uint8_t*)data)[1] = 0xff;
                                ((uint8_t*)data)[2] = 0xff;
                            }
                            else
#endif /* (DOSFS_CONFIG_FAT12_SUPPORTED == 1) */
                            {
                                if (fattype == DOSFS_VOLUME_TYPE_FAT16)
                                {
                                    ((uint16_t*)data)[0] = DOSFS_HTOFS(0xfff8);
                                    ((uint16_t*)data)[1] = DOSFS_HTOFS(0xffff);
                                }
                                else
                                {
                                    ((uint32_t*)data)[0] = DOSFS_HTOFS(0x0ffffff8);
                                    ((uint32_t*)data)[1] = DOSFS_HTOFS(0x0fffffff);
                                    ((uint32_t*)data)[2] = DOSFS_HTOFS(0x0fffffff);
                                }
                            }
                                
                            status = (*device->interface->write)(device->context, fat1_blkno, data, 1, 0, true);
                
                            if (status == F_NO_ERROR)
                            {
                                if (fat2_blkno)
                                {
                                    status = (*device->interface->write)(device->context, fat2_blkno, data, 1, 0, true);
                                }
                            }
                        }

                        if (status == F_NO_ERROR)
                        {
                            if (fattype != DOSFS_VOLUME_TYPE_FAT32)
                            {
                                user_blkno = (root_blkno + root_blkcnt);
                                user_blkcnt = (clscnt << cls_blk_shift);
                            }
                            else
                            {
                                user_blkno = (root_blkno + root_blkcnt);
                                user_blkcnt = ((clscnt -1) << cls_blk_shift);
                            }

