GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/dosfs_core.c
                            status = (*device->interface->discard)(device->context, user_blkno, user_blkcnt);
                        }
                    }
                }
            }
        }
    }

    return status;
}

/***********************************************************************************************************************/

static int dosfs_dir_cache_write(dosfs_volume_t *volume)
{
    int status = F_NO_ERROR;
    dosfs_device_t *device;

    device = DOSFS_VOLUME_DEVICE(volume);

#if (DOSFS_CONFIG_DATA_CACHE_ENTRIES == 0)
    if (volume->data_file)
    {
        dosfs_file_t *file = volume->data_file;
        
        status = (*device->interface->write)(device->context, volume->dir_cache.blkno, volume->dir_cache.data, 1, 0, !!(file->mode & DOSFS_FILE_MODE_RANDOM));

#if (DOSFS_CONFIG_MEDIA_FAILURE_SUPPORTED == 1)
        if (status == F_ERR_INVALIDSECTOR)
        {
            volume->flags |= DOSFS_VOLUME_FLAG_MEDIA_FAILURE;
        }
#endif /* (DOSFS_CONFIG_MEDIA_FAILURE_SUPPORTED == 1) */

        if (status == F_NO_ERROR)
        {
            DOSFS_VOLUME_STATISTICS_COUNT(data_cache_write);

            armv7m_atomic_or(&device->lock, DOSFS_DEVICE_LOCK_MODIFIED);
        }

        /* Unconditionally clean the dirty condition, or
         * otherwise the while system would get stuck.
         */
        volume->data_file = NULL;
    }
    else
#endif /* (DOSFS_CONFIG_DATA_CACHE_ENTRIES == 0) */
    {
#if (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 1) && (DOSFS_CONFIG_FAT_CACHE_ENTRIES == 0)
        if (volume->flags & DOSFS_VOLUME_FLAG_FAT_DIRTY)
        {
            status = dosfs_map_cache_write(volume, volume->dir_cache.blkno, volume->dir_cache.data);

            if (status == F_NO_ERROR)
            {
                DOSFS_VOLUME_STATISTICS_COUNT(fat_cache_write);

                volume->flags &= ~DOSFS_VOLUME_FLAG_FAT_DIRTY;
            }
        }
        else
        {
            status = dosfs_volume_write(volume, volume->dir_cache.blkno, volume->dir_cache.data);

            if (status == F_NO_ERROR)
            {
                DOSFS_VOLUME_STATISTICS_COUNT(dir_cache_write);
            }
        }
#else /* (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 1) && (DOSFS_CONFIG_FAT_CACHE_ENTRIES == 0) */
        status = dosfs_volume_write(volume, volume->dir_cache.blkno, volume->dir_cache.data);
        
        if (status == F_NO_ERROR)
        {
#if (DOSFS_CONFIG_FAT_CACHE_ENTRIES == 0)
            if (volume->flags & DOSFS_VOLUME_FLAG_FAT_DIRTY)
            {
                DOSFS_VOLUME_STATISTICS_COUNT(fat_cache_write);
                
#if (DOSFS_CONFIG_2NDFAT_SUPPORTED == 1)
                if (volume->fat2_blkno)
                {
                    status = dosfs_volume_write(volume, volume->dir_cache.blkno + volume->fat_blkcnt, volume->dir_cache.data);
                }
                
                if (status == F_NO_ERROR)
#endif /* (DOSFS_CONFIG_2NDFAT_SUPPORTED == 1) */
                {
                    volume->flags &= ~DOSFS_VOLUME_FLAG_FAT_DIRTY;
                }
            }
            else
#endif /* (DOSFS_CONFIG_FAT_CACHE_ENTRIES == 0) */
            {
                DOSFS_VOLUME_STATISTICS_COUNT(dir_cache_write);
            }
        }
#endif /* (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 1) && (DOSFS_CONFIG_FAT_CACHE_ENTRIES == 0) */
    }

    return status;
}

static int dosfs_dir_cache_fill(dosfs_volume_t *volume, uint32_t blkno, int zero)
{
    int status = F_NO_ERROR;

#if (DOSFS_CONFIG_FAT_CACHE_ENTRIES == 0) || (DOSFS_CONFIG_DATA_CACHE_ENTRIES == 0)
    if (0
#if (DOSFS_CONFIG_FAT_CACHE_ENTRIES == 0)
        || (volume->flags & DOSFS_VOLUME_FLAG_FAT_DIRTY)
#endif /* (DOSFS_CONFIG_FAT_CACHE_ENTRIES == 0) */
#if (DOSFS_CONFIG_DATA_CACHE_ENTRIES == 0)
        || volume->data_file
#endif /* (DOSFS_CONFIG_DATA_CACHE_ENTRIES == 0) */
        )
    {
        status = dosfs_dir_cache_write(volume);
    }

    if (status == F_NO_ERROR)
#endif /* (DOSFS_CONFIG_FAT_CACHE_ENTRIES == 0) || (DOSFS_CONFIG_DATA_CACHE_ENTRIES == 0) */
    {
        if (zero)
        {
            memset(volume->dir_cache.data, 0, DOSFS_BLK_SIZE);

            volume->dir_cache.blkno = blkno;
        }
        else
        {
            status = dosfs_volume_read(volume, blkno, volume->dir_cache.data);
            
            if (status == F_NO_ERROR)
            {
                volume->dir_cache.blkno = blkno;
            }
        }
    }

    return status;
}

static int dosfs_dir_cache_read(dosfs_volume_t *volume, uint32_t blkno, dosfs_cache_entry_t **p_entry)
{
    int status = F_NO_ERROR;

    if (volume->dir_cache.blkno != blkno)
    {
        DOSFS_VOLUME_STATISTICS_COUNT(dir_cache_miss);
        DOSFS_VOLUME_STATISTICS_COUNT(dir_cache_read);

        status = dosfs_dir_cache_fill(volume, blkno, FALSE);
    }
    else
    {
        DOSFS_VOLUME_STATISTICS_COUNT(dir_cache_hit);
    }

    *p_entry = &volume->dir_cache;

    return status;
}

static int dosfs_dir_cache_zero(dosfs_volume_t *volume, uint32_t blkno, dosfs_cache_entry_t **p_entry)
{
    int status = F_NO_ERROR;

    if (volume->dir_cache.blkno != blkno)
    {
        DOSFS_VOLUME_STATISTICS_COUNT(dir_cache_miss);
        DOSFS_VOLUME_STATISTICS_COUNT(dir_cache_zero);

        status = dosfs_dir_cache_fill(volume, blkno, TRUE);
    }
    else
    {
        DOSFS_VOLUME_STATISTICS_COUNT(dir_cache_hit);
    }

    *p_entry = &volume->dir_cache;

    return status;
}

static int dosfs_dir_cache_flush(dosfs_volume_t *volume)
{
    int status = F_NO_ERROR;

#if (DOSFS_CONFIG_FAT_CACHE_ENTRIES == 0) || (DOSFS_CONFIG_DATA_CACHE_ENTRIES == 0)
    if (0
#if (DOSFS_CONFIG_FAT_CACHE_ENTRIES == 0)
        || (volume->flags & DOSFS_VOLUME_FLAG_FAT_DIRTY)
#endif /* (DOSFS_CONFIG_FAT_CACHE_ENTRIES == 0) */
#if (DOSFS_CONFIG_DATA_CACHE_ENTRIES == 0)
        || volume->data_file
#endif /* (DOSFS_CONFIG_DATA_CACHE_ENTRIES == 0) */
        )
    {
#if (DOSFS_CONFIG_DATA_CACHE_ENTRIES == 0)
        if (volume->data_file)
        {
            DOSFS_VOLUME_STATISTICS_COUNT(data_cache_flush);
        }
#endif /* (DOSFS_CONFIG_DATA_CACHE_ENTRIES == 0) */

#if (DOSFS_CONFIG_FAT_CACHE_ENTRIES == 0)
        if (volume->flags & DOSFS_VOLUME_FLAG_FAT_DIRTY)
        {
            DOSFS_VOLUME_STATISTICS_COUNT(fat_cache_flush);
        }
#endif /* (DOSFS_CONFIG_FAT_CACHE_ENTRIES == 0) */

        status = dosfs_dir_cache_write(volume);
    }
#endif /* (DOSFS_CONFIG_FAT_CACHE_ENTRIES == 0) || (DOSFS_CONFIG_DATA_CACHE_ENTRIES == 0) */

