GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/dosfs_core.c
    return status;
}

/***********************************************************************************************************************/

#if (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 1)

static int dosfs_map_cache_fill(dosfs_volume_t *volume, uint32_t page)
{
    int status = F_NO_ERROR;

    if (volume->map_flags & DOSFS_MAP_FLAG_MAP_DIRTY)
    {
        status = dosfs_volume_write(volume, volume->map_cache.blkno, volume->map_cache.data);
    }
            
    if (status == F_NO_ERROR)
    {
        if (!(volume->map_flags & (DOSFS_MAP_FLAG_MAP_0_CHANGED << page)))
        {
            memset(volume->map_cache.data, 0, DOSFS_BLK_SIZE);
            
            volume->map_cache.blkno = volume->map_blkno + page;
        }
        else
        {
            status = dosfs_volume_read(volume, (volume->map_blkno + page), volume->map_cache.data);

            if (status == F_NO_ERROR)
            {
                volume->map_cache.blkno = volume->map_blkno + page;
            }
        }
    }

    return status;
}

static int dosfs_map_cache_write(dosfs_volume_t *volume, uint32_t blkno, const uint8_t *data)
{
    int status = F_NO_ERROR;
    uint32_t page, index, mask, offset;
    uint32_t *map;

    page   = (blkno - volume->fat1_blkno) >> (DOSFS_BLK_SHIFT + 8);
    index  = ((blkno - volume->fat1_blkno) >> 5) & DOSFS_BLK_MASK;
    mask   = 1ul << ((blkno - volume->fat1_blkno) & 31);
    offset = volume->fat_blkcnt;

    if (volume->map_cache.blkno != (volume->map_blkno + page))
    {
        status = dosfs_map_cache_fill(volume, page);
    }

    if (status == F_NO_ERROR)
    {
        map = (uint32_t*)((void*)volume->map_cache.data);
        
        if (!(map[index] & mask))
        {
            map[index] |= mask;
            
            volume->map_flags |= (DOSFS_MAP_FLAG_MAP_DIRTY | (DOSFS_MAP_FLAG_MAP_0_CHANGED << page));
            
            if (volume->map_entries >= DOSFS_MAP_TABLE_ENTRIES)
            {
                volume->map_entries = DOSFS_MAP_TABLE_OVERFLOW;
            }
            else
            {
                volume->map_table[volume->map_entries++] = (blkno - volume->fat1_blkno);
            }
        }

        status = dosfs_volume_write(volume, (blkno + offset), data);
    }

    return status;
}

static int dosfs_map_cache_read(dosfs_volume_t *volume, uint32_t blkno, uint8_t *data)
{
    int status = F_NO_ERROR;
    uint32_t page, index, mask, offset;
    uint32_t *map;

    page   = (blkno - volume->fat1_blkno) >> (DOSFS_BLK_SHIFT + 8);
    index  = ((blkno - volume->fat1_blkno) >> 5) & DOSFS_BLK_MASK;
    mask   = 1ul << ((blkno - volume->fat1_blkno) & 31);
    offset = 0;

    if (volume->map_cache.blkno != (volume->map_blkno + page))
    {
        status = dosfs_map_cache_fill(volume, page);
    }

    if (status == F_NO_ERROR)
    {
        map = (uint32_t*)((void*)volume->map_cache.data);
        
        if (map[index] & mask)
        {
            offset = volume->fat_blkcnt;
        }

        status = dosfs_volume_read(volume, (blkno + offset), data);
    }

    return status;
}

static int dosfs_map_cache_flush(dosfs_volume_t *volume)
{
    int status = F_NO_ERROR;

    status = dosfs_fat_cache_flush(volume);

    if (status == F_NO_ERROR)
    {
        if (volume->map_entries == DOSFS_MAP_TABLE_OVERFLOW)
        {
            if (volume->map_flags & DOSFS_MAP_FLAG_MAP_DIRTY)
            {
                if (volume->type != DOSFS_VOLUME_TYPE_FAT32)
                {
                    /* For FAT12/FAT16 the map is stored in volume->map_table[]. There
                     * can be at most 256 FAT blocks for FAT32, which means 256 bits,
                     * which is 64 bytes. Hence it fits into volume->map_table[].
                     */
                    memcpy(volume->map_table, volume->map_cache.data, 64);
                }
                else
                {
                    status = dosfs_volume_write(volume, volume->map_cache.blkno, volume->map_cache.data);
                }
            }
        }

        if (status == F_NO_ERROR)
        {
            volume->map_flags &= ~DOSFS_MAP_FLAG_MAP_DIRTY;

#if (DOSFS_CONFIG_FSINFO_SUPPORTED == 1)
            if ((volume->map_flags & DOSFS_MAP_FLAG_MAP_CHANGED) &&
                (volume->fsinfo_blkofs != 0) &&
                (volume->flags & DOSFS_VOLUME_FLAG_FSINFO_VALID) &&
                (volume->flags & DOSFS_VOLUME_FLAG_FSINFO_DIRTY))
            {
                volume->map_flags |= DOSFS_MAP_FLAG_MAP_FSINFO;
            }
#endif /* (DOSFS_CONFIG_FSINFO_SUPPORTED == 1) */
        }
    }

    return status;
}

static int dosfs_map_cache_resolve(dosfs_volume_t *volume)
{
    int status = F_NO_ERROR;
    uint16_t *map_table, *map_table_e;
    uint32_t blkno, blkno_n, mask, page;
    uint32_t *map, *map_e;
    uint8_t *data;
    dosfs_cache_entry_t *entry;

    status = dosfs_dir_cache_flush(volume);

    if (status == F_NO_ERROR)
    {
        if (volume->map_entries != DOSFS_MAP_TABLE_OVERFLOW)
        {
            map_table = &volume->map_table[0];
            map_table_e = &volume->map_table[volume->map_entries];

            do
            {
                blkno = volume->fat1_blkno + *map_table++;

#if (DOSFS_CONFIG_FAT_CACHE_ENTRIES == 0)
                if (blkno == volume->dir_cache.blkno)
                {
                    data = volume->dir_cache.data;
                }
#else /* (DOSFS_CONFIG_FAT_CACHE_ENTRIES == 0) */
#if (DOSFS_CONFIG_FAT_CACHE_ENTRIES == 1)
                if (blkno == volume->fat_cache.blkno)
                {
                    data = volume->fat_cache.data;
                }
#else /* (DOSFS_CONFIG_FAT_CACHE_ENTRIES == 1) */
                if (blkno == volume->fat_cache[0].blkno)
                {
                    data = volume->fat_cache[0].data;
                }
                else if (blkno == volume->fat_cache[1].blkno)
                {
                    data = volume->fat_cache[1].data;
                }
#endif /* (DOSFS_CONFIG_FAT_CACHE_ENTRIES == 1) */
#endif /* (DOSFS_CONFIG_FAT_CACHE_ENTRIES == 0) */
                else
                {
                    status = dosfs_dir_cache_read(volume, blkno + volume->fat_blkcnt, &entry);

                    if (status == F_NO_ERROR)
                    {
                        entry->blkno = blkno;

                        data = entry->data;
                    }
                }

                if (status == F_NO_ERROR)
                {
                    status = dosfs_volume_write(volume, blkno, data);
                }
            }
            while ((status == F_NO_ERROR) && (map_table < map_table_e));
        }
        else
        {
            do
            {
                blkno = volume->fat1_blkno;

                if (volume->type != DOSFS_VOLUME_TYPE_FAT32)
                {
                    /* For FAT12/FAT16 the map is stored in volume->map_table[]. There
                     * can be at most 256 FAT blocks for FAT32, which means 256 bits,
                     * which is 64 bytes. Hence it fits into volume->map_table[].
                     */
                    page = 0;

