GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/dosfs_core.c
                    map = (uint32_t*)((void*)volume->map_table);
                    map_e = (uint32_t*)((void*)((uint8_t*)volume->map_table + 64));
                }
                else
                {
                    if (volume->map_flags & (DOSFS_MAP_FLAG_MAP_0_CHANGED << (volume->map_cache.blkno - volume->map_blkno)))
                    {
                        page = (volume->map_cache.blkno - volume->map_blkno);
                    }
                    else
                    {
                        if (volume->map_flags & DOSFS_MAP_FLAG_MAP_0_CHANGED)
                        {
                            page = 0;
                        }
                        else
                        {
                            page = 1;
                        }

                        if (volume->map_cache.blkno != (volume->map_blkno + page))
                        {
                            status = dosfs_map_cache_fill(volume, page);
                        }
                    }

                    if (page == 1)
                    {
                        blkno += (DOSFS_BLK_SIZE * 8);
                    }
                    
                    map = (uint32_t*)((void*)volume->map_cache.data);
                    map_e = (uint32_t*)((void*)(volume->map_cache.data + DOSFS_BLK_SIZE));
                }

                while ((status == F_NO_ERROR) && (map < map_e))
                {
                    mask = *map++;

                    blkno_n  = blkno + 32;
                    
                    while (mask)
                    {
                        if (mask & 1)
                        {
#if (DOSFS_CONFIG_FAT_CACHE_ENTRIES == 0)
                            if (blkno == volume->dir_cache.blkno)
                            {
                                data = volume->dir_cache.data;
                            }
#else /* (DOSFS_CONFIG_FAT_CACHE_ENTRIES == 0) */
#if (DOSFS_CONFIG_FAT_CACHE_ENTRIES == 1)
                            if (blkno == volume->fat_cache.blkno)
                            {
                                data = volume->fat_cache.data;
                            }
#else /* (DOSFS_CONFIG_FAT_CACHE_ENTRIES == 1) */
                            if (blkno == volume->fat_cache[0].blkno)
                            {
                                data = volume->fat_cache[0].data;
                            }
                            else if (blkno == volume->fat_cache[1].blkno)
                            {
                                data = volume->fat_cache[1].data;
                            }
#endif /* (DOSFS_CONFIG_FAT_CACHE_ENTRIES == 1) */
#endif /* (DOSFS_CONFIG_FAT_CACHE_ENTRIES == 0) */
                            else
                            {
                                status = dosfs_dir_cache_read(volume, blkno + volume->fat_blkcnt, &entry);

                                if (status == F_NO_ERROR)
                                {
                                    entry->blkno = blkno;

                                    data = entry->data;
                                }
                            }
                            
                            if (status == F_NO_ERROR)
                            {
                                status = dosfs_volume_write(volume, blkno, data);
                            }
                        }

                        mask >>= 1;
                        blkno++;
                    }

                    blkno = blkno_n;
                }

                if (status == F_NO_ERROR)
                {
                    volume->map_flags &= ~(DOSFS_MAP_FLAG_MAP_0_CHANGED << page);
                }
            }
            while ((status == F_NO_ERROR) && (volume->map_flags & DOSFS_MAP_FLAG_MAP_CHANGED));
        }

        if (status == F_NO_ERROR)
        {
#if (DOSFS_CONFIG_FSINFO_SUPPORTED == 1)
            if (volume->map_flags & DOSFS_MAP_FLAG_MAP_FSINFO)
            {
                volume->flags |= (DOSFS_VOLUME_FLAG_FSINFO_VALID | DOSFS_VOLUME_FLAG_FSINFO_DIRTY);
            }
#endif /* (DOSFS_CONFIG_FSINFO_SUPPORTED == 1) */

            volume->map_flags = 0;
            volume->map_entries = 0;

            volume->map_cache.blkno = DOSFS_BLKNO_INVALID;

            if (volume->type != DOSFS_VOLUME_TYPE_FAT32)
            {
                /* For FAT12/FAT16 the map is stored in volume->map_table[]. There
                 * can be at most 256 FAT blocks for FAT32, which means 256 bits,
                 * which is 64 bytes. Hence it fits into volume->map_table[].
                 */
                memset(volume->map_cache.data, 0, 64);
            }

        }
    }

    return status;
}

#endif /* (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 1) */

/***********************************************************************************************************************/

#if (DOSFS_CONFIG_FAT_CACHE_ENTRIES != 0)
#if (DOSFS_CONFIG_FAT_CACHE_ENTRIES == 1)

static int dosfs_fat_cache_write(dosfs_volume_t *volume, dosfs_cache_entry_t *entry)
{
    int status = F_NO_ERROR;

#if (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 1)
    status = dosfs_map_cache_write(volume, volume->fat_cache.blkno, volume->fat_cache.data);
#else /* (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 1) */
    status = dosfs_volume_write(volume, volume->fat_cache.blkno, volume->fat_cache.data);
#endif /* (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 1) */
                
    if (status == F_NO_ERROR)
    {
#if (DOSFS_CONFIG_2NDFAT_SUPPORTED == 1) && (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 0) 
        if (volume->fat2_blkno)
        {
            status = dosfs_volume_write(volume, volume->fat_cache.blkno + volume->fat_blkcnt, volume->fat_cache.data);
        }

        if (status == F_NO_ERROR)
#endif /* (DOSFS_CONFIG_2NDFAT_SUPPORTED == 1) && (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 0) */
        {
            DOSFS_VOLUME_STATISTICS_COUNT(fat_cache_write);

            volume->flags &= ~DOSFS_VOLUME_FLAG_FAT_DIRTY;
        }
    }

