GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/dosfs_core.c
    return status;
}

static int dosfs_fat_cache_fill(dosfs_volume_t *volume, uint32_t blkno, dosfs_cache_entry_t **p_entry)
{
    int status = F_NO_ERROR;

    if (volume->flags & DOSFS_VOLUME_FLAG_FAT_DIRTY)
    {
        status = dosfs_fat_cache_write(volume, &volume->fat_cache);
    }

    if (status == F_NO_ERROR)
    {
        DOSFS_VOLUME_STATISTICS_COUNT(fat_cache_miss);

#if (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 1)
        status = dosfs_map_cache_read(volume, blkno, volume->fat_cache.data);
#else /* (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 1) */
        status = dosfs_volume_read(volume, blkno, volume->fat_cache.data);
#endif /* (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 1) */
        
        if (status == F_NO_ERROR)
        {
            DOSFS_VOLUME_STATISTICS_COUNT(fat_cache_read);

            volume->fat_cache.blkno = blkno;
        }
    }

    *p_entry = &volume->fat_cache;

    return status;
}

static int dosfs_fat_cache_read(dosfs_volume_t *volume, uint32_t blkno, dosfs_cache_entry_t **p_entry)
{
    int status = F_NO_ERROR;

    if (volume->fat_cache.blkno != blkno)
    {
        status = dosfs_fat_cache_fill(volume, blkno, p_entry);
    }
    else
    {
        DOSFS_VOLUME_STATISTICS_COUNT(fat_cache_hit);

        *p_entry = &volume->fat_cache;
    }

    return status;
}

static inline void dosfs_fat_cache_modify(dosfs_volume_t *volume, dosfs_cache_entry_t *entry)
{
    volume->flags |= DOSFS_VOLUME_FLAG_FAT_DIRTY;
}

static int dosfs_fat_cache_flush(dosfs_volume_t *volume)
{
    int status = F_NO_ERROR;

    if (volume->flags & DOSFS_VOLUME_FLAG_FAT_DIRTY)
    {
        DOSFS_VOLUME_STATISTICS_COUNT(fat_cache_flush);

        status = dosfs_fat_cache_write(volume, &volume->fat_cache);
    }

    return status;
}

#else /* (DOSFS_CONFIG_FAT_CACHE_ENTRIES == 1) */

static int dosfs_fat_cache_write(dosfs_volume_t *volume, dosfs_cache_entry_t *entry)
{
    int status = F_NO_ERROR;

    DOSFS_VOLUME_STATISTICS_COUNT(fat_cache_write);

#if (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 1)
    status = dosfs_map_cache_write(volume, entry->blkno, entry->data);
#else /* (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 1) */
    status = dosfs_volume_write(volume, entry->blkno, entry->data);
#endif /* (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 1) */

    if (status == F_NO_ERROR)
    {
#if (DOSFS_CONFIG_2NDFAT_SUPPORTED == 1) && (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 0)
        if (volume->fat2_blkno)
        {
            status = dosfs_volume_write(volume, entry->blkno + volume->fat_blkcnt, entry->data);
        }

        if (status == F_NO_ERROR)
#endif /* (DOSFS_CONFIG_2NDFAT_SUPPORTED == 1) && (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 0) */
        {
            volume->flags &= ((entry == &volume->fat_cache[0]) ? ~DOSFS_VOLUME_FLAG_FAT_0_DIRTY : ~DOSFS_VOLUME_FLAG_FAT_1_DIRTY);
        }
    }

    return status;
}

static int dosfs_fat_cache_fill(dosfs_volume_t *volume, uint32_t blkno, dosfs_cache_entry_t **p_entry)
{
    int status = F_NO_ERROR;
    unsigned int index;

    index = (volume->flags & DOSFS_VOLUME_FLAG_FAT_INDEX_CURRENT) ^ DOSFS_VOLUME_FLAG_FAT_INDEX_CURRENT;

#if (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 0)
    /* For a non-TRANSACTION_SAFE setup, the write backs from the cache
     * have to be in sequence. That means, if there is any cache entry
     * dirty it have to be written back, before either a new one gets 
     * read or the non least recently used one is used.
     */
    if (volume->flags & (DOSFS_VOLUME_FLAG_FAT_0_DIRTY | DOSFS_VOLUME_FLAG_FAT_1_DIRTY))
    {
        status = dosfs_fat_cache_write(volume, &volume->fat_cache[index ^ DOSFS_VOLUME_FLAG_FAT_INDEX_CURRENT]);
    }

    if (status == F_NO_ERROR)
#endif /* (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 0) */
    {
        if (volume->fat_cache[index].blkno != blkno)
        {
            DOSFS_VOLUME_STATISTICS_COUNT(fat_cache_miss);
            DOSFS_VOLUME_STATISTICS_COUNT(fat_cache_read);
            
#if (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 1)
            if (volume->flags & (DOSFS_VOLUME_FLAG_FAT_0_DIRTY << index))
            {
                status = dosfs_fat_cache_write(volume, &volume->fat_cache[index]);
            }
#endif /* (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 1) */

            if (status == F_NO_ERROR)
            {
#if (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 1)
                status = dosfs_map_cache_read(volume, blkno, volume->fat_cache[index].data);
#else /* (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 1) */
                status = dosfs_volume_read(volume, blkno, volume->fat_cache[index].data);
#endif /* (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 1) */
            
                if (status == F_NO_ERROR)
                {
                    volume->flags ^= DOSFS_VOLUME_FLAG_FAT_INDEX_CURRENT;
                
                    volume->fat_cache[index].blkno = blkno;
                }
            }
        }
        else
        {
            DOSFS_VOLUME_STATISTICS_COUNT(fat_cache_hit);

            volume->flags ^= DOSFS_VOLUME_FLAG_FAT_INDEX_CURRENT;
        }
    }

    *p_entry = &volume->fat_cache[index];

    return status;
}

static int dosfs_fat_cache_read(dosfs_volume_t *volume, uint32_t blkno, dosfs_cache_entry_t **p_entry)
{
    int status = F_NO_ERROR;
    unsigned int index;

    index = volume->flags & DOSFS_VOLUME_FLAG_FAT_INDEX_CURRENT;

    if (volume->fat_cache[index].blkno != blkno)
    {
        status = dosfs_fat_cache_fill(volume, blkno, p_entry);
    }
    else
    {
        DOSFS_VOLUME_STATISTICS_COUNT(fat_cache_hit);

        *p_entry = &volume->fat_cache[index];
    }

    return status;
}

static inline void dosfs_fat_cache_modify(dosfs_volume_t *volume, dosfs_cache_entry_t *entry)
{
    volume->flags |= ((entry == &volume->fat_cache[0]) ? DOSFS_VOLUME_FLAG_FAT_0_DIRTY : DOSFS_VOLUME_FLAG_FAT_1_DIRTY);
}

static int dosfs_fat_cache_flush(dosfs_volume_t *volume)
{
    int status = F_NO_ERROR;

    if (volume->flags & DOSFS_VOLUME_FLAG_FAT_0_DIRTY)
    {
        DOSFS_VOLUME_STATISTICS_COUNT(fat_cache_flush);

        status = dosfs_fat_cache_write(volume, &volume->fat_cache[0]);
    }

