GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/dosfs_core.c
    if ((status == F_NO_ERROR) && (volume->flags & DOSFS_VOLUME_FLAG_FAT_1_DIRTY))
    {
        DOSFS_VOLUME_STATISTICS_COUNT(fat_cache_flush);

        status = dosfs_fat_cache_write(volume, &volume->fat_cache[1]);
    }

    return status;
}

#endif /* (DOSFS_CONFIG_FAT_CACHE_ENTRIES == 1) */

#else /* (DOSFS_CONFIG_FAT_CACHE_ENTRIES != 0) */

static inline int dosfs_fat_cache_write(dosfs_volume_t *volume, dosfs_cache_entry_t *entry)
{
    return dosfs_dir_cache_write(volume);
}

#if (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 1)

static int dosfs_fat_cache_fill(dosfs_volume_t *volume, uint32_t blkno, dosfs_cache_entry_t **p_entry)
{
    int status = F_NO_ERROR;

    if ((volume->flags & DOSFS_VOLUME_FLAG_FAT_DIRTY) 
#if (DOSFS_CONFIG_DATA_CACHE_ENTRIES == 0)
        || volume->data_file
#endif /* (DOSFS_CONFIG_DATA_CACHE_ENTRIES == 0) */
        )
    {
        status = dosfs_dir_cache_write(volume);
    }

    if (status == F_NO_ERROR)
    {
        DOSFS_VOLUME_STATISTICS_COUNT(fat_cache_miss);

        status = dosfs_map_cache_read(volume, blkno, volume->dir_cache.data);
        
        if (status == F_NO_ERROR)
        {
            DOSFS_VOLUME_STATISTICS_COUNT(fat_cache_read);

            volume->dir_cache.blkno = blkno;
        }
    }

    *p_entry = &volume->dir_cache;

    return status;
}

static int dosfs_fat_cache_read(dosfs_volume_t *volume, uint32_t blkno, dosfs_cache_entry_t **p_entry)
{
    int status = F_NO_ERROR;

    if (volume->dir_cache.blkno != blkno)
    {
        DOSFS_VOLUME_STATISTICS_COUNT(fat_cache_miss);
        DOSFS_VOLUME_STATISTICS_COUNT(fat_cache_read);

        status = dosfs_fat_cache_fill(volume, blkno, p_entry);
    }
    else
    {
        DOSFS_VOLUME_STATISTICS_COUNT(fat_cache_hit);

        *p_entry = &volume->dir_cache;
    }

    return status;
}

#else /* (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 1) */

static int dosfs_fat_cache_fill(dosfs_volume_t *volume, uint32_t blkno, dosfs_cache_entry_t **p_entry)
{
    int status = F_NO_ERROR;

    status = dosfs_dir_cache_fill(volume, blkno, FALSE);

    *p_entry = &volume->dir_cache;

    return status;
}

#if (DOSFS_CONFIG_STATISTICS == 1)

static int dosfs_fat_cache_read(dosfs_volume_t *volume, uint32_t blkno, dosfs_cache_entry_t **p_entry)
{
    int status = F_NO_ERROR;

    if (volume->dir_cache.blkno != blkno)
    {
        DOSFS_VOLUME_STATISTICS_COUNT(fat_cache_miss);
        DOSFS_VOLUME_STATISTICS_COUNT(fat_cache_read);

        status = dosfs_dir_cache_fill(volume, blkno, FALSE);
    }
    else
    {
        DOSFS_VOLUME_STATISTICS_COUNT(fat_cache_hit);
    }

    *p_entry = &volume->dir_cache;

    return status;
}

#else /* (DOSFS_CONFIG_STATISTICS == 1) */

static inline int dosfs_fat_cache_read(dosfs_volume_t *volume, uint32_t blkno, dosfs_cache_entry_t **p_entry)
{
    return dosfs_dir_cache_read(volume, blkno, p_entry);
}

#endif /* (DOSFS_CONFIG_STATISTICS == 1) */

#endif /* (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 1) */

static inline void dosfs_fat_cache_modify(dosfs_volume_t *volume, dosfs_cache_entry_t *entry)
{
    volume->flags |= DOSFS_VOLUME_FLAG_FAT_DIRTY;
}

static int dosfs_fat_cache_flush(dosfs_volume_t *volume)
{
    int status = F_NO_ERROR;

    if (volume->flags & DOSFS_VOLUME_FLAG_FAT_DIRTY)
    {
        DOSFS_VOLUME_STATISTICS_COUNT(fat_cache_flush);

        status = dosfs_dir_cache_write(volume);
    }

    return status;
}

#endif /* (DOSFS_CONFIG_FAT_CACHE_ENTRIES != 0) */

/***********************************************************************************************************************/

#if (DOSFS_CONFIG_DATA_CACHE_ENTRIES != 0)
#if (DOSFS_CONFIG_FILE_DATA_CACHE == 1)

static int dosfs_data_cache_write(dosfs_volume_t *volume, dosfs_file_t *file)
{
    int status = F_NO_ERROR;
    dosfs_device_t *device;

    device = DOSFS_VOLUME_DEVICE(volume);

    status = (*device->interface->write)(device->context, file->data_cache.blkno, file->data_cache.data, 1, 0, !!(file->mode & DOSFS_FILE_MODE_RANDOM));

#if (DOSFS_CONFIG_MEDIA_FAILURE_SUPPORTED == 1)
    if (status == F_ERR_INVALIDSECTOR)
    {
        volume->flags |= DOSFS_VOLUME_FLAG_MEDIA_FAILURE;
    }
#endif /* (DOSFS_CONFIG_MEDIA_FAILURE_SUPPORTED == 1) */

    if (status == F_NO_ERROR)
    {
        DOSFS_VOLUME_STATISTICS_COUNT(data_cache_write);

        armv7m_atomic_or(&device->lock, DOSFS_DEVICE_LOCK_MODIFIED);
    }

    /* Unconditionally clean the dirty condition, or
     * otherwise the while system would get stuck.
     */
    file->flags &= ~DOSFS_FILE_FLAG_DATA_DIRTY;

    return status;
}

static int dosfs_data_cache_fill(dosfs_volume_t *volume, dosfs_file_t *file, uint32_t blkno, int zero)
{
    int status = F_NO_ERROR;
    dosfs_device_t *device;

    device = DOSFS_VOLUME_DEVICE(volume);

    if (file->flags & DOSFS_FILE_FLAG_DATA_DIRTY)
    {
        status = dosfs_data_cache_write(volume, file);
    }

    if (status == F_NO_ERROR)
    {
        DOSFS_VOLUME_STATISTICS_COUNT(data_cache_miss);

        if (zero)
        {
            memset(file->data_cache.data, 0, DOSFS_BLK_SIZE);

            DOSFS_VOLUME_STATISTICS_COUNT(data_cache_zero);

            file->data_cache.blkno = blkno;
        }
        else
        {
            status = (*device->interface->read)(device->context, blkno, file->data_cache.data, 1, !!(file->mode & DOSFS_FILE_MODE_SEQUENTIAL));

#if (DOSFS_CONFIG_MEDIA_FAILURE_SUPPORTED == 1)
            if (status == F_ERR_INVALIDSECTOR)
            {
                volume->flags |= DOSFS_VOLUME_FLAG_MEDIA_FAILURE;
            }
#endif /* (DOSFS_CONFIG_MEDIA_FAILURE_SUPPORTED == 1) */
            
            if (status == F_NO_ERROR)
            {
                DOSFS_VOLUME_STATISTICS_COUNT(data_cache_read);

                file->data_cache.blkno = blkno;
            }
        }
    }

    return status;
}

static int dosfs_data_cache_read(dosfs_volume_t *volume, dosfs_file_t *file, uint32_t blkno, dosfs_cache_entry_t ** p_entry)
{
    int status = F_NO_ERROR;

