GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/dosfs_core.c
    if (file->data_cache.blkno != blkno)
    {
        status = dosfs_data_cache_fill(volume, file, blkno, FALSE);
    }
    else
    {
        DOSFS_VOLUME_STATISTICS_COUNT(data_cache_hit);
    }

    *p_entry = &file->data_cache;
    
    return status;
}

static int dosfs_data_cache_zero(dosfs_volume_t *volume, dosfs_file_t *file, uint32_t blkno, dosfs_cache_entry_t ** p_entry)
{
    int status = F_NO_ERROR;

    if (file->data_cache.blkno != blkno)
    {
        status = dosfs_data_cache_fill(volume, file, blkno, TRUE);
    }
    else
    {
        DOSFS_VOLUME_STATISTICS_COUNT(data_cache_hit);
    }

    *p_entry = &file->data_cache;
    
    return status;
}

static inline void dosfs_data_cache_modify(dosfs_volume_t *volume, dosfs_file_t *file)
{
    file->flags |= DOSFS_FILE_FLAG_DATA_DIRTY;
}

static int dosfs_data_cache_flush(dosfs_volume_t *volume, dosfs_file_t *file)
{
    int status = F_NO_ERROR;

    if (file->flags & DOSFS_FILE_FLAG_DATA_DIRTY)
    {
        DOSFS_VOLUME_STATISTICS_COUNT(data_cache_flush);

        status = dosfs_data_cache_write(volume, file);
    }

    return status;
}

static int dosfs_data_cache_invalidate(dosfs_volume_t *volume, dosfs_file_t *file, uint32_t blkno, uint32_t blkcnt)
{
    int status = F_NO_ERROR;

    if ((blkno <= file->data_cache.blkno) && (file->data_cache.blkno < (blkno + blkcnt)))
    {
        DOSFS_VOLUME_STATISTICS_COUNT(data_cache_invalidate);

        file->data_cache.blkno = DOSFS_BLKNO_INVALID;

        file->flags &= ~DOSFS_FILE_FLAG_DATA_DIRTY;
    }

    return status;
}

#else /* (DOSFS_CONFIG_FILE_DATA_CACHE == 1) */

static int dosfs_data_cache_write(dosfs_volume_t *volume, dosfs_file_t *file)
{
    int status = F_NO_ERROR;
    dosfs_device_t *device;

    device = DOSFS_VOLUME_DEVICE(volume);

    status = (*device->interface->write)(device->context, volume->data_cache.blkno, volume->data_cache.data, 1, 0, !!(file->mode & DOSFS_FILE_MODE_RANDOM));

#if (DOSFS_CONFIG_MEDIA_FAILURE_SUPPORTED == 1)
    if (status == F_ERR_INVALIDSECTOR)
    {
        volume->flags |= DOSFS_VOLUME_FLAG_MEDIA_FAILURE;
    }
#endif /* (DOSFS_CONFIG_MEDIA_FAILURE_SUPPORTED == 1) */

    if (status == F_NO_ERROR)
    {
        DOSFS_VOLUME_STATISTICS_COUNT(data_cache_write);

        armv7m_atomic_or(&device->lock, DOSFS_DEVICE_LOCK_MODIFIED);
    }

    /* Unconditionally clean the dirty condition, or
     * otherwise the while system would get stuck.
     */
    volume->data_file = NULL;

    return status;
}

static int dosfs_data_cache_fill(dosfs_volume_t *volume, dosfs_file_t *file, uint32_t blkno, int zero)
{
    int status = F_NO_ERROR;
    dosfs_device_t *device;

    device = DOSFS_VOLUME_DEVICE(volume);

    if (volume->data_file)
    {
        status = dosfs_data_cache_write(volume, file);
    }

    if (status == F_NO_ERROR)
    {
        DOSFS_VOLUME_STATISTICS_COUNT(data_cache_miss);

        if (zero)
        {
            memset(volume->data_cache.data, 0, DOSFS_BLK_SIZE);

            DOSFS_VOLUME_STATISTICS_COUNT(data_cache_zero);

            volume->data_cache.blkno = blkno;
        }
        else
        {
            status = (*device->interface->read)(device->context, blkno, volume->data_cache.data, 1, !!(file->mode & DOSFS_FILE_MODE_SEQUENTIAL));

#if (DOSFS_CONFIG_MEDIA_FAILURE_SUPPORTED == 1)
            if (status == F_ERR_INVALIDSECTOR)
            {
                volume->flags |= DOSFS_VOLUME_FLAG_MEDIA_FAILURE;
            }
#endif /* (DOSFS_CONFIG_MEDIA_FAILURE_SUPPORTED == 1) */
            
            if (status == F_NO_ERROR)
            {
                DOSFS_VOLUME_STATISTICS_COUNT(data_cache_read);

                volume->data_cache.blkno = blkno;
            }
        }
    }

    return status;
}

static int dosfs_data_cache_read(dosfs_volume_t *volume, dosfs_file_t *file, uint32_t blkno, dosfs_cache_entry_t ** p_entry)
{
    int status = F_NO_ERROR;

    if (volume->data_cache.blkno != blkno)
    {
        status = dosfs_data_cache_fill(volume, file, blkno, FALSE);
    }
    else
    {
        DOSFS_VOLUME_STATISTICS_COUNT(data_cache_hit);
    }

    *p_entry = &volume->data_cache;
    
    return status;
}

static int dosfs_data_cache_zero(dosfs_volume_t *volume, dosfs_file_t *file, uint32_t blkno, dosfs_cache_entry_t ** p_entry)
{
    int status = F_NO_ERROR;

    if (volume->data_cache.blkno != blkno)
    {
        status = dosfs_data_cache_fill(volume, file, blkno, TRUE);
    }
    else
    {
        DOSFS_VOLUME_STATISTICS_COUNT(data_cache_hit);
    }

    *p_entry = &volume->data_cache;
    
    return status;
}

static inline void dosfs_data_cache_modify(dosfs_volume_t *volume, dosfs_file_t *file)
{
    volume->data_file = file;
}

static int dosfs_data_cache_flush(dosfs_volume_t *volume, dosfs_file_t *file)
{
    int status = F_NO_ERROR;

    if (volume->data_file == file)
    {
        DOSFS_VOLUME_STATISTICS_COUNT(data_cache_flush);

        status = dosfs_data_cache_write(volume, file);
    }

    return status;
}

static int dosfs_data_cache_invalidate(dosfs_volume_t *volume, dosfs_file_t *file, uint32_t blkno, uint32_t blkcnt)
{
    int status = F_NO_ERROR;

    if ((blkno <= volume->data_cache.blkno) && (volume->data_cache.blkno < (blkno + blkcnt)))
    {
        DOSFS_VOLUME_STATISTICS_COUNT(data_cache_invalidate);

        volume->data_cache.blkno = DOSFS_BLKNO_INVALID;

        volume->data_file = NULL;
    }

    return status;
}

#endif /* (DOSFS_CONFIG_FILE_DATA_CACHE == 1) */

#else /* (DOSFS_CONFIG_DATA_CACHE_ENTRIES != 0) */

static int dosfs_data_cache_write(dosfs_volume_t *volume, dosfs_file_t *file)
{
    int status = F_NO_ERROR;

    status = dosfs_dir_cache_write(volume);

    return status;
}

static int dosfs_data_cache_fill(dosfs_volume_t *volume, dosfs_file_t *file, uint32_t blkno, int zero)
{
    int status = F_NO_ERROR;
    dosfs_device_t *device;

    device = DOSFS_VOLUME_DEVICE(volume);

    if (volume->data_file
#if (DOSFS_CONFIG_FAT_CACHE_ENTRIES == 0)
        || (volume->flags & DOSFS_VOLUME_FLAG_FAT_DIRTY)
#endif /* (DOSFS_CONFIG_FAT_CACHE_ENTRIES == 0) */
        )
    {
        status = dosfs_dir_cache_write(volume);
    }

    if (status == F_NO_ERROR)
    {
        if (zero)
        {
            memset(volume->dir_cache.data, 0, DOSFS_BLK_SIZE);

            volume->dir_cache.blkno = blkno;
        }
        else
        {
            status = (*device->interface->read)(device->context, blkno, volume->dir_cache.data, 1, !!(file->mode & DOSFS_FILE_MODE_SEQUENTIAL));

#if (DOSFS_CONFIG_MEDIA_FAILURE_SUPPORTED == 1)
            if (status == F_ERR_INVALIDSECTOR)
            {
                volume->flags |= DOSFS_VOLUME_FLAG_MEDIA_FAILURE;
            }
#endif /* (DOSFS_CONFIG_MEDIA_FAILURE_SUPPORTED == 1) */
            
            if (status == F_NO_ERROR)
            {
                volume->dir_cache.blkno = blkno;
            }
        }
    }

