GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/dosfs_core.c
    return status;
}

static int dosfs_data_cache_read(dosfs_volume_t *volume, dosfs_file_t *file, uint32_t blkno, dosfs_cache_entry_t ** p_entry)
{
    int status = F_NO_ERROR;

    if (volume->dir_cache.blkno != blkno)
    {
        DOSFS_VOLUME_STATISTICS_COUNT(data_cache_miss);
        DOSFS_VOLUME_STATISTICS_COUNT(data_cache_read);

        status = dosfs_data_cache_fill(volume, file, blkno, FALSE);
    }
    else
    {
        DOSFS_VOLUME_STATISTICS_COUNT(data_cache_hit);
    }

    *p_entry = &volume->dir_cache;
    
    return status;
}

static int dosfs_data_cache_zero(dosfs_volume_t *volume, dosfs_file_t *file, uint32_t blkno, dosfs_cache_entry_t ** p_entry)
{
    int status = F_NO_ERROR;

    if (volume->dir_cache.blkno != blkno)
    {
        DOSFS_VOLUME_STATISTICS_COUNT(data_cache_miss);
        DOSFS_VOLUME_STATISTICS_COUNT(data_cache_zero);

        status = dosfs_data_cache_fill(volume, file, blkno, TRUE);
    }

    *p_entry = &volume->dir_cache;
    
    return status;
}

static inline void dosfs_data_cache_modify(dosfs_volume_t *volume, dosfs_file_t *file)
{
    volume->data_file = file;
}

static int dosfs_data_cache_flush(dosfs_volume_t *volume, dosfs_file_t *file)
{
    int status = F_NO_ERROR;

    if (volume->data_file == file)
    {
        DOSFS_VOLUME_STATISTICS_COUNT(data_cache_flush);

        status = dosfs_data_cache_write(volume, file);
    }

    return status;
}

static int dosfs_data_cache_invalidate(dosfs_volume_t *volume, dosfs_file_t *file, uint32_t blkno, uint32_t blkcnt)
{
    int status = F_NO_ERROR;


    if ((blkno <= volume->dir_cache.blkno) && (volume->dir_cache.blkno < (blkno + blkcnt)))
    {
        DOSFS_VOLUME_STATISTICS_COUNT(data_cache_invalidate);

        volume->dir_cache.blkno = DOSFS_BLKNO_INVALID;

        volume->data_file = NULL;
    }

    return status;
}

#endif /* (DOSFS_CONFIG_DATA_CACHE_ENTRIES != 0) */

/***********************************************************************************************************************/

static int dosfs_cluster_read_uncached(dosfs_volume_t *volume, uint32_t clsno, uint32_t *p_clsdata)
{
    int status = F_NO_ERROR;
    uint32_t offset, blkno, clsdata;
    dosfs_cache_entry_t *entry;

#if (DOSFS_CONFIG_FAT12_SUPPORTED == 1)
    if (volume->type == DOSFS_VOLUME_TYPE_FAT12)
    {
        uint8_t *fat_data;

        offset = clsno + (clsno >> 1);
        blkno = volume->fat1_blkno + (offset >> DOSFS_BLK_SHIFT);

        status = dosfs_fat_cache_read(volume, blkno, &entry);
        
        if (status == F_NO_ERROR)
        {
            fat_data = (uint8_t*)(entry->data + (offset & DOSFS_BLK_MASK));
            
            if (clsno & 1)
            {
                clsdata = ((uint32_t)(*fat_data) >> 4);
            }
            else
            {
                clsdata = ((uint32_t)(*fat_data));
            }
            
            if ((offset & DOSFS_BLK_MASK) == DOSFS_BLK_MASK)
            {
                status = dosfs_fat_cache_read(volume, (blkno+1), &entry);
                
                if (status == F_NO_ERROR)
                {
                    fat_data = (uint8_t*)(entry->data + 0);
                }
            }
            else
            {
                fat_data++;
            }
            
            if (status == F_NO_ERROR)
            {
                if (clsno & 1)
                {
                    clsdata |= ((uint32_t)(*fat_data) << 4);
                }
                else
                {
                    clsdata |= (((uint32_t)(*fat_data) & 0x0000000fu) << 8);
                }
            
                if (clsdata >= DOSFS_CLSNO_RESERVED12)
                {
                    clsdata += (DOSFS_CLSNO_RESERVED32 - DOSFS_CLSNO_RESERVED12);
                }

                *p_clsdata = clsdata;
            }
        }
    }
    else
#endif /* DOSFS_CONFIG_FAT12_SUPPORTED == 1 */
    {
        offset = clsno << volume->type;
        blkno = volume->fat1_blkno + (offset >> DOSFS_BLK_SHIFT);

        status = dosfs_fat_cache_read(volume, blkno, &entry);
            
        if (status == F_NO_ERROR)
        {
            if (volume->type == DOSFS_VOLUME_TYPE_FAT16)
            {
                uint16_t *fat_data;

                fat_data = (uint16_t*)((void*)(entry->data + (offset & DOSFS_BLK_MASK)));
                
                clsdata = DOSFS_FTOHS(*fat_data);
                
                if (clsdata >= DOSFS_CLSNO_RESERVED16)
                {
                    clsdata += (DOSFS_CLSNO_RESERVED32 - DOSFS_CLSNO_RESERVED16);
                }
            }
            else
            {
                uint32_t *fat_data;
            
                fat_data = (uint32_t*)((void*)(entry->data + (offset & DOSFS_BLK_MASK)));
                
                clsdata = DOSFS_FTOHL(*fat_data) & 0x0fffffff;
            }

            *p_clsdata = clsdata;
        }
    }

    return status;
}

#if (DOSFS_CONFIG_CLUSTER_CACHE_ENTRIES != 0)

static int dosfs_cluster_read(dosfs_volume_t *volume, uint32_t clsno, uint32_t *p_clsdata)
{
    int status = F_NO_ERROR;
    uint32_t clsdata;
    unsigned int index;

    index = clsno % DOSFS_CONFIG_CLUSTER_CACHE_ENTRIES;

    if (volume->cluster_cache[index].clsno != clsno)
    {
        DOSFS_VOLUME_STATISTICS_COUNT(cluster_cache_miss);

        status = dosfs_cluster_read_uncached(volume, clsno, &clsdata);

        volume->cluster_cache[index].clsno = clsno;
        volume->cluster_cache[index].clsdata = clsdata;
    }
    else
    {
        DOSFS_VOLUME_STATISTICS_COUNT(cluster_cache_hit);
    }

    *p_clsdata = volume->cluster_cache[index].clsdata;

    return status;
}

#else /* (DOSFS_CONFIG_CLUSTER_CACHE_ENTRIES != 0) */

static inline int dosfs_cluster_read(dosfs_volume_t *volume, uint32_t clsno, uint32_t *p_clsdata)
{
    return dosfs_cluster_read_uncached(volume, clsno, p_clsdata);
}

#endif /* (DOSFS_CONFIG_CLUSTER_CACHE_ENTRIES != 0) */

static int dosfs_cluster_write(dosfs_volume_t *volume, uint32_t clsno, uint32_t clsdata, int allocate)
{
    int status = F_NO_ERROR;
    uint32_t offset, blkno;
    dosfs_cache_entry_t *entry;

#if (DOSFS_CONFIG_FAT12_SUPPORTED == 1)
    if (volume->type == DOSFS_VOLUME_TYPE_FAT12)
    {
        uint8_t *fat_data;

        offset = clsno + (clsno >> 1);
        blkno = volume->fat1_blkno + (offset >> DOSFS_BLK_SHIFT);
        
