GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/dosfs_core.c
        status = dosfs_fat_cache_read(volume, blkno, &entry);

        if (status == F_NO_ERROR)
        {
            fat_data = (uint8_t*)(entry->data + (offset & DOSFS_BLK_MASK));
            
            if (clsno & 1)
            {
                *fat_data = (*fat_data & 0x0f) | (clsdata << 4);
            }
            else
            {
                *fat_data = clsdata;
            }
            
            if ((offset & DOSFS_BLK_MASK) == DOSFS_BLK_MASK)
            {
                dosfs_fat_cache_modify(volume, entry);
                
                status = dosfs_fat_cache_read(volume, (blkno+1), &entry);
                
                if (status == F_NO_ERROR)
                {
                    fat_data = (uint8_t*)(entry->data + 0);
                }
            }
            else
            {
                fat_data++;
            }
            
            if (status == F_NO_ERROR)
            {
                if (clsno & 1)
                {
                    *fat_data = clsdata >> 4;
                }
                else
                {
                    *fat_data = (*fat_data & 0xf0) | ((clsdata >> 8) & 0x0f);
                }
                
                dosfs_fat_cache_modify(volume, entry);
            }
        }
    }
    else
#endif /* (DOSFS_CONFIG_FAT12_SUPPORTED == 1) */
    {
        offset = clsno << volume->type;
        blkno = volume->fat1_blkno + (offset >> DOSFS_BLK_SHIFT);

        status = dosfs_fat_cache_read(volume, blkno, &entry);
            
        if (status == F_NO_ERROR)
        {
            if (volume->type == DOSFS_VOLUME_TYPE_FAT16)
            {
                uint16_t *fat_data;

                fat_data = (uint16_t*)((void*)(entry->data + (offset & DOSFS_BLK_MASK)));

                *fat_data = DOSFS_HTOFS(clsdata);
            }
            else
            {
                uint32_t *fat_data;

                fat_data = (uint32_t*)((void*)(entry->data + (offset & DOSFS_BLK_MASK)));

                *fat_data = (*fat_data & 0xf0000000) | (DOSFS_HTOFL(clsdata) & 0x0fffffff);
            }

            dosfs_fat_cache_modify(volume, entry);
        }
    }

#if (DOSFS_CONFIG_CLUSTER_CACHE_ENTRIES != 0)
    if (status == F_NO_ERROR)
    {
        unsigned int index;

        index = clsno % DOSFS_CONFIG_CLUSTER_CACHE_ENTRIES;
        
        if (allocate || (volume->cluster_cache[index].clsno == clsno))
        {
            volume->cluster_cache[index].clsno = clsno;
            volume->cluster_cache[index].clsdata = clsdata;
        }
    }

#endif /* (DOSFS_CONFIG_CLUSTER_CACHE_ENTRIES != 0) */

    return status;
}


static int dosfs_cluster_chain_seek(dosfs_volume_t *volume, uint32_t clsno, uint32_t clscnt, uint32_t *p_clsno)
{
    int status = F_NO_ERROR;
    uint32_t clsdata;

    do
    {
        status = dosfs_cluster_read(volume, clsno, &clsdata);
        
        if (status == F_NO_ERROR)
        {
            if ((clsdata >= 2) && (clsdata <= volume->last_clsno))
            {
                clsno = clsdata;
                clscnt--;
            }
            else
            {
                status = F_ERR_EOF;
            }
        }
    }
    while ((status == F_NO_ERROR) && (clscnt != 0));
    
    if (status == F_NO_ERROR)
    {
        *p_clsno = clsno;
    }

    return status;
}


/* In order to guarantee file system fault tolerance the chain allocation is done iteratively.
 * free entry is found, it's marked as END_OF_CHAIN, and then the previous entry in the chain
 * is linked to it. This ensures that there is not broken chain anywhere. The is only the
 * possibility that there is a lost END_OF_CHAIN somewhere. Given that the fat cache writes
 * in sequence, the link process happens AFTER the END_OF_CHAIN has been written. 
 * 
 * If the allocation fails, then the chain is first split at the original create point,
 * and then freed. Hence again no inconsistent state is possible.
 */

static int dosfs_cluster_chain_create(dosfs_volume_t *volume, uint32_t clsno, uint32_t clscnt, uint32_t *p_clsno_a, uint32_t *p_clsno_l)
{
    int status = F_NO_ERROR;
    uint32_t clsno_a, clsno_f, clsno_n, clsno_l, clscnt_a, clsdata;

    clsno_f = volume->next_clsno;
    clsno_a = DOSFS_CLSNO_NONE;
    clsno_l = DOSFS_CLSNO_NONE;
    clsno_n = clsno_f;

    clscnt_a = 0;

    do
    {
        /* Bypass cluster cache on read while searching.
         */
        status = dosfs_cluster_read_uncached(volume, clsno_n, &clsdata);
        
        if (status == F_NO_ERROR)
        {
            if (clsdata == DOSFS_CLSNO_FREE)
            {
                status = dosfs_cluster_write(volume, clsno_n, DOSFS_CLSNO_END_OF_CHAIN, TRUE);
                
                if (status == F_NO_ERROR)
                {
                    if (clsno_a == DOSFS_CLSNO_NONE)
                    {
                        clsno_a = clsno_n;
                    }
                    
                    if (clsno_l != DOSFS_CLSNO_NONE)
                    {
                        status = dosfs_cluster_write(volume, clsno_l, clsno_n, TRUE);
                    }
                    
                    clsno_l = clsno_n;
                    clscnt_a++;
                }
            }
            
            clsno_n++;

            if (clsno_n > volume->last_clsno)
            {
                clsno_n = 2; 
            }

            if (clsno_n == clsno_f)
            {
                status = F_ERR_NOMOREENTRY;
            }
        }
    }
    while ((status == F_NO_ERROR) && (clscnt != clscnt_a));

    if (status == F_NO_ERROR)
    {
        if (clsno != DOSFS_CLSNO_NONE)
        {
            status = dosfs_cluster_write(volume, clsno, clsno_a, TRUE);
        }
        
        if (status == F_NO_ERROR)
        {
#if (DOSFS_CONFIG_FSINFO_SUPPORTED == 1)
            volume->flags |= DOSFS_VOLUME_FLAG_FSINFO_DIRTY;
            
            volume->free_clscnt -= clscnt_a;
#endif /* (DOSFS_CONFIG_FSINFO_SUPPORTED == 1) */
            
            volume->next_clsno = clsno_n;

