GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/dosfs_core.c
            *p_clsno_a = clsno_a;
            
            if (p_clsno_l)
            {
                *p_clsno_l = clsno_l;
            }
        }
    }
    else
    {
        if (status == F_ERR_NOMOREENTRY)
        {
            if (clsno_a != DOSFS_CLSNO_NONE)
            {
                status = dosfs_cluster_chain_destroy(volume, clsno_a, DOSFS_CLSNO_FREE);
            }
            
            if (status == F_NO_ERROR)
            {
                status = F_ERR_NOMOREENTRY;
            }
        }
#if (DOSFS_CONFIG_FSINFO_SUPPORTED == 1)
        else
        {
            volume->flags &= ~DOSFS_VOLUME_FLAG_FSINFO_VALID;
        }
#endif /* (DOSFS_CONFIG_FSINFO_SUPPORTED == 1) */
    }

    return status;
}

#if (DOSFS_CONFIG_SEQUENTIAL_SUPPORTED == 1)

static int dosfs_cluster_chain_create_sequential(dosfs_volume_t *volume, uint32_t clsno, uint32_t clscnt, uint32_t *p_clsno_a, uint32_t *p_clsno_l)
{
    int status = F_NO_ERROR;
    uint32_t clsno_a, clsno_b, clsno_t, clsno_n, clsno_l, clsno_s, clscnt_a, clsdata;

    clsno_b = volume->base_clsno;
    clsno_t = volume->limit_clsno;
    clsno_n = volume->free_clsno;

    clsno_a = DOSFS_CLSNO_NONE;
    clsno_l = DOSFS_CLSNO_NONE;

    clscnt_a = 0;

    do
    {
        if (clsno_n == clsno_t)
        {
            do
            {
                if (clsno_b == volume->start_clsno)
                {
                    clsno_t = volume->end_clsno;
                    clsno_b = clsno_t - (volume->au_size >> volume->cls_blk_shift);
                }
                else
                {
                    clsno_t = clsno_b;
                    clsno_b = clsno_t - (volume->au_size >> volume->cls_blk_shift);
                }

                if (clsno_b == volume->base_clsno)
                {
                    status = F_ERR_NOMOREENTRY;
                }
                else
                {
                    clsno_n = clsno_t;

                    do 
                    {
                        clsno_s = clsno_n -1;

                        status = dosfs_cluster_read_uncached(volume, clsno_s, &clsdata);

                        if (status == F_NO_ERROR)
                        {
                            if (clsdata == DOSFS_CLSNO_FREE)
                            {
                                clsno_n = clsno_s;
                            }
                        }
                    }
                    while ((status == F_NO_ERROR) && (clsdata == DOSFS_CLSNO_FREE) && (clsno_n != clsno_b));
                }
            }
            while ((status == F_NO_ERROR) && (clsno_n == clsno_t));
        }

        if (status == F_NO_ERROR)
        {
            status = dosfs_cluster_write(volume, clsno_n, DOSFS_CLSNO_END_OF_CHAIN, TRUE);
                
            if (status == F_NO_ERROR)
            {
                if (clsno_a == DOSFS_CLSNO_NONE)
                {
                    clsno_a = clsno_n;
                }
                    
                if (clsno_l != DOSFS_CLSNO_NONE)
                {
                    status = dosfs_cluster_write(volume, clsno_l, clsno_n, TRUE);
                }
                
                clsno_l = clsno_n;
                clscnt_a++;

                clsno_n++;
            }
        }
    }
    while ((status == F_NO_ERROR) && (clscnt != clscnt_a));

    if (status == F_NO_ERROR)
    {
        if (clsno != DOSFS_CLSNO_NONE)
        {
            status = dosfs_cluster_write(volume, clsno, clsno_a, TRUE);
        }
        
        if (status == F_NO_ERROR)
        {
#if (DOSFS_CONFIG_FSINFO_SUPPORTED == 1)
            volume->flags |= DOSFS_VOLUME_FLAG_FSINFO_DIRTY;
            
            volume->free_clscnt -= clscnt_a;
#endif /* (DOSFS_CONFIG_FSINFO_SUPPORTED == 1) */
            
            volume->base_clsno = clsno_b;
            volume->limit_clsno = clsno_t;
            volume->free_clsno = clsno_n;

            *p_clsno_a = clsno_a;
            
            if (p_clsno_l)
            {
                *p_clsno_l = clsno_l;
            }
        }
    }
    else
    {
        if (status == F_ERR_NOMOREENTRY)
        {
            if (clsno_a != DOSFS_CLSNO_NONE)
            {
                status = dosfs_cluster_chain_destroy(volume, clsno_a, DOSFS_CLSNO_FREE);
            }

            if ((status == F_NO_ERROR) || (status == F_ERR_NOMOREENTRY))
            {
                status = dosfs_cluster_chain_create(volume, clsno, clscnt, p_clsno_a, p_clsno_l);
            }
        }
#if (DOSFS_CONFIG_FSINFO_SUPPORTED == 1)
        else
        {
            volume->flags &= ~DOSFS_VOLUME_FLAG_FSINFO_VALID;
        }
#endif /* (DOSFS_CONFIG_FSINFO_SUPPORTED == 1) */
    }

    return status;
}

#endif /* (DOSFS_CONFIG_SEQUENTIAL_SUPPORTED == 1) */


#if (DOSFS_CONFIG_CONTIGUOUS_SUPPORTED == 1)

/* A sequential cluster chain is created by first finding a free sequentual, and then hooking it up back to front. 
 * Hence there is no inconsistent file system state.
 */

static int dosfs_cluster_chain_create_contiguous(dosfs_volume_t *volume, uint32_t clscnt, uint32_t *p_clsno_a)
{
    int status = F_NO_ERROR;
    uint32_t clsno_a, clsno_n, clscnt_a, clsdata;

    clsno_a = volume->end_clsno;
    clscnt_a = 0;

    do
    {
        clsno_a--;

        /* Bypass cluster cache on read while searching.
         */
        status = dosfs_cluster_read_uncached(volume, clsno_a, &clsdata);
        
        if (status == F_NO_ERROR)
        {
            if (clsdata == DOSFS_CLSNO_FREE)
            {
                clscnt_a++;
            }
            else
            {
                clsno_a = (((((clsno_a << volume->cls_blk_shift) + volume->cls_blk_offset) / volume->au_size) * volume->au_size) - volume->cls_blk_offset) >> volume->cls_blk_shift;
            }
        }
    }
    while ((status == F_NO_ERROR) && (clscnt != clscnt_a) && (clsno_a != volume->start_clsno));

    if (status == F_NO_ERROR)
    {
        if (clscnt == clscnt_a)
        {
            clsno_n = clsno_a + clscnt_a;
            clsdata = DOSFS_CLSNO_END_OF_CHAIN;

            do
            {
                clsno_n--;

                status = dosfs_cluster_write(volume, clsno_n, clsdata, FALSE);

                clsdata = clsno_n;
            }
            while ((status == F_NO_ERROR) && (clsno_n != clsno_a));

#if (DOSFS_CONFIG_FSINFO_SUPPORTED == 1)
            if (status == F_NO_ERROR)
            {
                volume->flags |= DOSFS_VOLUME_FLAG_FSINFO_DIRTY;

                volume->free_clscnt -= clscnt_a;
            }
            else
            {
                volume->flags &= ~DOSFS_VOLUME_FLAG_FSINFO_VALID;
            }
#endif /* (DOSFS_CONFIG_FSINFO_SUPPORTED == 1) */
        }
        else
        {
            status = F_ERR_NOMOREENTRY;
        }
    }

