GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/dosfs_core.c
    *p_clsno_a = clsno_a;

    return status;
}

#endif /* (DOSFS_CONFIG_CONTIGUOUS_SUPPORTED == 1) */


/* The chain destroy process walks along the chain and frees each entry front to back.
 * Hence it's possible to have a lost chain, but no file system corruption.
 */

static int dosfs_cluster_chain_destroy(dosfs_volume_t *volume, uint32_t clsno, uint32_t clsdata)
{
    int status = F_NO_ERROR;
    dosfs_device_t *device;
    uint32_t clsno_n;
    uint32_t clsno_s, clsno_e;

    device = DOSFS_VOLUME_DEVICE(volume);

    clsno_s = DOSFS_CLSNO_NONE;
    clsno_e = DOSFS_CLSNO_NONE;

    do
    {
        /* Bypass cluster cache on read while destroying.
         */
        status = dosfs_cluster_read_uncached(volume, clsno, &clsno_n);

        if (status == F_NO_ERROR)
        {
            status = dosfs_cluster_write(volume, clsno, clsdata, FALSE);

            if (status == F_NO_ERROR)
            {
                if (clsdata == DOSFS_CLSNO_FREE)
                {
                    if (clsno_s != DOSFS_CLSNO_NONE)
                    {
                        if ((clsno_e + 1) == clsno)
                        {
                            clsno_e = clsno;
                        }
                        else
                        {
                            (*device->interface->discard)(device->context, (volume->cls_blk_offset + (clsno_s << volume->cls_blk_shift)), ((clsno_e - clsno_s + 1) << volume->cls_blk_shift));

                            clsno_s = clsno;
                            clsno_e = clsno;
                        }
                    }
                    else
                    {
                        clsno_s = clsno;
                        clsno_e = clsno;
                    }

#if (DOSFS_CONFIG_FSINFO_SUPPORTED == 1)
                    volume->free_clscnt++;
#endif /* (DOSFS_CONFIG_FSINFO_SUPPORTED == 1) */
                }

                if ((clsno_n >= 2) && (clsno_n <= volume->last_clsno))
                {
                    clsno = clsno_n;
                    clsdata = DOSFS_CLSNO_FREE;
                }
                else
                {
                    if (clsno_n < DOSFS_CLSNO_LAST)
                    {
                        status = F_ERR_EOF;
                    }
                }
            }
        }
    }
    while ((status == F_NO_ERROR) && (clsno_n < DOSFS_CLSNO_LAST));

    if (clsno_s != DOSFS_CLSNO_NONE)
    {
        (*device->interface->discard)(device->context, (volume->cls_blk_offset + (clsno_s << volume->cls_blk_shift)), ((clsno_e - clsno_s + 1) << volume->cls_blk_shift));
    }

#if (DOSFS_CONFIG_FSINFO_SUPPORTED == 1)
    if (status == F_NO_ERROR)
    {
        volume->flags |= DOSFS_VOLUME_FLAG_FSINFO_DIRTY;
    }
    else
    {
        volume->flags &= ~DOSFS_VOLUME_FLAG_FSINFO_VALID;
    }
#endif /* (DOSFS_CONFIG_FSINFO_SUPPORTED == 1) */

    return status;
}

/***********************************************************************************************************************/

static inline unsigned int dosfs_name_ascii_upcase(unsigned int cc)
{
    unsigned int uc;

    if ((cc <= 0x1f) || (cc > 0x7f))
    {
        uc = 0x0000;
    }
    else
    {
        if ((cc >= 'a') && (cc <= 'z'))
        {
            uc = cc - ('a' - 'A');
        }
        else
        {
            uc = cc;
        }
    }

    return uc;
}

#if (DOSFS_CONFIG_VFAT_SUPPORTED == 0)

static const char *dosfs_name_cstring_to_dosname(const char *cstring, uint8_t *dosname)
{
    unsigned int cc, n, n_e;

    memset(dosname, ' ', 11);

    n = 0;
    n_e = 8;

    cc = *cstring++;

    if (cc == ' ')
    {
        cstring = NULL;
    }
    else
    {
        /* A leading sequence of "." or ".." is handled varbatim.
         */
    
        if (cc == '.')
        {
            dosname[n++] = cc;

            cc = *cstring++;

            if (cc == '.')
            {
                dosname[n++] = cc;

                cc = *cstring++;
            }

            if ((cc != '/') && (cc != '\\') && (cc != '\0'))
            {
                cstring = NULL;
            }
        }

        while ((cstring != NULL) && (cc != '/') && (cc != '\\') && (cc != '\0'))
        {
            if (cc == '.')
            {
                if (n_e == 11)
                {
                    cstring = NULL;
                }
                else
                {
                    n = 8;
                    n_e = 11;
                        
                    cc = *cstring++;
                }
            }
            else
            {
                if (n == n_e)
                {
                    cstring = NULL;
                }
                else
                {
                    if ((cc <= 0x001f) ||
                        (cc >= 0x0080) ||
                        (cc == '"') ||
                        (cc == '*') ||
                        (cc == '+') ||
                        (cc == ',') ||
                        (cc == '/') ||
                        (cc == ':') ||
                        (cc == ';') ||
                        (cc == '<') ||
                        (cc == '=') ||
                        (cc == '>') ||
                        (cc == '?') ||
                        (cc == '[') ||
                        (cc == '\\') ||
                        (cc == ']') ||
                        (cc == '|'))
                    {
                        cstring = NULL;
                    }
                    else
                    {
                        dosname[n++] = dosfs_name_ascii_upcase(cc);
                            
                        cc = *cstring++;
                    }
                }
            }
        }

        if (n == 0)
        {
            cstring = NULL;
        }
    }

    return cstring;
}

static const char *dosfs_name_cstring_to_pattern(const char *cstring, char *pattern)
{
    unsigned int cc, n, n_e;

    memset(pattern, ' ', 11);

    n = 0;
    n_e = 8;

    cc = *cstring++;

