GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/dosfs_core.c
    if (cc == ' ')
    {
        cstring = NULL;
    }
    else
    {
        /* A leading sequence of "." or ".." is handled varbatim.
         */
    
        if (cc == '.')
        {
            pattern[n++] = cc;

            cc = *cstring++;

            if (cc == '.')
            {
                pattern[n++] = cc;

                cc = *cstring++;
            }
        }

        while ((cstring != NULL) && (cc != '\0'))
        {
            if (cc == '.')
            {
                if (n_e == 11)
                {
                    cstring = NULL;
                }
                else
                {
                    n = 8;
                    n_e = 11;
                    
                    cc = *cstring++;
                }
            }
            else
            {
                if (n == n_e)
                {
                    cstring = NULL;
                }
                else
                {
                    if (cc == '*')
                    {
                        while (n != n_e)
                        {
                            pattern[n++] = '?';
                        }

                        cc = *cstring++;
                    }
                    else
                    {
                        if ((cc <= 0x001f) ||
                            (cc >= 0x0080) ||
                            (cc == '"') ||
                            (cc == '+') ||
                            (cc == ',') ||
                            (cc == '/') ||
                            (cc == ':') ||
                            (cc == ';') ||
                            (cc == '<') ||
                            (cc == '=') ||
                            (cc == '>') ||
                            (cc == '[') ||
                            (cc == '\\') ||
                            (cc == ']') ||
                            (cc == '|'))
                        {
                            cstring = NULL;
                        }
                        else
                        {
                            pattern[n++] = dosfs_name_ascii_upcase(cc);
                            
                            cc = *cstring++;
                        }
                    }
                }
            }
        }
    }

    return cstring;
}

#endif /* (DOSFS_CONFIG_VFAT_SUPPORTED == 1) */

static const char *dosfs_name_cstring_to_label(const char *cstring, uint8_t *label)
{
    unsigned int cc, n, n_e;

    memset(label, ' ', 11);

    n = 0;
    n_e = 11;

    cc = *cstring++;

    if (cc == ' ')
    {
        cstring = NULL;
    }
    else
    {
        do
        {
            if (n == n_e)
            {
                cstring = NULL;
            }
            else
            {
                if ((cc <= 0x001f) ||
                    (cc >= 0x0080) ||
                    (cc == '"') ||
                    (cc == '*') ||
                    (cc == '+') ||
                    (cc == ',') ||
                    (cc == '.') ||
                    (cc == '/') ||
                    (cc == ':') ||
                    (cc == ';') ||
                    (cc == '<') ||
                    (cc == '=') ||
                    (cc == '>') ||
                    (cc == '?') ||
                    (cc == '[') ||
                    (cc == '\\') ||
                    (cc == ']') ||
                    (cc == '|'))
                {
                    cstring = NULL;
                }
                else
                {
                    label[n++] = dosfs_name_ascii_upcase(cc);
                            
                    cc = *cstring++;
                }
            }
        }
        while ((cstring != NULL) && (cc != '\0'));
    }
    
    return cstring;
}

static char *dosfs_name_dosname_to_cstring(const uint8_t *dosname, unsigned int doscase, char *cstring, char *cstring_e)
{
    unsigned int i, n;

    for (n = 7; n != 0; n--)
    {
        if (dosname[n] != ' ')
        {
            break;
        }
    }

    if (cstring + (n +1) <= cstring_e)
    {
        for (i = 0; i < (n +1); i++)
        {
            if ((dosname[i] <= 0x1f) || (dosname[i] >= 0x80))
            {
                *cstring++ = '_';
            }
#if (DOSFS_CONFIG_VFAT_SUPPORTED == 1)
            else if ((doscase & DOSFS_DIR_TYPE_LCASE_NAME) && (dosname[i] >= 'A') && (dosname[i] <= 'Z'))
            {
                *cstring++ = (dosname[i] + ('a' - 'A'));
            }
#endif /* (DOSFS_CONFIG_VFAT_SUPPORTED == 1) */
            else
            {
                *cstring++ = dosname[i];
            }
        }

        for (n = 10; n != 7; n--)
        {
            if (dosname[n] != ' ')
            {
                break;
            }
        }

        if (n != 7)
        {
            if (cstring < cstring_e)
            {
                *cstring++ = '.';
                
                if (cstring + ((n -8) +1) <= cstring_e)
                {
                    for (i = 8; i < (n +1); i++)
                    {
                        if ((dosname[i] <= 0x1f) || (dosname[i] >= 0x80))
                        {
                            *cstring++ = '_';
                        }
#if (DOSFS_CONFIG_VFAT_SUPPORTED == 1)
                        else if ((doscase & DOSFS_DIR_TYPE_LCASE_EXT) && (dosname[i] >= 'A') && (dosname[i] <= 'Z'))
                        {
                            *cstring++ = (dosname[i] + ('a' - 'A'));
                        }
#endif /* (DOSFS_CONFIG_VFAT_SUPPORTED == 1) */
                        else
                        {
                            *cstring++ = dosname[i];
                        }
                    }
                }
            }
        }

        if (cstring != NULL)
        {
            if (cstring < cstring_e)
            {
                *cstring++ = '\0';
            }
            else
            {
                cstring = NULL;
            }
        }
    }
    else
    {
        cstring = NULL;
    }

    return cstring;
}

static char *dosfs_name_label_to_cstring(const uint8_t *label, char *cstring, char *cstring_e)
{
    unsigned int i, n;

    for (n = 10; n != 0; n--)
    {
        if (label[n] != ' ')
        {
            break;
        }
    }

    if (cstring + (n +1) <= cstring_e)
    {
        for (i = 0; i < (n +1); i++)
        {
            if ((label[i] <= 0x1f) || (label[i] >= 0x80))
            {
                *cstring++ = '_';
            }
            else
            {
                *cstring++ = label[i];
            }
        }

        if (cstring < cstring_e)
        {
            *cstring++ = '\0';
        }
        else
        {
            cstring = NULL;
        }
    }
    else
    {
        cstring = NULL;
    }

    return cstring;
}

#if (DOSFS_CONFIG_VFAT_SUPPORTED == 1)

#if (DOSFS_CONFIG_UTF8_SUPPORTED == 1)

static inline unsigned int dosfs_name_cstring_to_unicode(const char *cstring, const char **p_cstring)
{
    unsigned int cc, c;
    const uint8_t *utf8;

