GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/dosfs_core.c
#endif /* (DOSFS_CONFIG_UTF8_SUPPORTED == 1) */

static const uint8_t dosfs_name_nibble_to_char_table[16] = "0123456789ABCDEF";

static const char *dosfs_name_cstring_to_uniname(const char *cstring, dosfs_unicode_t *uniname, uint8_t *p_unicount, uint8_t *dosname, uint8_t *p_doscase)
{
    unsigned int cc, i, n, n_e, doscase;

    doscase = 0;

    memset(dosname, ' ', 11);

    n = 0;
    n_e = 8;
    i = 0;

#if (DOSFS_CONFIG_UTF8_SUPPORTED == 1)
    cc = dosfs_name_cstring_to_unicode(cstring, &cstring);
#else /* (DOSFS_CONFIG_UTF8_SUPPORTED == 1) */
    cc = *cstring++;
#endif /* (DOSFS_CONFIG_UTF8_SUPPORTED == 1) */

    if (cc == ' ')
    {
        cstring = NULL;
    }
    else
    {
        /* A leading sequence of "." and ".." is handled varbatim.
         */
    
        if (cc == '.')
        {
            dosname[n++] = cc;
            uniname[i++] = cc;

#if (DOSFS_CONFIG_UTF8_SUPPORTED == 1)
            cc = dosfs_name_cstring_to_unicode(cstring, &cstring);
#else /* (DOSFS_CONFIG_UTF8_SUPPORTED == 1) */
            cc = *cstring++;
#endif /* (DOSFS_CONFIG_UTF8_SUPPORTED == 1) */

            if (cc == '.')
            {
                dosname[n++] = cc;
                uniname[i++] = cc;
            
#if (DOSFS_CONFIG_UTF8_SUPPORTED == 1)
                cc = dosfs_name_cstring_to_unicode(cstring, &cstring);
#else /* (DOSFS_CONFIG_UTF8_SUPPORTED == 1) */
                cc = *cstring++;
#endif /* (DOSFS_CONFIG_UTF8_SUPPORTED == 1) */
            }

            if ((cstring != NULL) && (cc != '/') && (cc != '\\') && (cc != '\0'))
            {
                dosname[0] = '\0';
            }
        }

        while ((cstring != NULL) && (cc != '/') && (cc != '\\') && (cc != '\0'))
        {
            if (dosname[0] != '\0')
            {
                if (cc == '.')
                {
                    if (n_e == 11)
                    {
                        dosname[0] = '\0';
                    }
                    else
                    {
                        n = 8;
                        n_e = 11;
                    }
                }
                else
                {
                    if (n == n_e)
                    {
                        dosname[0] = '\0';
                    }
                    else
                    {
                        if ((cc <= 0x001f) ||
                            (cc >= 0x0080) || 
                            (cc == '"') ||
                            (cc == '*') ||
                            (cc == '+') ||
                            (cc == ',') ||
                            (cc == '.') ||
                            (cc == '/') ||
                            (cc == ':') ||
                            (cc == ';') ||
                            (cc == '<') ||
                            (cc == '=') ||
                            (cc == '>') ||
                            (cc == '?') ||
                            (cc == '[') ||
                            (cc == '\\') ||
                            (cc == ']') ||
                            (cc == '|'))
                        {
                            dosname[0] = '\0';
                        }
                        else
                        {
                            dosname[n++] = dosfs_name_ascii_upcase(cc);

                            if ((cc >= 'a') && (cc <= 'z'))
                            {
                                doscase |= ((n_e == 8) ? DOSFS_DIR_TYPE_LCASE_NAME : DOSFS_DIR_TYPE_LCASE_EXT);
                            }

                            if ((cc >= 'A') && (cc <= 'Z'))
                            {
                                doscase |= ((n_e == 8) ? DOSFS_DIR_TYPE_UCASE_NAME : DOSFS_DIR_TYPE_UCASE_EXT);
                            }
                        }
                    }
                }
            }

            if (i == 255)
            {
                cstring = NULL;
            }
            else
            {
                if ((cc <= 0x001f) ||
#if (DOSFS_CONFIG_UTF8_SUPPORTED == 0)
                    (cc >= 0x0080) || 
#endif /* (DOSFS_CONFIG_UTF8_SUPPORTED == 0) */
                    (cc == '"') ||
                    (cc == '*') ||
                    (cc == '/') ||
                    (cc == ':') ||
                    (cc == '<') ||
                    (cc == '>') ||
                    (cc == '?') ||
                    (cc == '\\') ||
                    (cc == '|'))
                {
                    cstring = NULL;
                }
                else
                {
                    uniname[i++] = cc;

#if (DOSFS_CONFIG_UTF8_SUPPORTED == 1)
                    cc = dosfs_name_cstring_to_unicode(cstring, &cstring);
#else /* (DOSFS_CONFIG_UTF8_SUPPORTED == 1) */
                    cc = *cstring++;
#endif /* (DOSFS_CONFIG_UTF8_SUPPORTED == 1) */
                }
            }
        }

        if (cstring != NULL)
        {
            /* Strip trailing ' ' and '.'. This will force "." and ".."
             * to be a dosname only.
             */
            while (i != 0)
            {
                if ((uniname[i -1] != ' ') && (uniname[i -1] != '.'))
                {
                    break;
                }

                i--;
            }

            if (dosname[0] != '\0')
            {
                if (((doscase & (DOSFS_DIR_TYPE_LCASE_NAME | DOSFS_DIR_TYPE_UCASE_NAME)) == (DOSFS_DIR_TYPE_LCASE_NAME | DOSFS_DIR_TYPE_UCASE_NAME)) ||
                    ((doscase & (DOSFS_DIR_TYPE_LCASE_EXT  | DOSFS_DIR_TYPE_UCASE_EXT )) == (DOSFS_DIR_TYPE_LCASE_EXT  | DOSFS_DIR_TYPE_UCASE_EXT)))
                {
                    /* Have seen both lower case and upper case characters, hence a lossy dosname mapping.
                     */

                    doscase = DOSFS_DIR_TYPE_LOSSY;
                }
                else
                {
                    /* A fully legel dosname, hence no uniname mapping.
                     */
                    doscase &= (DOSFS_DIR_TYPE_LCASE_NAME | DOSFS_DIR_TYPE_LCASE_EXT);
                }
            }
            else
            {
                /* If there is no valid dosname, there has to be a valid uniname.
                 */
                doscase = 0x00;

                if (i == 0)
                {
                    cstring = NULL;
                }
            }
        }
    }

