GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/dosfs_core.c
    *p_unicount = i;
    *p_doscase = doscase;

    return cstring;
}

static char *dosfs_name_uniname_to_cstring(const dosfs_unicode_t *uniname, unsigned int unicount, char *cstring, char *cstring_e)
{
    unsigned int cc, n;

    for (n = 0; n < unicount; n++)
    {
        cc = *uniname++;

#if (DOSFS_CONFIG_UTF8_SUPPORTED == 1)
        cstring = dosfs_name_unicode_to_cstring(cc, cstring, cstring_e);

        if (cstring == NULL)
        {
            break;
        }
#else /* (DOSFS_CONFIG_UTF8_SUPPORTED == 1) */

        if (cstring < cstring_e)
        {
            if ((cc <= 0x1f) || (cc >= 0x80))
            {
                *cstring++ = '_';
            }
            else
            {
                *cstring++ = cc;
            }
        }
        else
        {
            cstring = NULL;

            break;
        }
#endif /* (DOSFS_CONFIG_UTF8_SUPPORTED == 1) */
    }

    if (cstring != NULL)
    {
        if (cstring < cstring_e)
        {
            *cstring++ = '\0';
        }
        else
        {
            cstring = NULL;
        }
    }

    return cstring;
}

static void dosfs_name_uniname_to_dosname(const dosfs_unicode_t *uniname, unsigned int unicount, uint8_t *dosname, unsigned int *p_dosprefix)
{
    unsigned int offset, prefix, i, n, n_e, cc;

    memset(dosname, ' ', 11);

    /* Compute the offset of the last '.' in uniname.
     */
    
    for (offset = unicount, i = 0; i < unicount; i++)
    {
        if (uniname[i] == '.')
        {
            offset = i;
        }
    }

    prefix = 0;
    n = 0;
    n_e = 8;
    i = 0;

    do
    {
        cc = uniname[i];

        if (cc == '.')
        {
            if (i <= offset)
            {
                if ((n_e == 11) || (i != offset))
                {
                    if (n != n_e)
                    {
                        dosname[n++] = '_';
                    }
                }
                else
                {
                    prefix = n;
                    n = 8;
                    n_e = 11;
                }
            }
            else
            {
                /* ignore */
            }
        }
        else
        {
            if (cc == ' ')
            {
                /* ignore */
            }
            else
            {
                if (n != n_e)
                {
                    if ((cc <= 0x001f) ||
                        (cc >= 0x0080) ||
                        (cc == '+') ||
                        (cc == ',') ||
                        (cc == ';') ||
                        (cc == '=') ||
                        (cc == '[') ||
                        (cc == ']'))
                    {
                        dosname[n++] = '_';
                    }
                    else
                    {
                        dosname[n++] = dosfs_name_ascii_upcase(cc);
                    }
                }
                else
                {
                    /* ignore */
                }
            }
        }

        i++;
    }
    while ((n != 11) && (i < unicount));

    if (n_e == 8)
    {
        prefix = n;
    }

    *p_dosprefix = prefix;
}

static uint8_t dosfs_name_checksum_dosname(const uint8_t *dosname)
{
    unsigned int n, chksum;

    for (chksum = 0, n = 0; n < 11; n++)
    {
        chksum = (((chksum >> 1) & 0x7f) | (chksum << 7)) + *dosname++;
    }

    return chksum & 0xff;
}

static uint16_t dosfs_name_checksum_uniname(const dosfs_unicode_t *uniname, unsigned int unicount)
{
    unsigned int n, chksum;

    for (chksum = 0, n = 0; n < unicount; n++)
    {
        chksum = (((chksum >> 1) & 0x7fff) | (chksum << 15)) + *uniname++;
    }

    return chksum & 0xffff;
}

#endif /* (DOSFS_CONFIG_VFAT_SUPPORTED == 1) */

/***********************************************************************************************************************/

static int dosfs_path_convert_filename(dosfs_volume_t *volume, const char *filename, const char **p_filename)
{
    int status = F_NO_ERROR;

#if (DOSFS_CONFIG_VFAT_SUPPORTED == 1) 

    filename = dosfs_name_cstring_to_uniname(filename, volume->lfn_name, &volume->lfn_count, volume->dir.dir_name, &volume->dir.dir_nt_reserved);

    volume->dir_entries = volume->lfn_count ? ((volume->lfn_count +12) / 13) : 0;

#else /* (DOSFS_CONFIG_VFAT_SUPPORTED == 1) */

    filename = dosfs_name_cstring_to_dosname(filename, volume->dir.dir_name);

    volume->dir.dir_nt_reserved = 0;

#endif /* (DOSFS_CONFIG_VFAT_SUPPORTED == 1) */

    if (filename != NULL)
    {
        if (p_filename)
        {
            *p_filename = filename;
        }
    }
    else
    {
        status = F_ERR_INVALIDNAME;
    }

    return status;
}

#if (DOSFS_CONFIG_VFAT_SUPPORTED == 0)

static int dosfs_path_find_callback_empty(dosfs_volume_t *volume, void *private, dosfs_dir_t *dir)
{
    return TRUE;
}

static int dosfs_path_find_callback_volume(dosfs_volume_t *volume, void *private, dosfs_dir_t *dir)
{
    return (dir->dir_attr & DOSFS_DIR_ATTR_VOLUME_ID);
}

static int dosfs_path_find_callback_directory(dosfs_volume_t *volume, void *private, dosfs_dir_t *dir)
{
    if (!(dir->dir_attr & DOSFS_DIR_ATTR_DIRECTORY))
    {
        return FALSE;
    }
    else
    {
        uint32_t clsno, clsno_d;

        clsno = (uint32_t)private;

        if (volume->type == DOSFS_VOLUME_TYPE_FAT32)
        {
            clsno_d = ((uint32_t)DOSFS_FTOHS(dir->dir_clsno_hi) << 16) | (uint32_t)DOSFS_FTOHS(dir->dir_clsno_lo);
        }
        else
        {
            clsno_d = (uint32_t)DOSFS_FTOHS(dir->dir_clsno_lo);
        }

        return (clsno == clsno_d);
    }
}

static int dosfs_path_find_callback_name(dosfs_volume_t *volume, void *private, dosfs_dir_t *dir)
{
    return (!(dir->dir_attr & DOSFS_DIR_ATTR_VOLUME_ID) && !memcmp(dir->dir_name, volume->dir.dir_name, sizeof(dir->dir_name)));
}

static int dosfs_path_find_callback_pattern(dosfs_volume_t *volume, void *private, dosfs_dir_t *dir)
{
    const uint8_t *pattern = (const uint8_t*)private;
    int match;
    unsigned int n;

    if (!(dir->dir_attr & DOSFS_DIR_ATTR_VOLUME_ID))
    {
        match = TRUE;

        if (pattern != NULL)
        {
            for (n = 0; n < 11; n++)
            {
                if (!((pattern[n] == '?') || (dir->dir_name[n] == pattern[n])))
                {
                    match = FALSE;
                    
                    break;
                }
            }
        }
    }
    else
    {
        match = FALSE;
    }

    return match;
}

#else /* (DOSFS_CONFIG_VFAT_SUPPORTED == 0) */

static void dosfs_path_convert_ldir_entry(dosfs_volume_t *volume, dosfs_dir_t *dir, unsigned int sequence)
{
    unsigned int s, i, offset, cc;

