GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/dosfs_core.c
    if (sequence & DOSFS_LDIR_SEQUENCE_FIRST)
    {
        volume->dir.dir_name[0] = '\0';
        volume->dir_entries = (sequence & DOSFS_LDIR_SEQUENCE_INDEX);
        volume->lfn_count = (sequence & DOSFS_LDIR_SEQUENCE_INDEX) * 13;
    }

    s = 0;
    i = ((sequence & DOSFS_LDIR_SEQUENCE_INDEX) -1) * 13;

    do
    {
        offset = dosfs_path_ldir_name_table[s++];
        
        cc = (((uint8_t*)dir)[offset +1] << 8) | ((uint8_t*)dir)[offset +0];
        
        if (cc == 0x0000)
        {
            volume->lfn_count = i;
        }
        else if (i < 255)
        {
#if (DOSFS_CONFIG_UTF8_SUPPORTED == 0)
            /* If UTF8 is not supported, then the name space is ASCII. In
             * that case remap illegal values to 0x001f.
             */
            if (cc >= 0x0080)
            {
                volume->lfn_name[i++] = 0x001f;
            }
            else
#endif /* (DOSFS_CONFIG_UTF8_SUPPORTED == 0) */
            {
                volume->lfn_name[i++] = cc;
            }
        }
    }
    while ((s < 13) && (cc != 0x0000));
}


static int dosfs_path_find_callback_empty(dosfs_volume_t *volume, void *private, dosfs_dir_t *dir, unsigned int sequence)
{
    return TRUE;
}

static int dosfs_path_find_callback_volume(dosfs_volume_t *volume, void *private, dosfs_dir_t *dir, unsigned int sequence)
{
    int match;

    if (sequence & DOSFS_LDIR_SEQUENCE_INDEX)
    {
        match = FALSE;
    }
    else
    {
        if (dir->dir_attr & DOSFS_DIR_ATTR_VOLUME_ID)
        {
            match = (sequence != DOSFS_LDIR_SEQUENCE_LAST);
        }
        else
        {
            match = FALSE;
        }
    }

    return match;
}

static int dosfs_path_find_callback_directory(dosfs_volume_t *volume, void *private, dosfs_dir_t *dir, unsigned int sequence)
{
    uint32_t clsno, clsno_d;
    int match;

    if (sequence & DOSFS_LDIR_SEQUENCE_INDEX)
    {
        dosfs_path_convert_ldir_entry(volume, dir, sequence);

        match = TRUE;
    }
    else
    {
        if (dir->dir_attr & DOSFS_DIR_ATTR_DIRECTORY)
        {
            clsno = (uint32_t)private;

            if (volume->type == DOSFS_VOLUME_TYPE_FAT32)
            {
                clsno_d = ((uint32_t)DOSFS_FTOHS(dir->dir_clsno_hi) << 16) | (uint32_t)DOSFS_FTOHS(dir->dir_clsno_lo);
            }
            else
            {
                clsno_d = (uint32_t)DOSFS_FTOHS(dir->dir_clsno_lo);
            }

            if (clsno_d == clsno)
            {
                if (sequence != DOSFS_LDIR_SEQUENCE_LAST)
                {
                    volume->dir_entries = 0;
                    volume->lfn_count = 0;
                }

                match = TRUE;
            }
            else
            {
                match = FALSE;
            }
        }
        else
        {
            match = FALSE;
        }
    }

    return match;
}

static int dosfs_path_find_callback_name(dosfs_volume_t *volume, void *private, dosfs_dir_t *dir, unsigned int sequence)
{
    unsigned int offset, i, s, cc, lc;
    int match;

    if (sequence & DOSFS_LDIR_SEQUENCE_INDEX)
    {
        match = TRUE;

        if ((sequence & DOSFS_LDIR_SEQUENCE_FIRST) && ((sequence & DOSFS_LDIR_SEQUENCE_INDEX) != volume->dir_entries))
        {
            match = FALSE;
        }
        else
        {
            s = 0;
            i = ((sequence & DOSFS_LDIR_SEQUENCE_INDEX) -1) * 13;
                
            do
            {
                offset = dosfs_path_ldir_name_table[s++];
                    
                cc = (((uint8_t*)dir)[offset +1] << 8) | ((uint8_t*)dir)[offset +0];
                    
                if (i < volume->lfn_count)
                {
                    lc = volume->lfn_name[i];

#if (DOSFS_CONFIG_UTF8_SUPPORTED == 1)
                    cc = dosfs_name_unicode_upcase(cc);
                    lc = dosfs_name_unicode_upcase(lc);
#else /* (DOSFS_CONFIG_UTF8_SUPPORTED == 1) */
                    /* That's a tad non-intuitive here. "volume->lfn_name[]" does contain
                     * only ASCII characters. Hence only the ASCII portion of the UNICODE
                     * name space has to be upcased. Anything outside needs properly mismatch.
                     */
                    if (cc < 0x80)
                    {
                        cc = dosfs_name_ascii_upcase(cc);
                    }
                    lc = dosfs_name_ascii_upcase(lc);
#endif /* (DOSFS_CONFIG_UTF8_SUPPORTED == 1) */
                  
                    if (lc != cc)
                    {
                        match = FALSE;
                    }
                }
                else 
                {
                    if (i == volume->lfn_count)
                    {
                        if (cc != 0x0000)
                        {
                            match = FALSE;
                        }
                    }
                    else
                    {
                        if (cc != 0xffff)
                        {
                            match = FALSE;
                        }
                    }
                }

                i++;
            }
            while (match && (s < 13));
        }
    }
    else
    {
        if (!(dir->dir_attr & DOSFS_DIR_ATTR_VOLUME_ID))
        {
            if (sequence != DOSFS_LDIR_SEQUENCE_LAST)
            {
                if ((volume->dir.dir_name[0] != '\0') && !memcmp(dir->dir_name, volume->dir.dir_name, sizeof(dir->dir_name)))
                {
                    /* Set volume->dir_entries to 0 on a SFN match.
                     */
                    volume->dir_entries = 0;
                    
                    match = TRUE;
                }
                else
                {
                    match = FALSE;
                }
            }
            else
            {
                /* A LFN name had been checked already while looking at the LDIR entries.
                 * If we get here it's a match, otherwise the code would not be called.
                 */
                match = TRUE;
            }
        }
        else
        {
            match = FALSE;
        }
    }

    return match;
}

static int dosfs_path_find_callback_unique(dosfs_volume_t *volume, void *private, dosfs_dir_t *dir, unsigned int sequence)
{
    unsigned int cc, index;
    unsigned int *p_mask;
    int match;
    
