GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/dosfs_core.c
    if (sequence & DOSFS_LDIR_SEQUENCE_INDEX)
    {
        match = TRUE;
    }
    else
    {
        if (!(dir->dir_attr & DOSFS_DIR_ATTR_VOLUME_ID))
        {
            p_mask = (unsigned int*)private;

            if (p_mask != NULL)
            {
                /* The pivot index is stored in the upper 4 bits, while the
                 * pivot result is store in the lower 9 bit. After the 
                 * unique search, the lower 9 bit contain which similar
                 * names with '1' to '9' at the privot index were encountered.
                 */

                index = (*p_mask) >> 9;

                cc = dir->dir_name[index];

                if ((cc >= '1') && (cc <= '9'))
                {
                    volume->dir.dir_name[index] = cc;
                    
                    if (!memcmp(dir->dir_name, volume->dir.dir_name, sizeof(dir->dir_name)))
                    {
                        *p_mask |= (1 << (cc - '1'));
                    }
                }

                match = FALSE;
            }
            else
            {
                match = !memcmp(dir->dir_name, volume->dir.dir_name, sizeof(dir->dir_name));
            }
        }

        match = FALSE;
    }

    return match;
}

static int dosfs_path_find_callback_pattern(dosfs_volume_t *volume, void *private, dosfs_dir_t *dir, unsigned int sequence)
{
    const char *pattern = (const char*)private;
    unsigned int offset, i, n, n_e, cc, lc;
    int match, skip;

    if (sequence & DOSFS_LDIR_SEQUENCE_INDEX)
    {
        dosfs_path_convert_ldir_entry(volume, dir, sequence);

        match = TRUE;
    }
    else
    {
        if (!(dir->dir_attr & DOSFS_DIR_ATTR_VOLUME_ID))
        {
            if (sequence != DOSFS_LDIR_SEQUENCE_LAST)
            {
                /* A SFN is converted into a LFN before pattern matching.
                 * Otherwise, the matching would be inconsistent.
                 */

                i = 0;

                for (n_e = 7; n_e != 0; n_e--)
                {
                    if (dir->dir_name[n_e] != ' ')
                    {
                        break;
                    }
                }
                
                for (n = 0; n <= n_e; n++)
                {
                    /* Matching is always done case insensitive. However when the name is converted
                     * back into a cstring, it needs to be case sensitive.
                     */
                    if ((dir->dir_nt_reserved & DOSFS_DIR_TYPE_LCASE_NAME) && (dir->dir_name[n] >= 'A') && (dir->dir_name[n] <= 'Z'))
                    {
                        volume->lfn_name[i++] = (dir->dir_name[n] + ('a' - 'A'));
                    }
                    else
                    {
                        volume->lfn_name[i++] = dir->dir_name[n];
                    }
                }

                offset = i;

                for (n_e = 10; n_e != 7; n_e--)
                {
                    if (dir->dir_name[n_e] != ' ')
                    {
                        break;
                    }
                }
                
                if (n_e != 7)
                {
                    volume->lfn_name[i++] = '.';

                    for (n = 8; n <= n_e; n++)
                    {
                        /* Matching is always done case insensitive. However when the name is converted
                         * back into a cstring, it needs to be case sensitive.
                         */
                        if ((dir->dir_nt_reserved & DOSFS_DIR_TYPE_LCASE_EXT) && (dir->dir_name[n] >= 'A') && (dir->dir_name[n] <= 'Z'))
                        {
                            volume->lfn_name[i++] = (dir->dir_name[n] + ('a' - 'A'));
                        }
                        else
                        {
                            volume->lfn_name[i++] = dir->dir_name[n];
                        }
                    }
                }

                volume->dir_entries = 0;
                volume->lfn_count = i;
            }
            else
            {
                /* Compute the offset of the last '.' in the LFN.
                 */

                for (offset = volume->lfn_count, i = 0; i < volume->lfn_count; i++)
                {
                    if (volume->lfn_name[i] == '.')
                    {
                        offset = i;
                    }
                }
            }

            match = true;

            if (pattern != NULL)
            {
                /* The matcher below uses WINNT semantics:
                 *
                 * '.' (DOS_DOT)          matches either a '.' or zero characters beyond the name string
                 * '?' (DOS_QM)           matches a single character or, upon encountering a '.' or end of name string, advances the expression to the end of the set of contiguous DOS_QMs
                 * '*' (DOS_STAR)         matches zero or more characters until encountering and matching the final '.' in the name
                 *
                 * Derived sequences:
                 *
                 * '*' EOF                matches to the end of the name
                 * '*' '.'                matches either to the next '.' or zero characters beyond the name string
                 * '*' '?'                same as '?' (zero length '*' match)
                 * '*' '*'                same as '*' (zero length '*' match)
                 */

                skip = FALSE;

                i = 0;
                cc = 0;

                do
                {
                    if (!skip)
                    {
#if (DOSFS_CONFIG_UTF8_SUPPORTED == 1)
                        cc = dosfs_name_cstring_to_unicode(pattern, &pattern);
#else /* (DOSFS_CONFIG_UTF8_SUPPORTED == 1) */
                        cc = *pattern++;
#endif /* (DOSFS_CONFIG_UTF8_SUPPORTED == 1) */
                    }

                    skip = FALSE;

                    if (i < volume->lfn_count)
                    {
                        if (cc == '\0')
                        {
                            match = FALSE;
                        }
                        else if (cc == '*')                         /* asterisk      */
                        {
                            if (i <= offset)
                            {
                                i = offset;
                            }
                            else
                            {
                                i = volume->lfn_count;
                            }
                        }
                        else if (cc == '?')                         /* question mask  */
                        {
                            if (i == offset)
                            {
                                do
                                {
#if (DOSFS_CONFIG_UTF8_SUPPORTED == 1)
                                    cc = dosfs_name_cstring_to_unicode(pattern, &pattern);
#else /* (DOSFS_CONFIG_UTF8_SUPPORTED == 1) */
                                    cc = *pattern++;
#endif /* (DOSFS_CONFIG_UTF8_SUPPORTED == 1) */
                                }
                                while (cc == '?');

                                skip = TRUE;
                            }

                            i++;
                        }
                        else                                        /* <character>   */
                        {
                            lc = volume->lfn_name[i++];

#if (DOSFS_CONFIG_UTF8_SUPPORTED == 1)
                            cc = dosfs_name_unicode_upcase(cc);
                            lc = dosfs_name_unicode_upcase(lc);
#else /* (DOSFS_CONFIG_UTF8_SUPPORTED == 1) */
                            /* That's a tad non-intuitive here. "volume->lfn_name[]" does contain
                             * only ASCII characters. Hence only the ASCII portion of the UNICODE
                             * name space has to be upcased. Anything outside needs properly mismatch.
                             */
                            cc = dosfs_name_ascii_upcase(cc);
                            lc = dosfs_name_ascii_upcase(lc);
#endif /* (DOSFS_CONFIG_UTF8_SUPPORTED == 1) */

