GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/dosfs_core.c
                            if (lc != cc)
                            {
                                match = FALSE;
                            }
                        }
                    }
                    else
                    {
                        if ((cc == '\0') ||                         /* EOF           */
                            (cc == '.') ||                          /* dot           */
                            (cc == '?') ||                          /* question mark */
                            (cc == '*'))                            /* start         */
                        {
                        }
                        else                                        /* <character>   */
                        {
                            match = FALSE;
                        }
                    }
                }
                while (match && (cc != '\0'));
            }

            /* Set volume->dir_entries to 0 on a SFN match.
             */
            if (match && (sequence != DOSFS_LDIR_SEQUENCE_LAST))
            {
                volume->dir_entries = 0;
            }
        }
        else
        {
            match = FALSE;
        }
    }

    return match;
}

#endif /* (DOSFS_CONFIG_VFAT_SUPPORTED == 0) */


/*
 * p_dir != NULL:
 *
 *   p_clsno    clsno of first primary/secondary dir entry
 *   p_index    index within dirctory of first primary/secondary dir entry
 *   p_dir      dir cache entry containg the primary dir entry

 * p_dir == NULL:
 *
 *   p_clsno    clsno of first free dir entry
 *   p_index    index within directory of first free dir entry,
 *              or (index | 0x00020000) if a new cluster is needed,
 *              or 0x00010000 if there is no free entry anymore.
 *
 * The number of secondary entries is contained within name->lfn_entries. 
 */

static int dosfs_path_find_entry(dosfs_volume_t *volume, uint32_t clsno, uint32_t index, uint32_t count, dosfs_find_callback_t callback, void *private, uint32_t *p_clsno, uint32_t *p_index, dosfs_dir_t **p_dir)
{
    int status = F_NO_ERROR;
    int done;
#if (DOSFS_CONFIG_VFAT_SUPPORTED == 1)
    unsigned int sequence, chksum, ordinal;
#endif /* (DOSFS_CONFIG_VFAT_SUPPORTED == 1) */
    uint32_t clsno_f, clsno_m, clsdata, blkno, blkno_e, index_f, index_m, count_f;
    dosfs_cache_entry_t *entry;
    dosfs_dir_t *dir, *dir_e;

    done = FALSE;
    dir = NULL;

    if (clsno == DOSFS_CLSNO_NONE)
    {
        clsno = volume->root_clsno;
        blkno = volume->root_blkno + DOSFS_INDEX_TO_BLKCNT_ROOT(index);
        blkno_e = volume->root_blkno + volume->root_blkcnt;
    }
    else
    {
        /* dosfs_path_find_entry reports back clsno/index for the current set of
         * directory entries. Hence dosfs_path_find_pattern has to set to the next
         * entry by adding the composite size to "index", which of course
         * can cross then a cluster boundary.
         */

        if (index && !((index << DOSFS_DIR_SHIFT) & volume->cls_mask))
        {
            blkno = DOSFS_CLSNO_TO_BLKNO(clsno) + volume->cls_blk_size;
            blkno_e = DOSFS_CLSNO_TO_BLKNO(clsno) + volume->cls_blk_size;
        }
        else
        {
            blkno = DOSFS_CLSNO_TO_BLKNO(clsno) + DOSFS_INDEX_TO_BLKCNT(index);
            blkno_e = DOSFS_CLSNO_TO_BLKNO(clsno) + volume->cls_blk_size;
        }
    }

    clsno_f = DOSFS_CLSNO_NONE;
    index_f = 0;
    count_f = 0;

    clsno_m = DOSFS_CLSNO_NONE;
    index_m = 0;

#if (DOSFS_CONFIG_VFAT_SUPPORTED == 1)
    sequence = 0;
    chksum = 0;
#endif /* (DOSFS_CONFIG_VFAT_SUPPORTED == 1) */
    
    while ((status == F_NO_ERROR) && !done && (index < 0x10000))
    {
        if (blkno == blkno_e)
        {
            if (clsno == DOSFS_CLSNO_NONE)
            {
                done = TRUE;
                dir = NULL;
            }
            else
            {
                status = dosfs_cluster_read(volume, clsno, &clsdata);
                
                if (status == F_NO_ERROR)
                {
                    if (clsdata >= DOSFS_CLSNO_LAST)
                    {
                        done = TRUE;
                        dir = NULL;
                    }
                    else
                    {
                        if ((clsdata >= 2) && (clsdata <= volume->last_clsno))
                        {
                            clsno = clsdata;
                            blkno = DOSFS_CLSNO_TO_BLKNO(clsno);
                            blkno_e = blkno + volume->cls_blk_size;
                        }
                        else
                        {
                            status = F_ERR_EOF;
                        }
                    }
                }
            }
        }

        if (status == F_NO_ERROR)
        {
            if (!done)
            {
                status = dosfs_dir_cache_read(volume, blkno, &entry);
                
                if (status == F_NO_ERROR)
                {
                    dir = (dosfs_dir_t*)((void*)(entry->data + DOSFS_INDEX_TO_BLKOFS(index)));
                    dir_e = (dosfs_dir_t*)((void*)(entry->data + DOSFS_BLK_SIZE));
                
                    do
                    {
                        if (dir->dir_name[0] == 0x00)
                        {
                            /* A 0x00 in dir_name[0] says it's a free entry, and all subsequent entries
                             * are also free. So we can stop searching.
                             */

                            done = TRUE;
                            dir = NULL;
                        }
                        else if (dir->dir_name[0] == 0xe5)
                        {
                            /* A 0xe5 in dir_name[0] says it's a free entry.
                             */

#if (DOSFS_CONFIG_VFAT_SUPPORTED == 1)
                            if (count_f != count)
                            {
                                if ((count_f == 0) || !((clsno_f == clsno) && ((index_f + count_f) == index)))
                                {
                                    clsno_f = clsno;
                                    index_f = index;
                                    count_f = 1;
                                }
                                else
                                {
                                    count_f++;
                                }
                            }
#else /* (DOSFS_CONFIG_VFAT_SUPPORTED == 1) */
                            if (clsno_f == DOSFS_CLSNO_NONE)
                            {
                                clsno_f = clsno;
                                index_f = index;
                            }
#endif /* (DOSFS_CONFIG_VFAT_SUPPORTED == 1) */

