GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/dosfs_core.c
                            dir++;
                            index++;
                        }
                        else
                        { 
                            if ((dir->dir_attr & DOSFS_DIR_ATTR_LONG_NAME_MASK) == DOSFS_DIR_ATTR_LONG_NAME)
                            {
#if (DOSFS_CONFIG_VFAT_SUPPORTED == 1)
                                ordinal = (dir->dir_name[0] & 0x1f); /* LDIR_Ord    */
                                
                                if (ordinal == 0)
                                {
                                    sequence = 0; /* mark as bad sequence */
                                }
                                else
                                {
                                    if (dir->dir_name[0] & 0x40)
                                    {
                                        clsno_m = clsno;
                                        index_m = index;

                                        sequence = ordinal | DOSFS_LDIR_SEQUENCE_FIRST;
                                        chksum   = dir->dir_crt_time_tenth;     /* LDIR_ChkSum */
                                    }
                                    else
                                    {
                                        if (((sequence & DOSFS_LDIR_SEQUENCE_INDEX) == (ordinal +1)) && (chksum == dir->dir_crt_time_tenth))
                                        {
                                            sequence = (sequence & DOSFS_LDIR_SEQUENCE_MISMATCH) | ordinal;
                                        }
                                        else
                                        {
                                            sequence = 0; /* mark as bad sequence */
                                        }
                                    }
                                }

                                if ((sequence != 0) && !(sequence & DOSFS_LDIR_SEQUENCE_MISMATCH))
                                {
                                    if (!(*callback)(volume, private, dir, sequence))
                                    {
                                        sequence |= DOSFS_LDIR_SEQUENCE_MISMATCH;
                                    }
                                }
#endif /* (DOSFS_CONFIG_VFAT_SUPPORTED == 1) */

                                dir++;
                                index++;
                            }
                            else
                            {
#if (DOSFS_CONFIG_VFAT_SUPPORTED == 0)
                                if ((*callback)(volume, private, dir))
                                {
                                    clsno_m = clsno;
                                    index_m = index;

                                    done = TRUE;
                                }
#else /* (DOSFS_CONFIG_VFAT_SUPPORTED == 0) */

                                if ((sequence & DOSFS_LDIR_SEQUENCE_INDEX) == 1)
                                {
                                    if (chksum == dosfs_name_checksum_dosname(dir->dir_name))
                                    {
                                        sequence = (sequence & DOSFS_LDIR_SEQUENCE_MISMATCH) | DOSFS_LDIR_SEQUENCE_LAST;
                                    }
                                    else
                                    {
                                        sequence = 0;
                                    }
                                }

                                if (!(sequence & DOSFS_LDIR_SEQUENCE_MISMATCH))
                                {
                                    if ((*callback)(volume, private, dir, sequence))
                                    {
                                        if (sequence == 0)
                                        {
                                            clsno_m = clsno;
                                            index_m = index;
                                        }

                                        done = TRUE;
                                    }
                                }

                                sequence = 0;

#endif /* (DOSFS_CONFIG_VFAT_SUPPORTED == 0) */

                                if (!done)
                                {
                                    dir++;
                                    index++;
                                }
                            }
                        }
                    }
                    while ((status == F_NO_ERROR) && !done && (dir != dir_e));

                    if ((status == F_NO_ERROR) && !done)
                    {
                        blkno++;
                    }
                }
            }
        }
    }

    if (status == F_NO_ERROR)
    {
        if (p_clsno)
        {
            if (dir != NULL)
            {
                *p_clsno = clsno_m;
                *p_index = index_m;
            }
            else
            {
                if (count != 0)
                {
                    if (count_f == count)
                    {
                        /* Found a matching set of entries ...
                         */
                        *p_clsno = clsno_f;
                        *p_index = index_f;
                    }
                    else
                    {
                        /* Need to allocate possibly a new cluster.
                         */
                            
                        if ((clsno == DOSFS_CLSNO_NONE) && (volume->type != DOSFS_VOLUME_TYPE_FAT32))
                        {
                            if (((index + count) << DOSFS_DIR_SHIFT) <= (volume->root_blkcnt * DOSFS_BLK_SIZE))
                            {
                                *p_clsno = DOSFS_CLSNO_NONE;
                                *p_index = index;
                            }
                            else
                            {
                                *p_clsno = DOSFS_CLSNO_NONE;
                                *p_index = 0x00010000;
                            }
                        }
                        else
                        {
                            if (((index << DOSFS_DIR_SHIFT) & ~volume->cls_mask) == (((index + count) << DOSFS_DIR_SHIFT) & ~volume->cls_mask))
                            {
                                *p_clsno = clsno;
                                *p_index = index;
                            }
                            else
                            {
                                if ((index + count) <= 0x00010000)
                                {
                                    *p_clsno = clsno;
                                    *p_index = index | 0x00020000;
                                }
                                else
                                {
                                    *p_clsno = DOSFS_CLSNO_NONE;
                                    *p_index = 0x00010000;
                                }
                            }
                        }
                    }
                }
            }
        }

        if (p_dir)
        {
            *p_dir = dir;
        }
    }

