GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/dosfs_core.c
    return status;
}

/*
 * filename   incoming full path
 * p_filename last path element 
 * p_clsno    clsno of parent directory of last path element
 */

static int dosfs_path_find_directory(dosfs_volume_t *volume, const char *filename, const char **p_filename, uint32_t *p_clsno)
{
    int status = F_NO_ERROR;
    unsigned int cc;
    const char *filename_e;
    uint32_t clsno;
    dosfs_dir_t *dir;

    if (*filename == '\0')
    {
        status = F_ERR_INVALIDNAME;
    }
    else if ((*filename == '/') || (*filename == '\\'))
    {
        clsno = DOSFS_CLSNO_NONE;

        filename++;
    }
    else
    {
        if (volume->cwd_clsno != DOSFS_CLSNO_END_OF_CHAIN)
        {
            clsno = volume->cwd_clsno;
        }
        else
        {
            status = F_ERR_INVALIDDIR;
        }
    }

    if (status == F_NO_ERROR)
    {
        do
        {
            /* Scan ahead to see whether there is a directory left.
             */
            filename_e = filename;
            
            do
            {
                cc = *filename_e++;
            }
            while ((cc != '/') && (cc != '\\') && (cc != '\0'));
            
            if ((cc == '/') || (cc == '\\'))
            {
                status = dosfs_path_convert_filename(volume, filename, &filename);

                if (status == F_NO_ERROR)
                {
                    if ((volume->dir.dir_name[0] == '.') && (volume->dir.dir_name[1] == ' '))
                    {
                        /* This is a special case here, as there is no "." or ".." entry
                         * in the root directory.
                         */
                    }
                    else
                    {
                        status = dosfs_path_find_entry(volume, clsno, 0, 0, dosfs_path_find_callback_name, NULL, NULL, NULL, &dir);

                        if (status == F_NO_ERROR)
                        {
                            if (dir != NULL)
                            {
                                if (dir->dir_attr & DOSFS_DIR_ATTR_DIRECTORY)
                                {
                                    if (volume->type == DOSFS_VOLUME_TYPE_FAT32)
                                    {
                                        clsno = ((uint32_t)DOSFS_FTOHS(dir->dir_clsno_hi) << 16) | (uint32_t)DOSFS_FTOHS(dir->dir_clsno_lo);
                                    }
                                    else
                                    { 
                                        clsno = (uint32_t)DOSFS_FTOHS(dir->dir_clsno_lo);
                                    }
                                }
                                else
                                {
                                    status = F_ERR_INVALIDDIR;
                                }
                            }
                            else
                            {
                                status = F_ERR_INVALIDDIR;
                            }
                        }
                    }
                }
            }
        }
        while ((status == F_NO_ERROR) && ((cc == '/') || (cc == '\\')));
    }

    if (status == F_NO_ERROR)
    {
        *p_filename = filename;
        *p_clsno = clsno;
    }

    return status;
}

static int dosfs_path_find_file(dosfs_volume_t *volume, const char *filename, uint32_t *p_clsno, uint32_t *p_index, dosfs_dir_t **p_dir)
{
    int status = F_NO_ERROR;
    uint32_t clsno_d;

    status = dosfs_path_find_directory(volume, filename, &filename, &clsno_d);

    if (status == F_NO_ERROR)
    {
        status = dosfs_path_convert_filename(volume, filename, NULL);

        if (status == F_NO_ERROR)
        {
            status = dosfs_path_find_entry(volume, clsno_d, 0, 0, dosfs_path_find_callback_name, NULL, p_clsno, p_index, p_dir);
            
            if (status == F_NO_ERROR)
            {
                if (*p_dir == NULL)
                {
                    status = F_ERR_NOTFOUND;
                }
            }
        }
    }

    return status;
}

static int dosfs_path_find_pattern(dosfs_volume_t *volume, F_DIR *parent, char *pattern, char *filename, dosfs_dir_t **p_dir)
{
    int status = F_NO_ERROR;
    uint32_t clsno, index;
    dosfs_dir_t *dir;

    status = dosfs_path_find_entry(volume, parent->dir_clsno, parent->dir_index, 0, dosfs_path_find_callback_pattern, pattern, &clsno, &index, &dir);

    if (status == F_NO_ERROR)
    {
        if (dir != NULL)
        {
#if (DOSFS_CONFIG_VFAT_SUPPORTED == 1)
            /* It's possible to have a sfn_name only ("." and ".." for example).
             */
            if (volume->lfn_count)
            {
                filename = dosfs_name_uniname_to_cstring(volume->lfn_name, volume->lfn_count, filename, filename + F_MAXPATH);
            }
            else
#endif /* (DOSFS_CONFIG_VFAT_SUPPORTED == 1) */
            {
                filename = dosfs_name_dosname_to_cstring(dir->dir_name, dir->dir_nt_reserved, filename, filename + F_MAXPATH);
            }

            if (filename != NULL)
            {
                parent->dir_clsno = clsno;
#if (DOSFS_CONFIG_VFAT_SUPPORTED == 1)
                parent->dir_index = index + volume->dir_entries +1;
#else /* (DOSFS_CONFIG_VFAT_SUPPORTED == 1) */
                parent->dir_dir.index = index +1;
#endif /* (DOSFS_CONFIG_VFAT_SUPPORTED == 1) */

                *p_dir = dir;
            }
            else
            {
                status = F_ERR_TOOLONGNAME;
            }
        }
        else
        {
            status = F_ERR_NOTFOUND;
        }
    }

    return status;
}

static void dosfs_path_setup_entry(dosfs_volume_t *volume, const char *dosname, uint8_t attr, uint32_t first_clsno, uint16_t ctime, uint16_t cdate, dosfs_dir_t *dir)
{
    if (dosname)
    {
        memcpy(dir->dir_name, dosname, 11);
        
        dir->dir_nt_reserved = 0x00;
    }
    else
    {
        if (dir != &volume->dir)
        {
            memcpy(dir->dir_name, volume->dir.dir_name, 11);
        
            dir->dir_nt_reserved = volume->dir.dir_nt_reserved;
        }
    }

    dir->dir_attr = attr;
    
    if (volume->type != DOSFS_VOLUME_TYPE_FAT32)
    {
        dir->dir_crt_time_tenth = 0;
        dir->dir_crt_time = 0;
        dir->dir_crt_date = 0;
        dir->dir_acc_date = 0;
        dir->dir_clsno_hi = 0;
    }
    else
    {
        dir->dir_crt_time_tenth = 0;
        dir->dir_crt_time = ctime;
        dir->dir_crt_date = cdate;
        dir->dir_acc_date = 0;
        dir->dir_clsno_hi = DOSFS_HTOFS(first_clsno >> 16);
    }
    
    dir->dir_wrt_time = ctime;
    dir->dir_wrt_date = cdate;
    dir->dir_clsno_lo = DOSFS_HTOFS(first_clsno & 0xffff);
    dir->dir_file_size = DOSFS_HTOFL(0);
}

static int dosfs_path_create_entry(dosfs_volume_t *volume, uint32_t clsno_d, uint32_t clsno, uint32_t index, const char *dosname, uint8_t attr, uint32_t first_clsno, uint16_t ctime, uint16_t cdate)
{
    int status = F_NO_ERROR;
    uint32_t blkno, blkno_s, clsno_s;
#if (DOSFS_CONFIG_VFAT_SUPPORTED == 1)
    unsigned int chksum, mask, prefix;
    dosfs_dir_t *dir;
#if (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 0)
    uint32_t blkno_e;
    unsigned int sequence, offset, i, s, cc;
    dosfs_dir_t *dir_e;
#endif /* (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 0) */
#else  /* (DOSFS_CONFIG_VFAT_SUPPORTED == 1) */
#if (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 0)
    dosfs_dir_t *dir;
#endif /* (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 0) */
#endif /* (DOSFS_CONFIG_VFAT_SUPPORTED == 1) */
    dosfs_cache_entry_t *entry;

    if (index == 0x00010000)
    {
        status = F_ERR_NOMOREENTRY;
    }
    else
    {
#if (DOSFS_CONFIG_VFAT_SUPPORTED == 1)
        if (!dosname && ((volume->dir.dir_name[0] == '\0') || (volume->dir.dir_nt_reserved & DOSFS_DIR_TYPE_LOSSY)))
        {
            dosfs_name_uniname_to_dosname(volume->lfn_name, volume->lfn_count, volume->dir.dir_name, &prefix);

            volume->dir.dir_nt_reserved = 0;

