GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/dosfs_core.c
            if (prefix)
            {
                if (prefix > 6)
                {
                    prefix = 6;
                }
                
                /* First check unique entries of the <name>~[1-9].<ext> form.
                 */
                
                volume->dir.dir_name[prefix +0] = '~';
                
                mask = ((prefix +1) << 9);
                
                status = dosfs_path_find_entry(volume, clsno_d, 0, 0, dosfs_path_find_callback_unique, &mask, NULL, NULL, NULL);

                if (status == F_NO_ERROR)
                {
                    mask &= 0x000001ff;
                
                    if (mask != 0x000001ff)
                    {
                        volume->dir.dir_name[prefix +1] = '1';
                        
                        while (mask & 1)
                        {
                            volume->dir.dir_name[prefix +1] += 1;
                            mask >>= 1;
                        }
                    }
                }
            }
            else
            {
                mask = 0x000001ff;
            }

            if (status == F_NO_ERROR)
            {
                if (mask & 1)
                {
                    /* Then check unique entries of the <name><checksum>~1.<ext> form.
                     * Loop till a vaild unique name was found by stepping linear over
                     * "chksum".
                     */

                    if (prefix > 2)
                    {
                        prefix = 2;
                    }

                    chksum = dosfs_name_checksum_uniname(volume->lfn_name, volume->lfn_count);

                    do
                    {
                        volume->dir.dir_name[prefix +0] = dosfs_name_nibble_to_char_table[(chksum >> 12) & 15];
                        volume->dir.dir_name[prefix +1] = dosfs_name_nibble_to_char_table[(chksum >>  8) & 15];
                        volume->dir.dir_name[prefix +2] = dosfs_name_nibble_to_char_table[(chksum >>  4) & 15];
                        volume->dir.dir_name[prefix +3] = dosfs_name_nibble_to_char_table[(chksum >>  0) & 15];
                        volume->dir.dir_name[prefix +4] = '~';
                        volume->dir.dir_name[prefix +5] = '1';
                        
                        status = dosfs_path_find_entry(volume, clsno_d, 0, 0, dosfs_path_find_callback_unique, NULL, NULL, NULL, &dir);
                        
                        if (status == F_NO_ERROR) 
                        {
                            if (dir != NULL)
                            {
                                chksum += 1;
                            }
                        }
                    }
                    while ((status == F_NO_ERROR) && (dir != NULL));
                }
            }
        }
        else
        {
            volume->dir_entries = 0;
        }

        if (status == F_NO_ERROR)
#endif /* (DOSFS_CONFIG_VFAT_SUPPORTED == 1) */
        {
            if (index & 0x00020000)
            {
                /* The appending of a new cluster to a directory is a tad tricky. One has to allocate
                 * a cluster first, zero out it's contents, link the cluster to the end of the chain.
                 * Also the fat cache has to be flushed as it's the final operation of a sequence (see f_mkdir).
                 * The issue at hand is that if a new cluster is linked in that is not zeroed out, the
                 * directory is invalid. One the other hand, we cannot write a directory entry to a directory
                 * that has uncommited clusters in the fat cache.
                 */
                
                status = dosfs_cluster_chain_create(volume, DOSFS_CLSNO_NONE, 1, &clsno_s, NULL);
                
                if (status == F_NO_ERROR)
                {
                    blkno_s = DOSFS_CLSNO_TO_BLKNO(clsno_s);

                    status = dosfs_volume_zero(volume, blkno_s, volume->cls_blk_size, true);

                    if (status == F_NO_ERROR)
                    {
                        status = dosfs_cluster_write(volume, clsno, clsno_s, TRUE);

                        if (status == F_NO_ERROR)
                        {
                            index &= ~0x00020000;

                            if (!((index << DOSFS_DIR_SHIFT) & volume->cls_mask))
                            {
                                clsno = clsno_s;

                                /* If "index" is the first one of a new cluster,
                                 * one might as well avoid having to read the 
                                 * dir_cache entry.
                                 */
                                status = dosfs_dir_cache_zero(volume, blkno_s, &entry);
                            }
                        }
                    }
                }
            }

#if (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 0)
            /* For TRANSACTION_SAFE all of this happens throu dosfs_volume_record().
             */
        
            /* The fat cache needs to be flushed before any dir entry update.
             */
            status = dosfs_fat_cache_flush(volume);

            if (status == F_NO_ERROR)
            {
                if (clsno == DOSFS_CLSNO_NONE)
                {
                    clsno = volume->root_clsno;
                    blkno = volume->root_blkno + DOSFS_INDEX_TO_BLKCNT_ROOT(index);
#if (DOSFS_CONFIG_VFAT_SUPPORTED == 1)
                    blkno_e = volume->root_blkno + volume->root_blkcnt;
#endif /* (DOSFS_CONFIG_VFAT_SUPPORTED == 1) */
                }
                else
                {
                    blkno = DOSFS_CLSNO_TO_BLKNO(clsno) + DOSFS_INDEX_TO_BLKCNT(index);
#if (DOSFS_CONFIG_VFAT_SUPPORTED == 1)
                    blkno_e = blkno + volume->cls_blk_size;
#endif /* (DOSFS_CONFIG_VFAT_SUPPORTED == 1) */
                }
                
                status = dosfs_dir_cache_read(volume, blkno, &entry);

                if (status == F_NO_ERROR)
                {
                    dir = (dosfs_dir_t*)((void*)(entry->data + DOSFS_INDEX_TO_BLKOFS(index)));

#if (DOSFS_CONFIG_VFAT_SUPPORTED == 1)
                    if (volume->dir_entries != 0)
                    {
                        dir_e = (dosfs_dir_t*)((void*)(entry->data + DOSFS_BLK_SIZE));

                        sequence = 0x40 | volume->dir_entries;
                        chksum = dosfs_name_checksum_dosname(volume->dir.dir_name);

                        do
                        {
                            s = 0;
                            i = ((sequence & 0x1f) - 1) * 13;
                
