GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/dosfs_core.c
                            dir->dir_name[0] = sequence;
                            dir->dir_attr = DOSFS_DIR_ATTR_LONG_NAME;
                            dir->dir_nt_reserved = 0x00;
                            dir->dir_crt_time_tenth = chksum;
                            dir->dir_clsno_lo = 0x0000;
                
                            do
                            {
                                offset = dosfs_path_ldir_name_table[s++];
                    
                                if (i < volume->lfn_count)
                                {
                                    cc = volume->lfn_name[i];
                        
                                    ((uint8_t*)dir)[offset +0] = cc;
                                    ((uint8_t*)dir)[offset +1] = cc >> 8;
                                }
                                else
                                {
                                    if (i == volume->lfn_count)
                                    {
                                        ((uint8_t*)dir)[offset +0] = 0x00;
                                        ((uint8_t*)dir)[offset +1] = 0x00;
                                    }
                                    else
                                    {
                                        ((uint8_t*)dir)[offset +0] = 0xff;
                                        ((uint8_t*)dir)[offset +1] = 0xff;
                                    }
                                }

                                i++;
                            }
                            while (s < 13);
                
                            dir++;

                            if (dir == dir_e)
                            {
                                status = dosfs_dir_cache_write(volume);

                                blkno++;

                                if (blkno == blkno_e)
                                {
                                    status = dosfs_cluster_read(volume, clsno, &clsno);
                
                                    if (status == F_NO_ERROR)
                                    {
                                        blkno = DOSFS_CLSNO_TO_BLKNO(clsno);
                                        blkno_e = blkno + volume->cls_blk_size;
                                    }
                                }

                                if (status == F_NO_ERROR)
                                {
                                    status = dosfs_dir_cache_read(volume, blkno, &entry);

                                    if (status == F_NO_ERROR)
                                    {
                                        dir = (dosfs_dir_t*)((void*)(entry->data));
                                    }
                                }
                            }

                            sequence = (sequence & 0x1f) -1;
                        }
                        while ((status == F_NO_ERROR) && (sequence != 0));
                    }

                    if (status == F_NO_ERROR)
#endif /* (DOSFS_CONFIG_VFAT_SUPPORTED == 1) */
                    {
                        /* Special semantics if "first_clsno" == DOSFS_CLUSTER_END_OF_CHAIN. In that
                         * case volume->dir contains a valid template from f_rename, and
                         * "attr" gets merged with volume->dir.dir_nt_reserved (as this
                         * gets blown away by the name conversion).
                         */
                        if (first_clsno == DOSFS_CLSNO_END_OF_CHAIN)
                        {
                            memcpy(dir, &volume->dir, sizeof(dosfs_dir_t));

                            dir->dir_nt_reserved = ((volume->dir.dir_nt_reserved & (DOSFS_DIR_TYPE_LCASE_NAME | DOSFS_DIR_TYPE_LCASE_EXT)) |
                                                    (attr & ~(DOSFS_DIR_TYPE_LCASE_NAME | DOSFS_DIR_TYPE_LCASE_EXT)));
                        }
                        else
                        {
                            dosfs_path_setup_entry(volume, dosname, attr, first_clsno, ctime, cdate, dir);
                        }

                        status = dosfs_dir_cache_write(volume);
                    }
                }
            }

#else /* (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 0) */
        
            if (status == F_NO_ERROR)
            {
                /* Special semantics if "first_clsno" == DOSFS_CLUSTER_END_OF_CHAIN. In that
                 * case volume->dir contains a valid template from f_rename, and
                 * "attr" gets merged with volume->dir.dir_nt_reserved (as this
                 * gets blown away by the name conversion).
                 */
                if (first_clsno == DOSFS_CLSNO_END_OF_CHAIN)
                {
                    volume->dir.dir_nt_reserved = ((volume->dir.dir_nt_reserved & (DOSFS_DIR_TYPE_LCASE_NAME | DOSFS_DIR_TYPE_LCASE_EXT)) |
                                                   (attr & ~(DOSFS_DIR_TYPE_LCASE_NAME | DOSFS_DIR_TYPE_LCASE_EXT)));
                }
                else
                {
                    dosfs_path_setup_entry(volume, dosname, attr, first_clsno, ctime, cdate, &volume->dir);
                }

                volume->dir_flags |= DOSFS_DIR_FLAG_CREATE_ENTRY;
                volume->dir_clsno = clsno;
                volume->dir_index = index;
                volume->dot_clsno = clsno_d;

                status = dosfs_volume_record(volume);
            }
#endif /* (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 0) */
        }
    }

    return status;
}

/* To destroy a directory/file, first the directory entry is deleted. Then the assocociated
 * cluster chain is freed.
 */

#if (DOSFS_CONFIG_VFAT_SUPPORTED == 1)
static int dosfs_path_destroy_entry(dosfs_volume_t *volume, uint32_t clsno, uint32_t index, uint32_t entries, uint32_t first_clsno)
#else /* (DOSFS_CONFIG_VFAT_SUPPORTED == 1) */
static int dosfs_path_destroy_entry(dosfs_volume_t *volume, uint32_t clsno, uint32_t index, uint32_t first_clsno)
#endif /* (DOSFS_CONFIG_VFAT_SUPPORTED == 1) */
{
    int status = F_NO_ERROR;
#if (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 0)
#if (DOSFS_CONFIG_VFAT_SUPPORTED == 1)
    unsigned int sequence;
    uint32_t blkno, blkno_e;
    dosfs_dir_t *dir, *dir_e;
#else /* (DOSFS_CONFIG_VFAT_SUPPORTED == 1) */
    uint32_t blkno;
    dosfs_dir_t *dir;
#endif /* (DOSFS_CONFIG_VFAT_SUPPORTED == 1) */
    dosfs_cache_entry_t *entry;

    if (clsno == DOSFS_CLSNO_NONE)
    {
        clsno = volume->root_clsno;
        blkno = volume->root_blkno + DOSFS_INDEX_TO_BLKCNT_ROOT(index);
#if (DOSFS_CONFIG_VFAT_SUPPORTED == 1)
        blkno_e = volume->root_blkno + volume->root_blkcnt;
#endif /* (DOSFS_CONFIG_VFAT_SUPPORTED == 1) */
    }
    else
    {
        blkno = DOSFS_CLSNO_TO_BLKNO(clsno) + DOSFS_INDEX_TO_BLKCNT(index);
#if (DOSFS_CONFIG_VFAT_SUPPORTED == 1)
        blkno_e = DOSFS_CLSNO_TO_BLKNO(clsno) + volume->cls_blk_size;
#endif /* (DOSFS_CONFIG_VFAT_SUPPORTED == 1) */
    }
    
    status = dosfs_dir_cache_read(volume, blkno, &entry);

    if (status == F_NO_ERROR)
    {
        dir = (dosfs_dir_t*)((void*)(entry->data + DOSFS_INDEX_TO_BLKOFS(index)));

#if (DOSFS_CONFIG_VFAT_SUPPORTED == 1)
        if (entries != 0)
        {
            sequence = entries;

            dir_e = (dosfs_dir_t*)((void*)(entry->data + DOSFS_BLK_SIZE));

            do
            {
                dir->dir_name[0] = 0xe5;
                
