GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/dosfs_core.c
                dir++;
                
                if (dir == dir_e)
                {
                    status = dosfs_dir_cache_write(volume);

                    blkno++;

                    if (blkno == blkno_e)
                    {
                        status = dosfs_cluster_read(volume, clsno, &clsno);
                
                        if (status == F_NO_ERROR)
                        {
                            blkno = DOSFS_CLSNO_TO_BLKNO(clsno);
                            blkno_e = blkno + volume->cls_blk_size;
                        }
                    }

                    if (status == F_NO_ERROR)
                    {
                        status = dosfs_dir_cache_read(volume, blkno, &entry);

                        if (status == F_NO_ERROR)
                        {
                            dir = (dosfs_dir_t*)((void*)(entry->data));
                        }
                    }
                }
                
                sequence--;
            }
            while ((status == F_NO_ERROR) && (sequence != 0));
        }

        if (status == F_NO_ERROR)
#endif /* (DOSFS_CONFIG_VFAT_SUPPORTED == 1) */
        {
            dir->dir_name[0] = 0xe5;
        
            status = dosfs_dir_cache_write(volume);
        
            if (status == F_NO_ERROR)
            {
                if (first_clsno != DOSFS_CLSNO_NONE)
                {
                    status = dosfs_cluster_chain_destroy(volume, first_clsno, DOSFS_CLSNO_FREE);
                }
            }
        }


        if (status == F_NO_ERROR)
        {
            /* The post condition for dosfs_path_destroy_entry is that the fat cache
             * is flushed, so unconditionally do it here.
             */
            status = dosfs_fat_cache_flush(volume);
        }
    }

#else /* (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 0) */

    if (first_clsno != DOSFS_CLSNO_NONE)
    {
        status = dosfs_cluster_chain_destroy(volume, first_clsno, DOSFS_CLSNO_FREE);
    }

    if (status == F_NO_ERROR)
    {
        volume->dir_flags |= DOSFS_DIR_FLAG_DESTROY_ENTRY;
        volume->del_clsno = clsno;
        volume->del_index = index;
#if (DOSFS_CONFIG_VFAT_SUPPORTED == 1)
        volume->del_entries = entries;
#endif /* (DOSFS_CONFIG_VFAT_SUPPORTED == 1) */

        status = dosfs_volume_record(volume);
    }

#endif /* (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 0) */


    return status;
}


/*****************************************************************************************************************************************/


static dosfs_file_t * dosfs_file_enumerate(dosfs_volume_t *volume, dosfs_file_t *file, uint32_t clsno, uint32_t index)
{
    if (file)
    {
        file = file->next;
    }
    else
    {
        file = volume->files;
    }

    for (; file; file = file->next)
    {
        if ((file->dir_clsno == clsno) && (file->dir_index == index))
        {
            break;
        }
    }

    return file;
}

static int dosfs_file_sync(dosfs_volume_t *volume, dosfs_file_t *file, int access, int modify, uint32_t first_clsno, uint32_t length)
{
    int status = F_NO_ERROR;
    uint16_t ctime, cdate;
#if (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 0)
    uint32_t clsno, blkno, index;
    dosfs_cache_entry_t *entry;
    dosfs_dir_t *dir;
#endif /* (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 0) */

#if (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 1)

    volume->dir.dir_clsno_lo = DOSFS_HTOFS(first_clsno & 0xffff);
    volume->dir.dir_file_size = DOSFS_HTOFL(length);
    
    if (volume->type == DOSFS_VOLUME_TYPE_FAT32)
    {
        volume->dir.dir_clsno_hi = DOSFS_HTOFS(first_clsno >> 16);
    }
    
    volume->dir_flags |= DOSFS_DIR_FLAG_SYNC_ENTRY;
    
    if (access || modify)
    {
#if defined(DOSFS_PORT_CORE_TIMEDATE)
        DOSFS_PORT_CORE_TIMEDATE(&ctime, &cdate);
#else /* DOSFS_PORT_CORE_TIMEDATE */
        ctime = 0;
        cdate = 0;
#endif /* DOSFS_PORT_CORE_TIMEDATE */

        if (access)
        {
            if (volume->type == DOSFS_VOLUME_TYPE_FAT32)
            {
                volume->dir.dir_acc_date = DOSFS_HTOFS(cdate);
                    
                volume->dir_flags |= DOSFS_DIR_FLAG_ACCESS_ENTRY;
            }
        }

        if (modify)
        {
            volume->dir.dir_wrt_time = DOSFS_HTOFS(ctime);
            volume->dir.dir_wrt_date = DOSFS_HTOFS(cdate);

            volume->dir_flags |= DOSFS_DIR_FLAG_MODIFY_ENTRY;
        }
    }
        
    volume->dir_clsno = file->dir_clsno;
    volume->dir_index = file->dir_index;
#if (DOSFS_CONFIG_VFAT_SUPPORTED == 1)
    volume->dir_entries = 0;
#endif /* (DOSFS_CONFIG_VFAT_SUPPORTED == 1) */

    status = dosfs_volume_record(volume);

#else /* (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 1) */

    status = dosfs_fat_cache_flush(volume);

    if (status == F_NO_ERROR)
    {
        clsno = file->dir_clsno;
        index = file->dir_index;

        if (clsno == DOSFS_CLSNO_NONE)
        {
            blkno = volume->root_blkno + DOSFS_INDEX_TO_BLKCNT_ROOT(index);
        }
        else
        {
            blkno = DOSFS_CLSNO_TO_BLKNO(clsno) + DOSFS_INDEX_TO_BLKCNT(index);
        }
    
        status = dosfs_dir_cache_read(volume, blkno, &entry);
    
        if (status == F_NO_ERROR)
        {
            dir = (dosfs_dir_t*)((void*)(entry->data + DOSFS_INDEX_TO_BLKOFS(index)));

            dir->dir_clsno_lo = DOSFS_HTOFS(first_clsno & 0xffff);
            dir->dir_file_size = DOSFS_HTOFL(length);
        
            if (volume->type == DOSFS_VOLUME_TYPE_FAT32)
            {
                dir->dir_clsno_hi = DOSFS_HTOFS(first_clsno >> 16);
            }
        
            if (access || modify)
            {
#if defined(DOSFS_PORT_CORE_TIMEDATE)
                DOSFS_PORT_CORE_TIMEDATE(&ctime, &cdate);
#else /* DOSFS_PORT_CORE_TIMEDATE */
                ctime = 0;
                cdate = 0;
#endif /* DOSFS_PORT_CORE_TIMEDATE */

                if (access)
                {
                    if (volume->type == DOSFS_VOLUME_TYPE_FAT32)
                    {
                        dir->dir_acc_date = DOSFS_HTOFS(cdate);
                    }
                }

                if (modify)
                {
                    dir->dir_attr |= DOSFS_DIR_ATTR_ARCHIVE;
                    dir->dir_wrt_time = DOSFS_HTOFS(ctime);
                    dir->dir_wrt_date = DOSFS_HTOFS(cdate);
                }
            }

            status = dosfs_dir_cache_write(volume);

            if (status == F_NO_ERROR)
            {
                status = dosfs_volume_clean(volume, status);
            }
        }
    }
#endif /* (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 1) */

