GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/dosfs_core.c
    return status;
}


static int dosfs_file_flush(dosfs_volume_t *volume, dosfs_file_t *file, int close)
{
    int status = F_NO_ERROR;
    dosfs_device_t *device;

    device = DOSFS_VOLUME_DEVICE(volume);

    if (volume->state == DOSFS_VOLUME_STATE_MOUNTED)
    {
        /* The data cache is first flushed and outstanding disk operations
         * are finished. Then however the fat cache flush and  the directory updates
         * are only performed uncoditionally irregardless of whether there were
         * outstanding errors.
         */

        status = dosfs_data_cache_flush(volume, file);

        if (status == F_NO_ERROR)
        {
            status = (*device->interface->sync)(device->context);
        }

        if (file->status == F_NO_ERROR)
        {
            file->status = status;
        }

        if (close || (file->flags & (DOSFS_FILE_FLAG_DIR_MODIFIED | DOSFS_FILE_FLAG_DATA_MODIFIED)))
        {
            status = dosfs_file_sync(volume, file, close, (file->flags & (DOSFS_FILE_FLAG_DIR_MODIFIED | DOSFS_FILE_FLAG_DATA_MODIFIED)), file->first_clsno, file->length);
        }
    }

    if (status == F_NO_ERROR)
    {
        file->flags &= ~(DOSFS_FILE_FLAG_DATA_MODIFIED | DOSFS_FILE_FLAG_DIR_MODIFIED);
    }

    return status;
}

static int dosfs_file_seek(dosfs_volume_t *volume, dosfs_file_t *file, uint32_t position)
{
    int status = F_NO_ERROR;
    uint32_t clsno, clscnt, offset;

    if ((file->mode & DOSFS_FILE_MODE_WRITE) && ((file->position & ~DOSFS_BLK_MASK) != (position & ~DOSFS_BLK_MASK)))
    {
        status = dosfs_data_cache_flush(volume, file);
    }

    if (status == F_NO_ERROR)
    {
        if (position == 0)
        {
            /* A seek to position 0 (i.e. rewind) always succeeds.
             */
            if (file->first_clsno != DOSFS_CLSNO_NONE)
            {
                file->clsno = file->first_clsno;
                file->blkno = DOSFS_CLSNO_TO_BLKNO(file->clsno);
                file->blkno_e = file->blkno + volume->cls_blk_size;
            }
        
            file->position = 0;
        }
        else
        {
            if (file->position != position)
            {
                if (file->length == 0)
                {
                    /* Any seek for file->length == 0 always succeeds.
                     */
                    file->position = position;
                }
                else
                {
                    if (file->first_clsno == DOSFS_CLSNO_NONE)
                    {
                        /* A seek to any non-zero position with no
                         * cluster in the chain is an error.
                         */
                        status = F_ERR_EOF;
                    }
                    else
                    {
                        if (position < file->length)
                        {
                            offset = position;
                        }
                        else
                        {
                            offset = file->length;
                        }

                        if (status == F_NO_ERROR)
                        {
#if (DOSFS_CONFIG_CONTIGUOUS_SUPPORTED == 1)
                            if (file->flags & DOSFS_FILE_FLAG_CONTIGUOUS)
                            {
                                clsno = file->first_clsno + DOSFS_OFFSET_TO_CLSCNT(offset -1);
                            }
                            else
#endif /* (DOSFS_CONFIG_CONTIGUOUS_SUPPORTED == 1) */
                            {
                                if ((offset == file->length) && (file->last_clsno != DOSFS_CLSNO_NONE))
                                {
                                    clsno = file->last_clsno;
                                }
                                else
                                {
                                    if ((file->position == 0) || (file->position > offset))
                                    {
                                        clsno = file->first_clsno;
                                        clscnt = DOSFS_OFFSET_TO_CLSCNT(offset -1);
                                    }
                                    else
                                    {
                                        clsno = file->clsno;
                                        clscnt = DOSFS_OFFSET_TO_CLSCNT(offset -1) - DOSFS_OFFSET_TO_CLSCNT(file->position -1);
                                    }

                                    if (clscnt != 0)
                                    {
                                        status = dosfs_cluster_chain_seek(volume, clsno, clscnt, &clsno);
                                    }
                                }
                            }
                        
                            if (status == F_NO_ERROR)
                            {
                                file->position = position;
                                file->clsno = clsno;

                                if (!(offset & volume->cls_mask))
                                {
                                    file->blkno = DOSFS_CLSNO_TO_BLKNO(clsno) + volume->cls_blk_size;
                                    file->blkno_e = file->blkno;
                                }
                                else
                                {
                                    file->blkno = DOSFS_CLSNO_TO_BLKNO(clsno) + DOSFS_OFFSET_TO_BLKCNT(offset);
                                    file->blkno_e = DOSFS_CLSNO_TO_BLKNO(clsno) + volume->cls_blk_size;
                                }

                                if (offset == file->length)
                                {
                                    file->last_clsno = clsno;
                                }
                            }
                        }
                    }
                }
            }
        }
    }

    return status;
}

static int dosfs_file_shrink(dosfs_volume_t *volume, dosfs_file_t *file)
{
    int status = F_NO_ERROR;

    if (file->position == 0)
    {
        if (file->first_clsno != DOSFS_CLSNO_NONE)
        {
#if (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 1)

            /* Defer the deletion of file->first_clsno to the next dosfs_file_flush(),
             * so that file->first_clsno ends up on the disk before the cluster is made
             * available again.
             */
                   
            status = dosfs_cluster_chain_destroy(volume, file->first_clsno, DOSFS_CLSNO_FREE);

            if (status == F_NO_ERROR)
            {
                status = dosfs_file_sync(volume, file, FALSE, FALSE, DOSFS_CLSNO_NONE, file->length);
            }

#else /* (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 1) */

            /* To be on the safe side, the directory entry on the disk is updated first,
             * so that "file->length" is always correct, and in case the whole chain gets
             * deleted "file->first_clsno" on disk is properly zeroed out.
             */

            status = dosfs_file_sync(volume, file, FALSE, FALSE, DOSFS_CLSNO_NONE, file->length);

            if (status == F_NO_ERROR)
            {
                status = dosfs_volume_dirty(volume);

                if (status == F_NO_ERROR)
                {
                    status = dosfs_cluster_chain_destroy(volume, file->first_clsno, DOSFS_CLSNO_FREE);
                }
            }
#endif /* (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 1) */
        }

        if (status == F_NO_ERROR)
        {
            file->first_clsno = DOSFS_CLSNO_NONE;
            file->last_clsno = DOSFS_CLSNO_NONE;
                
