GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/dosfs_core.c
            /* file->position is 0 here, but clsno/blkno/blkno_e
             * point to the first cluster, which just got deleted.
             */
            file->clsno = DOSFS_CLSNO_NONE;
            file->blkno = DOSFS_BLKNO_INVALID;
            file->blkno_e = DOSFS_BLKNO_INVALID;
        }
    }
    else
    {
        if (file->clsno != DOSFS_CLSNO_NONE)
        {
#if (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 0)
            status = dosfs_volume_dirty(volume);

            if (status == F_NO_ERROR)
#endif /* (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 0) */
            {
                status = dosfs_cluster_chain_destroy(volume, file->clsno, DOSFS_CLSNO_END_OF_CHAIN);
                
                if (status == F_NO_ERROR)
                {
                    file->last_clsno = file->clsno;
                }
            }
        }
        else
        {
            status = F_ERR_EOF;
        }
    }

    if (status == F_NO_ERROR)
    {
        if (file->length != file->position)
        {
            file->flags |= DOSFS_FILE_FLAG_DIR_MODIFIED;
            file->length = file->position;
        }

        file->flags |= DOSFS_FILE_FLAG_END_OF_CHAIN;

#if (DOSFS_CONFIG_CONTIGUOUS_SUPPORTED == 1)
        if (file->flags & DOSFS_FILE_FLAG_CONTIGUOUS)
        {
            if (file->length >= (DOSFS_FILE_SIZE_MAX & ~volume->cls_mask))
            {
                file->size = DOSFS_FILE_SIZE_MAX;
            }
            else
            {
                file->size = (file->length + volume->cls_mask) & ~volume->cls_mask;
            }
        }
#endif /* (DOSFS_CONFIG_CONTIGUOUS_SUPPORTED == 1) */
    }

    if (file->status == F_NO_ERROR)
    {
        file->status = status;
    }

    return status;
}

static int dosfs_file_extend(dosfs_volume_t *volume, dosfs_file_t *file, uint32_t length)
{
    int status = F_NO_ERROR;
    uint32_t clsno, clscnt, clsno_a, clsno_l, clsno_n, clsdata, blkno, blkno_e, blkcnt, count, size, position, offset, length_o;
    dosfs_cache_entry_t *entry;

    /* Compute below:
     *
     * clsno      file->last_clsno or DOSFS_CLSNO_NONE (corresponding to file->length)
     * clsno_l    file->last_clsno (corresponding to length)
     * clsno_n    next cluster after clsno (or first allocated)
     */

    length_o = file->length;

#if (DOSFS_CONFIG_CONTIGUOUS_SUPPORTED == 1)
    if (file->flags & DOSFS_FILE_FLAG_CONTIGUOUS)
    {
        if (length_o == 0)
        {
            clsno = file->first_clsno;
            clsno_n = clsno;
        }
        else
        {
            clsno = file->first_clsno + DOSFS_OFFSET_TO_CLSCNT(length_o -1);
            clsno_n = clsno +1;
        }

        clsno_l = file->first_clsno + DOSFS_OFFSET_TO_CLSCNT(length -1);
    }
    else
#endif /* (DOSFS_CONFIG_CONTIGUOUS_SUPPORTED == 1) */
    {
        if (length_o == 0)
        {
            clsno = file->first_clsno;
        }
        else
        {
            if (file->first_clsno == DOSFS_CLSNO_NONE)
            {
                clsno = DOSFS_CLSNO_NONE;
                length_o = 0;
            }
            else
            {
                if (file->last_clsno != DOSFS_CLSNO_NONE)
                {
                    clsno = file->last_clsno;
                }
                else
                {
                    if (!file->position || (file->position > length_o))
                    {
                        clsno = file->first_clsno;
                        clscnt = DOSFS_OFFSET_TO_CLSCNT(length_o -1);
                    }
                    else
                    {
                        clsno = file->clsno;
                        clscnt = DOSFS_OFFSET_TO_CLSCNT(length_o -1) - DOSFS_OFFSET_TO_CLSCNT(file->position -1);
                    }
                    
                    if (clscnt != 0)
                    {
                        status = dosfs_cluster_chain_seek(volume, clsno, clscnt, &clsno);
                    }
                }

                if (status == F_NO_ERROR)
                {
                    file->last_clsno = clsno;
                }
            }
        }

        if (status == F_NO_ERROR)
        {
            if ((length_o == 0) || (clsno == DOSFS_CLSNO_NONE))
            {
                clscnt = DOSFS_SIZE_TO_CLSCNT(length);
            }
            else
            {
                clscnt = DOSFS_SIZE_TO_CLSCNT(length) - DOSFS_SIZE_TO_CLSCNT(length_o);
            }
            
            clsno_l = clsno;
            clsno_n = DOSFS_CLSNO_NONE;

            if (clscnt)
            {
                /* While the last cluster had not been seen yet, step throu the trailing 
                 * list and make use of what had been there already.
                 *
                 * Normally this should only set DOSFS_FILE_FLAG_END_OF_CHAIN, but there might
                 * be dangling, orphaned entries which one might make use of to begin with.
                 *
                 * N.b. file_first_clsno == DOSFS_CLSNO_NONE implies DOSFS_FILE_FLAG_END_OF_CHAIN 
                 * set.
                 */

                if (!(file->flags & DOSFS_FILE_FLAG_END_OF_CHAIN))
                {
                    do
                    {
                        status = dosfs_cluster_read(volume, clsno_l, &clsdata);
                        
                        if (status == F_NO_ERROR)
                        {
                            if (clsdata >= DOSFS_CLSNO_LAST)
                            {
                                file->flags |= DOSFS_FILE_FLAG_END_OF_CHAIN;
                            }
                            else
                            {
                                if ((clsdata >= 2) && (clsdata <= volume->last_clsno))
                                {
                                    if (clsno_n == DOSFS_CLSNO_NONE)
                                    {
                                        clsno_n = clsdata;
                                    }

                                    clsno_l = clsdata;
                                    clscnt--;
                                }
                                else
                                {
                                    status = F_ERR_EOF;
                                }
                            }
                        }
                    }
                    while ((status == F_NO_ERROR) && !(file->flags & DOSFS_FILE_FLAG_END_OF_CHAIN) && (clscnt != 0));
                }

                if (status == F_NO_ERROR)
                {
                    if (clscnt)
                    {
#if (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 0)
                        status = dosfs_volume_dirty(volume);
                        
                        if (status == F_NO_ERROR)
#endif /* (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 0) */
                        {
#if (DOSFS_CONFIG_SEQUENTIAL_SUPPORTED == 1)
                            if (file->mode & DOSFS_FILE_MODE_SEQUENTIAL)
                            {
                                status = dosfs_cluster_chain_create_sequential(volume, clsno_l, clscnt, &clsno_a, &clsno_l);
                            }
                            else
#endif /* (DOSFS_CONFIG_SEQUENTIAL_SUPPORTED == 1) */
                            {
                                status = dosfs_cluster_chain_create(volume, clsno_l, clscnt, &clsno_a, &clsno_l);
                            }

                            if (clsno_n == DOSFS_CLSNO_NONE)
                            {
                                clsno_n = clsno_a;
                            }
                        }
                    }
                }

                if (status == F_NO_ERROR)
                {
                    if (file->first_clsno == DOSFS_CLSNO_NONE)
                    {
                        file->first_clsno = clsno_n;
                        
                        file->clsno = clsno_n;
                        file->blkno = DOSFS_CLSNO_TO_BLKNO(clsno_n);
                        file->blkno_e = file->blkno + volume->cls_blk_size;

                        /* If a new cluster chain gets created, the dir entry needs to be updated to
                         * not lose the cluster chain.
                         */
                        
