GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/dosfs_core.c
                        status = dosfs_file_sync(volume, file, FALSE, FALSE, file->first_clsno, file->length);
                    }
                }
            }
        }
    }

    if (status == F_NO_ERROR)
    {
        file->flags |= DOSFS_FILE_FLAG_DIR_MODIFIED;
        file->last_clsno = clsno_l;
        file->length = length;

        if (file->position > length_o)
        {
            position = length_o;
            offset = (length_o + DOSFS_BLK_MASK) & ~DOSFS_BLK_MASK;
            count  = file->position - length_o;

            if (!(position & volume->cls_mask))
            {
                /* If the old file->length was on a cluster boundary, then the 
                 * old cached file data should be flushed to get a nice sequential
                 * write sequence.
                 */
                status = dosfs_data_cache_flush(volume, file);

                if (status == F_NO_ERROR)
                {
                    clsno = clsno_n;
                }
            }

            if (status == F_NO_ERROR)
            {
                blkno = DOSFS_CLSNO_TO_BLKNO(clsno) + DOSFS_OFFSET_TO_BLKCNT(position);
                blkno_e = DOSFS_CLSNO_TO_BLKNO(clsno) + volume->cls_blk_size;

                if (((position & DOSFS_BLK_MASK) + count) < DOSFS_BLK_SIZE)
                {
                    /* All data is within one block, simply go throu the cache.
                     * If the block is beyond the old file->length, is has to 
                     * be all zeros. Otherwise got throu the normal cache.
                     */
                
                    if (position >= offset)
                    {
                        status = dosfs_data_cache_zero(volume, file, blkno, &entry);
                    }
                    else
                    {
                        status = dosfs_data_cache_read(volume, file, blkno, &entry);
                    
                        if (status == F_NO_ERROR)
                        {
                            memset(entry->data + (position & DOSFS_BLK_MASK), 0, count);
                        }
                    }
                
                    if (status == F_NO_ERROR)
                    {
                        dosfs_data_cache_modify(volume, file);
                    
                        position += count;
                        count = 0;
                    
                        if (!(position & DOSFS_BLK_MASK))
                        {
                            blkno++;
                        }
                    }
                }
                else
                {
                    if (position & DOSFS_BLK_MASK)
                    {
                        size = (DOSFS_BLK_SIZE - (position & DOSFS_BLK_MASK));

                        if (position >= offset)
                        {
                            status = dosfs_data_cache_zero(volume, file, blkno, &entry);
                        }
                        else
                        { 
                            status = dosfs_data_cache_read(volume, file, blkno, &entry);
                        
                            if (status == F_NO_ERROR)
                            {
                                memset(entry->data + (DOSFS_BLK_SIZE - size), 0, size);
                            }
                        }
                    
                        if (status == F_NO_ERROR)
                        {
                            dosfs_data_cache_modify(volume, file);

                            status = dosfs_data_cache_write(volume, file);
                        
                            if (status == F_NO_ERROR)
                            {
                                position += size;
                                count -= size;
                            
                                blkno++;
                            }
                        }
                    }

                    while ((status == F_NO_ERROR) && (count != 0))
                    {
                        if (blkno == blkno_e)
                        {
                            status = dosfs_data_cache_flush(volume, file);

                            if (status == F_NO_ERROR)
                            {
#if (DOSFS_CONFIG_CONTIGUOUS_SUPPORTED == 1)
                                if (file->flags & DOSFS_FILE_FLAG_CONTIGUOUS)
                                {
                                    clsno++;
                                    blkno_e += volume->cls_blk_size;
                                }
                                else
#endif /* (DOSFS_CONFIG_CONTIGUOUS_SUPPORTED == 1) */
                                {
                                    status = dosfs_cluster_chain_seek(volume, clsno, 1, &clsno);
                                        
                                    if (status == F_NO_ERROR)
                                    {
                                        blkno = DOSFS_CLSNO_TO_BLKNO(clsno);
                                        blkno_e = blkno + volume->cls_blk_size;
                                    }
                                }
                            }
                        }
                        
                        if (status == F_NO_ERROR)
                        {
                            if (count < DOSFS_BLK_SIZE)
                            {
                                status = dosfs_data_cache_zero(volume, file, blkno, &entry);
                            
                                if (status == F_NO_ERROR)
                                {
                                    dosfs_data_cache_modify(volume, file);
                                
                                    position += count;
                                    count = 0;
                                }
                            }
                            else
                            {
                                size = volume->cls_size - (position & volume->cls_mask);
                            
                                if (size > count)
                                {
                                    size = count & ~DOSFS_BLK_MASK;
                                }
                            
                                blkcnt = size >> DOSFS_BLK_SHIFT;
                            
                                status = dosfs_data_cache_invalidate(volume, file, blkno, blkcnt);
                            
                                if (status == F_NO_ERROR)
                                {
                                    status = dosfs_volume_zero(volume, blkno, blkcnt, false);

                                    if (status == F_NO_ERROR)
                                    {
                                        position += size;
                                        count -= size;
                                    
                                        blkno += blkcnt;
                                    }
                                }
                            }
                        }
                    }
                }
            }

            if (status == F_NO_ERROR)
            {
                file->clsno = clsno;
                file->blkno = blkno;
                file->blkno_e = blkno_e;
            }
        }
    }

