GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/dosfs_core.c
    if (file->status == F_NO_ERROR)
    {
        file->status = status;
    }

    return status;
}

#if (DOSFS_CONFIG_CONTIGUOUS_SUPPORTED == 1)
static int dosfs_file_reserve(dosfs_volume_t *volume, dosfs_file_t *file, uint32_t size)
{
    int status = F_NO_ERROR;
    dosfs_device_t *device;
    uint32_t clsno_a, clscnt;

    device = DOSFS_VOLUME_DEVICE(volume);

    clscnt = DOSFS_SIZE_TO_CLSCNT(size);
    clscnt = ((((clscnt << volume->cls_blk_shift) + (volume->au_size -1)) / volume->au_size) * volume->au_size) >> volume->cls_blk_shift;

#if (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 0)
    status = dosfs_volume_dirty(volume);

    if (status == F_NO_ERROR)
#endif /* (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 0) */
    {
        status = dosfs_cluster_chain_create_contiguous(volume, clscnt, &clsno_a);

        if (status == F_NO_ERROR)
        {
            file->flags |= DOSFS_FILE_FLAG_CONTIGUOUS;
            file->size = size;
            file->first_clsno = clsno_a;
        
            file->clsno = clsno_a;
            file->blkno = DOSFS_CLSNO_TO_BLKNO(clsno_a);
            file->blkno_e = file->blkno + volume->cls_blk_size;

            /* If a new cluster chain gets created, the dir entry needs to be updated to
             * not lose the cluster chain.
             */
            
            status = dosfs_file_sync(volume, file, FALSE, FALSE, file->first_clsno, file->length);

            if (status == F_NO_ERROR)
            {
                status = (device->interface->erase)(device->context, file->blkno, (clscnt << volume->cls_blk_shift));
            }
        }
    }

    return status;
}

#endif /* (DOSFS_CONFIG_CONTIGUOUS_SUPPORTED == 1) */

static int dosfs_file_open(dosfs_volume_t *volume, dosfs_file_t *file, const char *filename, uint32_t mode, uint32_t size)
{
    int status = F_NO_ERROR;
    uint32_t clsno, clsno_d, index, count;
    uint16_t ctime, cdate;
#if (DOSFS_CONFIG_CONTIGUOUS_SUPPORTED == 1)
    uint32_t clscnt, clsdata;
#endif /* (DOSFS_CONFIG_CONTIGUOUS_SUPPORTED == 1) */
    dosfs_file_t *file_o;
    dosfs_dir_t *dir;

    file->mode = 0;
    file->flags = 0;

    if ((mode & DOSFS_FILE_MODE_WRITE) && (volume->flags & DOSFS_VOLUME_FLAG_WRITE_PROTECTED))
    {
        status = F_ERR_WRITEPROTECT;
    }
    else
    {
        status = dosfs_path_find_directory(volume, filename, &filename, &clsno_d);
        
        if (status == F_NO_ERROR)
        {
            status = dosfs_path_convert_filename(volume, filename, NULL);
            
            if (status == F_NO_ERROR)
            {
                if (mode & DOSFS_FILE_MODE_CREATE)
                {
#if (DOSFS_CONFIG_VFAT_SUPPORTED == 1)
                    if ((volume->dir.dir_name[0] == '\0') || (volume->dir.dir_nt_reserved & DOSFS_DIR_TYPE_LOSSY))
                    {
                        count = 1 + volume->dir_entries;
                    }
                    else
#endif /* (DOSFS_CONFIG_VFAT_SUPPORTED == 1) */
                    {
                        count = 1;
                    }
                }
                else
                {
                    count = 0;
                }
                
                status = dosfs_path_find_entry(volume, clsno_d, 0, count, dosfs_path_find_callback_name, NULL, &clsno, &index, &dir);
                
                if (status == F_NO_ERROR)
                {
                    if (dir != NULL)
                    {
                        if (dir->dir_attr & DOSFS_DIR_ATTR_DIRECTORY)
                        {
                            status = F_ERR_INVALIDDIR;
                        }
                        else
                        {
                            if ((mode & DOSFS_FILE_MODE_WRITE) && (dir->dir_attr & DOSFS_DIR_ATTR_READ_ONLY))
                            {
                                status = F_ERR_ACCESSDENIED;
                            }
#if (DOSFS_CONFIG_VFAT_SUPPORTED == 1)
                            else
                            {
                                /* Advance to primary dir entry. */
                                index += volume->dir_entries;
                            }
#endif /* (DOSFS_CONFIG_VFAT_SUPPORTED == 1) */
                            
                            file->dir_clsno = clsno;
                            file->dir_index = index;
                            file->length = DOSFS_FTOHL(dir->dir_file_size);
                            
                            if (volume->type == DOSFS_VOLUME_TYPE_FAT32)
                            {
                                file->first_clsno = ((uint32_t)DOSFS_FTOHS(dir->dir_clsno_hi) << 16) | (uint32_t)DOSFS_FTOHS(dir->dir_clsno_lo);
                            }
                            else
                            {
                                file->first_clsno = (uint32_t)DOSFS_FTOHS(dir->dir_clsno_lo);
                            }
                        }
                    }
                    else
                    {
                        if (mode & DOSFS_FILE_MODE_CREATE)
                        {
#if defined(DOSFS_PORT_CORE_TIMEDATE)
                            DOSFS_PORT_CORE_TIMEDATE(&ctime, &cdate);
#else /* DOSFS_PORT_CORE_TIMEDATE */
                            ctime = 0;
                            cdate = 0;
#endif /* DOSFS_PORT_CORE_TIMEDATE */
                            
                            status = dosfs_path_create_entry(volume, clsno_d, clsno, index, NULL, 0, DOSFS_CLSNO_NONE, ctime, cdate);
                            
                            if (status == F_NO_ERROR)
                            {
#if (DOSFS_CONFIG_VFAT_SUPPORTED == 1)
                                /* Stip out allocations bits, and advance to primary dir entry. */
                                index = (index & 0x0000ffff) + (count -1);
#else /* (DOSFS_CONFIG_VFAT_SUPPORTED == 1) */
                                index = (index & 0x0000ffff);
#endif /* (DOSFS_CONFIG_VFAT_SUPPORTED == 1) */
                                
