GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/dosfs_core.c
                                file->dir_clsno = clsno;
                                file->dir_index = index;
                                file->length = 0;
                                file->first_clsno = DOSFS_CLSNO_NONE;
                            }
                        }
                        else
                        {
                            status = F_ERR_NOTFOUND;
                        }
                    }
                    
                    if (status == F_NO_ERROR)
                    {
                        file_o = NULL;
                        
                        do
                        {
                            file_o = dosfs_file_enumerate(volume, file_o, clsno, index);
                            
                            if (file_o != NULL)
                            {
                                if (mode & DOSFS_FILE_MODE_WRITE)
                                {
                                    status = F_ERR_LOCKED;
                                }
                                else
                                {
                                    if (file_o->mode & DOSFS_FILE_MODE_WRITE)
                                    {
                                        status = F_ERR_LOCKED;
                                    }
                                }
                            }
                        }
                        while ((status == F_NO_ERROR) && (file_o != NULL));
                        
                        if (status == F_NO_ERROR)
                        {
                            file->status = F_NO_ERROR;
                            file->position = 0;
                            file->last_clsno = DOSFS_CLSNO_NONE;
                            
                            if (file->first_clsno == DOSFS_CLSNO_NONE)
                            {
                                file->flags |= DOSFS_FILE_FLAG_END_OF_CHAIN;
                                file->clsno = DOSFS_CLSNO_NONE;
                                file->blkno = DOSFS_BLKNO_INVALID;
                                file->blkno_e = DOSFS_BLKNO_INVALID;
                            }
                            else
                            {
                                file->clsno = file->first_clsno;
                                file->blkno = DOSFS_CLSNO_TO_BLKNO(file->clsno);
                                file->blkno_e = file->blkno + volume->cls_blk_size;
                            }
                            
                            if (mode & DOSFS_FILE_MODE_TRUNCATE)
                            {
                                file->length = 0;
                                
                                status = dosfs_file_shrink(volume, file);
                            }
                            
#if (DOSFS_CONFIG_CONTIGUOUS_SUPPORTED == 1)
                            if (size)
                            {
                                if (file->first_clsno == DOSFS_CLSNO_NONE)
                                {
                                    status = dosfs_file_reserve(volume, file, size);
                                }
                                else
                                {
                                    clsno = file->first_clsno;
                                    clscnt = 0;
                                    
                                    do
                                    {
                                        status = dosfs_cluster_read(volume, clsno, &clsdata);
                                        
                                        if (status == F_NO_ERROR)
                                        {
                                            if ((clsdata >= 2) && (clsdata <= volume->last_clsno))
                                            {
                                                if ((clsno +1) == clsdata)
                                                {
                                                    clsno++;
                                                    clscnt++;
                                                }
                                                else
                                                {
                                                    status = F_ERR_EOF;
                                                }
                                                
                                            }
                                            else
                                            {
                                                if (clsdata < DOSFS_CLSNO_LAST)
                                                {
                                                    status = F_ERR_EOF;
                                                }
                                            }
                                        }
                                    }
                                    while ((status == F_NO_ERROR) && (clsdata < DOSFS_CLSNO_LAST));
                                    
                                    if (status == F_NO_ERROR)
                                    {
                                        if (clscnt == DOSFS_SIZE_TO_CLSCNT(size))
                                        {
                                            file->flags |= (DOSFS_FILE_FLAG_CONTIGUOUS | DOSFS_FILE_FLAG_END_OF_CHAIN);
                                            file->last_clsno = file->first_clsno + clscnt -1;

                                            if (size >= (DOSFS_FILE_SIZE_MAX & ~volume->cls_mask))
                                            {
                                                file->size = DOSFS_FILE_SIZE_MAX;
                                            }
                                            else
                                            {
                                                file->size = (size + volume->cls_mask) & ~volume->cls_mask;
                                            }
                                        }
                                        else
                                        {
                                            status = F_ERR_EOF;
                                        }
                                    }
                                }
                            }
#endif /* (DOSFS_CONFIG_CONTIGUOUS_SUPPORTED == 1) */
                            
                            if (status == F_NO_ERROR)
                            {
                                if (mode & DOSFS_FILE_MODE_APPEND)
                                {
                                    status = dosfs_file_seek(volume, file, file->length);
                                }
                                
                                if (status == F_NO_ERROR)
                                {
#if (DOSFS_CONFIG_FILE_DATA_CACHE == 1)
                                    file->data_cache.blkno = DOSFS_BLKNO_INVALID;
#endif /* (DOSFS_CONFIG_FILE_DATA_CACHE == 1) */

