GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/dosfs_core.c
                                    file->mode = mode;

                                    file->next = volume->files;

                                    volume->files = file;
                                }
                            }
                        }
                    }
                }
            }
        }
    }

    return status;
}

static int dosfs_file_close(dosfs_volume_t *volume, dosfs_file_t *file)
{
    int status = F_NO_ERROR;
    dosfs_file_t *file_s, **file_p;


    if (file->mode & DOSFS_FILE_MODE_WRITE)
    {
        status = dosfs_file_flush(volume, file, TRUE);
    }

    for (file_p = &volume->files, file_s = *file_p; file_s; file_p = &file_s->next, file_s = *file_p) 
    {
        if (file == file_s)
        {
            *file_p = file->next;
        }
    }

    file->mode = 0;
    file->dir_clsno = DOSFS_CLSNO_NONE;
    file->dir_index = 0;
    file->next = NULL;

    return status;
}

static int dosfs_file_read(dosfs_volume_t *volume, dosfs_file_t *file, uint8_t *data, uint32_t count, uint32_t *p_count)
{
    int status = F_NO_ERROR;
    dosfs_device_t *device;
    uint32_t blkno, blkno_e, blkcnt, clsno, position, total, size;
    dosfs_cache_entry_t *entry;

    device = DOSFS_VOLUME_DEVICE(volume);

    *p_count = 0;

    if (file->position >= file->length)
    {
        count = 0;
    }
    else
    {
        if (count > (file->length - file->position))
        {
            count = (file->length - file->position);
        }
    }

    if (count != 0)
    {
        total = count;

        position = file->position;
        clsno = file->clsno;
        blkno = file->blkno;
        blkno_e = file->blkno_e;

        /* Take care of the case where there is an empty cluster chain,
         * but file->length is not 0.
         */
        if (clsno == DOSFS_CLSNO_NONE)
        {
            status = F_ERR_EOF;
        }
        else
        {
            if (blkno == blkno_e)
            {
#if (DOSFS_CONFIG_CONTIGUOUS_SUPPORTED == 1)
                if (file->flags & DOSFS_FILE_FLAG_CONTIGUOUS)
                {
                    clsno++;
                    blkno_e += volume->cls_blk_size;
                }
                else
#endif /* (DOSFS_CONFIG_CONTIGUOUS_SUPPORTED == 1) */
                {
                    status = dosfs_cluster_chain_seek(volume, clsno, 1, &clsno);

                    if (status == F_NO_ERROR)
                    {
                        blkno = DOSFS_CLSNO_TO_BLKNO(clsno);
                        blkno_e = blkno + volume->cls_blk_size;
                    }
                }
            }
        }

        if (status == F_NO_ERROR)
        {
            if (((position & DOSFS_BLK_MASK) + count) < DOSFS_BLK_SIZE)
            {
                status = dosfs_data_cache_read(volume, file, blkno, &entry);
            
                if (status == F_NO_ERROR)
                {
                    memcpy(data, entry->data + (position & DOSFS_BLK_MASK), count);

                    position += count;
                    count = 0;

                    if (!(position & DOSFS_BLK_MASK))
                    {
                        blkno++;
                    }
                }
            }
            else
            {
                if (position & DOSFS_BLK_MASK)
                {
                    status = dosfs_data_cache_read(volume, file, blkno, &entry);
            
                    if (status == F_NO_ERROR)
                    {
                        size = (DOSFS_BLK_SIZE - (position & DOSFS_BLK_MASK));

                        memcpy(data, entry->data + (DOSFS_BLK_SIZE - size), size);

                        position += size;
                        data += size;
                        count -= size;

                        blkno++;
                    }
                }

                while ((status == F_NO_ERROR) && (count != 0))
                {
                    if (blkno == blkno_e)
                    {
#if (DOSFS_CONFIG_CONTIGUOUS_SUPPORTED == 1)
                        if (file->flags & DOSFS_FILE_FLAG_CONTIGUOUS)
                        {
                            clsno++;
                            blkno_e += volume->cls_blk_size;
                        }
                        else
#endif /* (DOSFS_CONFIG_CONTIGUOUS_SUPPORTED == 1) */
                        {
                            status = dosfs_cluster_chain_seek(volume, clsno, 1, &clsno);
                            
                            if (status == F_NO_ERROR)
                            {
                                blkno = DOSFS_CLSNO_TO_BLKNO(clsno);
                                blkno_e = blkno + volume->cls_blk_size;
                            }
                        }
                    }
                
                    if (status == F_NO_ERROR)
                    {
                        if (count < DOSFS_BLK_SIZE)
                        {
                            status = dosfs_data_cache_read(volume, file, blkno, &entry);
                    
                            if (status == F_NO_ERROR)
                            {
                                memcpy(data, entry->data, count);

                                position += count;
                                data += count;
                                count = 0;
                            }
                        }
                        else
                        {
                            size = volume->cls_size - (position & volume->cls_mask);
                            
                            if (size > count)
                            {
                                size = count & ~DOSFS_BLK_MASK;
                            }

                            blkcnt = size >> DOSFS_BLK_SHIFT;

                            status = dosfs_data_cache_flush(volume, file);

                            if (status == F_NO_ERROR)
                            {
                                status = (*device->interface->read)(device->context, blkno, data, blkcnt, !!(file->mode & DOSFS_FILE_MODE_SEQUENTIAL));

#if (DOSFS_CONFIG_MEDIA_FAILURE_SUPPORTED == 1)
                                if (status == F_ERR_INVALIDSECTOR)
                                {
                                    volume->flags |= DOSFS_VOLUME_FLAG_MEDIA_FAILURE;
                                }
#endif /* (DOSFS_CONFIG_MEDIA_FAILURE_SUPPORTED == 1) */

                                if (status == F_NO_ERROR)
                                {
                                    position += size;
                                    data += size;
                                    count -= size;

                                    blkno += blkcnt;
                                }
                            }
                        }
                    }
                }
            }
        
            if (status == F_NO_ERROR)
            {
                file->position = position;
                file->clsno = clsno;
                file->blkno = blkno;
                file->blkno_e = blkno_e;
            }
        }

        *p_count = total - count;
    }

