GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/dosfs_core.c
    if (file->status == F_NO_ERROR)
    {
        file->status = status;
    }

    return status;
}

static int dosfs_file_write(dosfs_volume_t *volume, dosfs_file_t *file, const uint8_t *data, uint32_t count, uint32_t *p_count)
{
    int status = F_NO_ERROR;
    dosfs_device_t *device;
    uint32_t blkno, blkno_e, blkcnt, clsno, offset, position, length, total, size;
    dosfs_cache_entry_t *entry;

    device = DOSFS_VOLUME_DEVICE(volume);

    *p_count = 0;

    if ((file->mode & DOSFS_FILE_MODE_APPEND) && (file->position != file->length))
    {
        status = dosfs_file_seek(volume, file, file->length);
    }

    if (status == F_NO_ERROR)
    {
#if (DOSFS_CONFIG_CONTIGUOUS_SUPPORTED == 1)
        if (file->flags & DOSFS_FILE_FLAG_CONTIGUOUS)
        {
            if (file->size < file->position)
            {
                status = F_ERR_EOF;
            }
            else
            {
                if (count > (file->size - file->position))
                {
                    count = (file->size - file->position);
                }
            }
        }
        else
#endif /* (DOSFS_CONFIG_CONTIGUOUS_SUPPORTED == 1) */
        {
            if (count > (DOSFS_FILE_SIZE_MAX - file->position))
            {
                count = (DOSFS_FILE_SIZE_MAX - file->position);
            }
        }

        if (status == F_NO_ERROR)
        {
            if (count != 0)
            {
                file->flags |= DOSFS_FILE_FLAG_DATA_MODIFIED;

                total  = count;
                offset = (file->length + DOSFS_BLK_MASK) & ~DOSFS_BLK_MASK;
                length = file->position + count;

                if (length > file->length)
                {
                    if ((file->length == 0) || (file->length != file->position) || (((file->length -1) & ~volume->cls_mask) != ((length -1) & ~volume->cls_mask)))
                    {
                        status = dosfs_file_extend(volume, file, length);
                    }
                    else
                    {
                        file->length = length;
                        file->flags |= DOSFS_FILE_FLAG_DIR_MODIFIED;
                    }
                }

                if (status == F_NO_ERROR)
                {
                    position = file->position;
                    clsno = file->clsno;
                    blkno = file->blkno;
                    blkno_e = file->blkno_e;

                    /* Take care of the case where the cluster chain of a file was truncted,
                     * but the length was not adjusted on disk.
                     */
                    if (clsno == DOSFS_CLSNO_NONE)
                    {
                        status = F_ERR_EOF;
                    }
                    else
                    {
                        if (blkno == blkno_e)
                        {
                            status = dosfs_data_cache_flush(volume, file);

                            if (status == F_NO_ERROR)
                            {
#if (DOSFS_CONFIG_CONTIGUOUS_SUPPORTED == 1)
                                if (file->flags & DOSFS_FILE_FLAG_CONTIGUOUS)
                                {
                                    clsno++;
                                    blkno_e += volume->cls_blk_size;
                                }
                                else
#endif /* (DOSFS_CONFIG_CONTIGUOUS_SUPPORTED == 1) */
                                {
                                    status = dosfs_cluster_chain_seek(volume, clsno, 1, &clsno);
                        
                                    if (status == F_NO_ERROR)
                                    {
                                        blkno = DOSFS_CLSNO_TO_BLKNO(clsno);
                                        blkno_e = blkno + volume->cls_blk_size;
                                    }
                                }
                            }
                        }
                    }

                    if (status == F_NO_ERROR)
                    {
                        if (((position & DOSFS_BLK_MASK) + count) < DOSFS_BLK_SIZE)
                        {
                            /* All data is within one block, simply go throu the cache.
                             * If the block is beyond the old file->length, is has to 
                             * be all zeros. Otherwise got throu the normal cache.
                             */

                            if (position >= offset)
                            {
                                status = dosfs_data_cache_zero(volume, file, blkno, &entry);
                            }
                            else
                            {
                                status = dosfs_data_cache_read(volume, file, blkno, &entry);
                            }
            
                            if (status == F_NO_ERROR)
                            {
                                memcpy(entry->data + (position & DOSFS_BLK_MASK), data, count);

                                dosfs_data_cache_modify(volume, file);

                                position += count;
                                count = 0;

                                if (!(position & DOSFS_BLK_MASK))
                                {
                                    blkno++;
                                }
                            }
                        }
                        else
                        {
                            if (position & DOSFS_BLK_MASK)
                            {
                                size = (DOSFS_BLK_SIZE - (position & DOSFS_BLK_MASK));

                                if (position >= offset)
                                {
                                    status = dosfs_data_cache_zero(volume, file, blkno, &entry);
                                }
                                else
                                { 
                                    status = dosfs_data_cache_read(volume, file, blkno, &entry);
                                }

                                if (status == F_NO_ERROR)
                                {
                                    memcpy(entry->data + (DOSFS_BLK_SIZE - size), data, size);
                                
                                    dosfs_data_cache_modify(volume, file);

                                    if (size < count)
                                    {
                                        status = dosfs_data_cache_write(volume, file);
                                    }

                                    if (status == F_NO_ERROR)
                                    {
                                        position += size;
                                        data += size;
                                        count -= size;
                                    
                                        blkno++;
                                    }
                                }
                            }

                            while ((status == F_NO_ERROR) && (count != 0))
                            {
                                if (blkno == blkno_e)
                                {
                                    status = dosfs_data_cache_flush(volume, file);

                                    if (status == F_NO_ERROR)
                                    {
#if (DOSFS_CONFIG_CONTIGUOUS_SUPPORTED == 1)
                                        if (file->flags & DOSFS_FILE_FLAG_CONTIGUOUS)
                                        {
                                            clsno++;
                                            blkno_e += volume->cls_blk_size;
                                        }
                                        else
#endif /* (DOSFS_CONFIG_CONTIGUOUS_SUPPORTED == 1) */
                                        {
                                            status = dosfs_cluster_chain_seek(volume, clsno, 1, &clsno);
                                        
                                            if (status == F_NO_ERROR)
                                            {
                                                blkno = DOSFS_CLSNO_TO_BLKNO(clsno);
                                                blkno_e = blkno + volume->cls_blk_size;
                                            }
                                        }
                                    }
                                }

                                if (status == F_NO_ERROR)
                                {
                                    if (count < DOSFS_BLK_SIZE)
                                    {
                                        if (position >= offset)
                                        {
                                            status = dosfs_data_cache_zero(volume, file, blkno, &entry);
                                        }
                                        else
                                        {
                                            status = dosfs_data_cache_read(volume, file, blkno, &entry);
                                        }

                                        if (status == F_NO_ERROR)
                                        {
                                            memcpy(entry->data, data, count);

                                            dosfs_data_cache_modify(volume, file);

                                            if (status == F_NO_ERROR)
                                            {
                                                position += count;
                                                data += count;
                                                count = 0;
                                            }
                                        }
                                    }
                                    else
                                    {
                                        size = volume->cls_size - (position & volume->cls_mask);
                            
                                        if (size > count)
                                        {
                                            size = count & ~DOSFS_BLK_MASK;
                                        }

                                        blkcnt = size >> DOSFS_BLK_SHIFT;

                                        status = dosfs_data_cache_invalidate(volume, file, blkno, blkcnt);

                                        if (status == F_NO_ERROR)
                                        {
                                            status = (*device->interface->write)(device->context, blkno, data, blkcnt, ((blkcnt == 1) ? 0 : blkcnt), false);

#if (DOSFS_CONFIG_MEDIA_FAILURE_SUPPORTED == 1)
                                            if (status == F_ERR_INVALIDSECTOR)
                                            {
                                                volume->flags |= DOSFS_VOLUME_FLAG_MEDIA_FAILURE;
                                            }
#endif /* (DOSFS_CONFIG_MEDIA_FAILURE_SUPPORTED == 1) */

                                            if (status == F_NO_ERROR)
                                            {
                                                position += size;
                                                data += size;
                                                count -= size;
                                            
                                                blkno += blkcnt;
                                            }
                                        }
                                    }
                                }
                            }
                        }
                    }

                    if (status == F_NO_ERROR)
                    {
                        if (file->mode & DOSFS_FILE_MODE_RANDOM)
                        {
                            status = (*device->interface->sync)(device->context);
                        }

                        if (status == F_NO_ERROR)
                        {
                            file->position = position;
                            file->clsno = clsno;
                            file->blkno = blkno;
                            file->blkno_e = blkno_e;
                        }
                    }
                }

                if (total != count)
                {
                    armv7m_atomic_or(&device->lock, DOSFS_DEVICE_LOCK_MODIFIED);
                }

                *p_count = total - count;
            }
        }
    }

