GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/dosfs_core.c
    if (file->status == F_NO_ERROR)
    {
        file->status = status;
    }

    return status;
}

/***********************************************************************************************************************/

int f_initvolume(void)
{
    int status = F_NO_ERROR;
    dosfs_volume_t *volume;
    dosfs_device_t *device; 
    uint32_t o_lock, n_lock;

    volume = DOSFS_DEFAULT_VOLUME();
    device = DOSFS_VOLUME_DEVICE(volume);

    while (1)
    {
        o_lock = device->lock;
        
        if (!(o_lock & (DOSFS_DEVICE_LOCK_SCSI | DOSFS_DEVICE_LOCK_MEDIUM | DOSFS_DEVICE_LOCK_INIT)))
        {
            n_lock = o_lock | DOSFS_DEVICE_LOCK_VOLUME;
            
            if (armv7m_atomic_cas(&device->lock, o_lock, n_lock) == o_lock)
            {
                break;
            }
        }
        
        __WFE();
    }

    status = dosfs_volume_lock_noinit(volume);
    
    if (status == F_NO_ERROR)
    {
        status = dosfs_volume_init(volume, device);
        
        status = dosfs_volume_unlock(volume, status);
    }

    if (status != F_NO_ERROR)
    {
        armv7m_atomic_and(&device->lock, ~DOSFS_DEVICE_LOCK_VOLUME);
    }

    return status;
}

int f_delvolume(void)
{
    int status = F_NO_ERROR;
    dosfs_volume_t *volume;
    dosfs_device_t *device;

    volume = DOSFS_DEFAULT_VOLUME();

    status = dosfs_volume_lock_nomount(volume);
    device = DOSFS_VOLUME_DEVICE(volume);
    
    if (status == F_NO_ERROR)
    {
        status = dosfs_volume_unmount(volume);

        if (status == F_NO_ERROR)
        {
            status = (*device->interface->release)(device->context);

            if (status == F_NO_ERROR)
            {
                volume->state = DOSFS_VOLUME_STATE_INITIALIZED;
            }
        }
        
        status = dosfs_volume_unlock(volume, status);
    }

    if (status == F_NO_ERROR)
    {
        armv7m_atomic_and(&device->lock, ~DOSFS_DEVICE_LOCK_VOLUME);
    }

    return status;
}

int f_checkvolume(void)
{
    int status = F_NO_ERROR;
    dosfs_volume_t *volume;
    dosfs_device_t *device;

    volume = DOSFS_DEFAULT_VOLUME();
    device = DOSFS_VOLUME_DEVICE(volume);

    status = dosfs_volume_lock(volume);
    
    if (status == F_NO_ERROR)
    {
        status = (*device->interface->sync)(device->context);

        status = dosfs_volume_unlock(volume, status);
    }

    return status;
}

int f_format(void)
{
    int status = F_NO_ERROR;
    dosfs_volume_t *volume;

    volume = DOSFS_DEFAULT_VOLUME();

    status = dosfs_volume_lock(volume);
    
    if (status == F_NO_ERROR)
    {
        if (volume->flags & DOSFS_VOLUME_FLAG_WRITE_PROTECTED)
        {
            status = F_ERR_WRITEPROTECT;
        }
        else
        {
            status = dosfs_volume_unmount(volume);

            if (status == F_NO_ERROR)
            {
                status = dosfs_volume_format(volume);
            }
        }

        status = dosfs_volume_unlock(volume, status);
    }

    return status;
}


int f_hardformat(unsigned long size)
{
    int status = F_NO_ERROR;
    dosfs_volume_t *volume;
    dosfs_device_t *device;

    volume = DOSFS_DEFAULT_VOLUME();
    device = DOSFS_VOLUME_DEVICE(volume);

    status = dosfs_volume_lock_nomount(volume);
    
    if (status == F_NO_ERROR)
    {
        status = dosfs_volume_unmount(volume);

        if (status == F_NO_ERROR)
        {
	    status = (*device->interface->format)(device->context, size);

	    if (status == F_NO_ERROR)
	    {
                status = dosfs_volume_hardformat(volume);
	    }
        }
        
        status = dosfs_volume_unlock(volume, status);
    }

    return status;
}


int f_getfreespace(F_SPACE *pspace)
{
    int status = F_NO_ERROR;
    uint32_t clsno, clsno_e, clscnt_total, clscnt_free, clsdata;
    dosfs_volume_t *volume;

    volume = DOSFS_DEFAULT_VOLUME();

    status = dosfs_volume_lock(volume);
    
    if (status == F_NO_ERROR)
    {
#if (DOSFS_CONFIG_FSINFO_SUPPORTED == 1)
        if (volume->flags & DOSFS_VOLUME_FLAG_FSINFO_VALID)
        {
            clscnt_total = volume->last_clsno - 1;
            clscnt_free = volume->free_clscnt;
        }
        else
#endif /* (DOSFS_CONFIG_FSINFO_SUPPORTED == 1) */
        {
            clscnt_total = volume->last_clsno - 1;
            clscnt_free = 0;

            for (clsno = 2, clsno_e = volume->last_clsno; ((status == F_NO_ERROR) && (clsno <= clsno_e)); clsno++)
            {
                /* Bypass cluster cache on read while scanning.
                 */
                status = dosfs_cluster_read_uncached(volume, clsno, &clsdata);
                
                if (status == F_NO_ERROR)
                {
                    if (clsdata == DOSFS_CLSNO_FREE)
                    {
                        clscnt_free++;
                    }
                }
            }

#if (DOSFS_CONFIG_FSINFO_SUPPORTED == 1)
            if (status == F_NO_ERROR)
            {
                volume->flags |= (DOSFS_VOLUME_FLAG_FSINFO_VALID | DOSFS_VOLUME_FLAG_FSINFO_DIRTY);
                volume->free_clscnt = clscnt_free;

                if ((volume->state == DOSFS_VOLUME_STATE_MOUNTED) &&
                    (volume->fsinfo_blkofs != 0))
                {
#if (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 1)
                    /* If a map/fat entry has changed, this triggers a record/commit sequence.
                     * Otherwise the DOSFS_VOLUME_FLAG_FSINFO_DIRTY setting will simply update
                     * the FSINFO on disk.
                     */
                    status = dosfs_volume_record(volume);

#else /* (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 1) */

#if (DOSFS_CONFIG_VOLUME_DIRTY_SUPPORTED == 1)
                    /* volume->free_clscnt is only maintained in FSINFO if DOSFS_VOLUME_FLAG_MOUNTED_DIRTY
                     * is not set. If DOSFS_VOLUME_FLAG_VOLUME_DIRTY is set, then the volume is in a dirty
                     * state, where volume->free_clscnt cannot be updated. In this case wait for the update
                     * till the next dosfs_volume_clean() gets called.
                     */
                    if (!(volume->flags & (DOSFS_VOLUME_FLAG_VOLUME_DIRTY | DOSFS_VOLUME_FLAG_MOUNTED_DIRTY)))
                    {
                        status = dosfs_fat_cache_flush(volume);
                    
                        if (status == F_NO_ERROR)
                        {
                            status = dosfs_volume_fsinfo(volume, volume->free_clscnt, volume->next_clsno);
                            
                            if (status == F_NO_ERROR)
                            {
                                volume->flags &= ~DOSFS_VOLUME_FLAG_FSINFO_DIRTY;
                            }
                        }
                    }
#endif /* (DOSFS_CONFIG_VOLUME_DIRTY_SUPPORTED == 1) */
#endif /* (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 1) */
                }
            }
#endif /* (DOSFS_CONFIG_FSINFO_SUPPORTED == 1) */
        }

        if (status == F_NO_ERROR)
        {
            pspace->total      = clscnt_total << volume->cls_shift;
            pspace->free       = clscnt_free  << volume->cls_shift;
            pspace->used       = (clscnt_total - clscnt_free) << volume->cls_shift;
            pspace->bad        = 0;
            pspace->total_high = clscnt_total >> (32 - volume->cls_shift);
            pspace->free_high  = clscnt_free  >> (32 - volume->cls_shift);
            pspace->used_high  = (clscnt_total - clscnt_free) >> (32 - volume->cls_shift);
            pspace->bad_high   = 0;
        }

        status = dosfs_volume_unlock(volume, status);
    }

