GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/dosfs_core.c
    return status;
}

int f_getserial(unsigned long *p_serial)
{
    int status = F_NO_ERROR;
    dosfs_volume_t *volume;

    volume = DOSFS_DEFAULT_VOLUME();
    
    status = dosfs_volume_lock(volume);
    
    if (status == F_NO_ERROR)
    {
        *p_serial = volume->serial;

        status = dosfs_volume_unlock(volume, status);
    }

    return status;
}


int f_setlabel(const char *volname)
{
    int status = F_NO_ERROR;
    uint32_t clsno, index;
    uint16_t ctime, cdate;
    dosfs_dir_t *dir;
    dosfs_volume_t *volume;

    volume = DOSFS_DEFAULT_VOLUME();
    
    status = dosfs_volume_lock(volume);
    
    if (status == F_NO_ERROR)
    {
        if (volume->flags & DOSFS_VOLUME_FLAG_WRITE_PROTECTED)
        {
            status = F_ERR_WRITEPROTECT;
        }
        else
        {
            volname = dosfs_name_cstring_to_label(volname, volume->dir.dir_name);

            if (volname != NULL)
            {
#if (DOSFS_CONFIG_VFAT_SUPPORTED == 1)
                volume->dir.dir_nt_reserved = 0x00;
#endif /* (DOSFS_CONFIG_VFAT_SUPPORTED == 1) */

                status = dosfs_path_find_entry(volume, DOSFS_CLSNO_NONE, 0, 1, dosfs_path_find_callback_volume, NULL, &clsno, &index, &dir);

                if (status == F_NO_ERROR)
                {
#if defined(DOSFS_PORT_CORE_TIMEDATE)
                    DOSFS_PORT_CORE_TIMEDATE(&ctime, &cdate);
#else /* DOSFS_PORT_CORE_TIMEDATE */
                    ctime = 0;
                    cdate = 0;
#endif /* DOSFS_PORT_CORE_TIMEDATE */

                    if (dir == NULL)
                    {
#if (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 0)
                        status = dosfs_volume_dirty(volume);

                        if (status == F_NO_ERROR)
#endif /* (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 0) */
                        {
                            status = dosfs_path_create_entry(volume, DOSFS_CLSNO_NONE, clsno, index, (const char*)volume->dir.dir_name, DOSFS_DIR_ATTR_VOLUME_ID, DOSFS_CLSNO_NONE, ctime, cdate);
                        
#if (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 0)
                            status = dosfs_volume_clean(volume, status);
#endif /* (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 0) */
                        }
                    }
                    else
                    {
                        memcpy(dir->dir_name, volume->dir.dir_name, sizeof(dir->dir_name));

                        dir->dir_wrt_time = DOSFS_HTOFS(ctime);
                        dir->dir_wrt_date = DOSFS_HTOFS(cdate);

                        status = dosfs_dir_cache_write(volume);
                    }
                }
            }
            else
            {
                status = F_ERR_INVALIDNAME;
            }
        }

        status = dosfs_volume_unlock(volume, status);
    }

    return status;
}

int f_getlabel(char *volname, int length)
{
    int status = F_NO_ERROR;
    const uint8_t *dosname;
    char *volname_e;
    dosfs_dir_t *dir;
    dosfs_boot_t *boot;
    dosfs_volume_t *volume;

    volume = DOSFS_DEFAULT_VOLUME();
    
    status = dosfs_volume_lock(volume);
    
    if (status == F_NO_ERROR)
    {
        dosname = NULL;

        status = dosfs_path_find_entry(volume, DOSFS_CLSNO_NONE, 0, 0, dosfs_path_find_callback_volume, NULL, NULL, NULL, &dir);

        if (status == F_NO_ERROR)
        {
            volname_e = volname + length;

            if (dir == NULL)
            {
#if (DOSFS_CONFIG_VOLUME_DIRTY_SUPPORTED == 1) || (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 1)
                boot = (dosfs_boot_t*)((void*)&volume->bs_data[0]);
#else /* (DOSFS_CONFIG_VOLUME_DIRTY_SUPPORTED == 1) || (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 1) */

                boot = (dosfs_boot_t*)((void*)volume->dir_cache.data);

                status = dosfs_dir_cache_flush(volume);
                
                if (status == F_NO_ERROR)
                {
                    status = dosfs_volume_read(volume, volume->boot_blkno, (uint8_t*)boot);
                }

                if (status == F_NO_ERROR)
#endif /* (DOSFS_CONFIG_VOLUME_DIRTY_SUPPORTED == 1) || (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 1) */
                {
                    if (volume->type != DOSFS_VOLUME_TYPE_FAT32)
                    {
                        if (boot->bpb40.bs_boot_sig == 0x29)
                        {
                            dosname = (const uint8_t*)boot->bpb40.bs_vol_lab;
                        }
                    }
                    else
                    {
                        if (boot->bpb71.bs_boot_sig == 0x29)
                        {
                            dosname = (const uint8_t*)boot->bpb71.bs_vol_lab;
                        }
                    }
                }
            }
            else
            {
                dosname = (const uint8_t*)dir->dir_name;
            }
        }

        if (status == F_NO_ERROR)
        {
            if (dosname != NULL)
            {
                volname = dosfs_name_label_to_cstring(dosname, volname, volname_e);

                if (volname == NULL)
                {
                    status = F_ERR_TOOLONGNAME;
                }
            }
            else
            {
                status = F_ERR_NOTFOUND;
            }
        }

        status = dosfs_volume_unlock(volume, status);
    }

    return status;
}


int f_mkdir(const char *dirname)
{
    int status = F_NO_ERROR;
    uint16_t ctime, cdate;
    uint32_t clsno, clsno_d, clsno_s, blkno_s, index, count;
    dosfs_dir_t *dir;
    dosfs_cache_entry_t *entry;
    dosfs_volume_t *volume;

    volume = DOSFS_PATH_VOLUME(dirname);
    
    status = dosfs_volume_lock(volume);
    
    if (status == F_NO_ERROR)
    {
        if (volume->flags & DOSFS_VOLUME_FLAG_WRITE_PROTECTED)
        {
            status = F_ERR_WRITEPROTECT;
        }
        else
        {
            if (((dirname[0] == '/') || (dirname[0] == '\\')) && (dirname[1] == '\0'))
            {
                status = F_ERR_INVALIDDIR;
            }
            else
            {
                status = dosfs_path_find_directory(volume, dirname, &dirname, &clsno_d);
            
                if (status == F_NO_ERROR)
                {
                    status = dosfs_path_convert_filename(volume, dirname, NULL);

                    if (status == F_NO_ERROR)
                    {
                        if (volume->dir.dir_name[0] == '.')
                        {
                            status = F_ERR_NOTFOUND;
                        }
                        else
                        {
#if (DOSFS_CONFIG_VFAT_SUPPORTED == 1)
                            if ((volume->dir.dir_name[0] == '\0') || (volume->dir.dir_nt_reserved & DOSFS_DIR_TYPE_LOSSY))
                            {
                                count = 1 + volume->dir_entries;
                            }
                            else
#endif /* (DOSFS_CONFIG_VFAT_SUPPORTED == 1) */
                            {
                                count = 1;
                            }

                            status = dosfs_path_find_entry(volume, clsno_d, 0, count, dosfs_path_find_callback_name, NULL, &clsno, &index, &dir);
                        
                            if (status == F_NO_ERROR)
                            {
                                if (dir == NULL)
                                {
                                    /* No conflicting entry found, hence start out creating the subdirectory.
                                     *
                                     * The strategy is to first allocate the cluster for the subdirectory, populate it
                                     * and then create the new directory entry in the parent. This way there is no
                                     * inconsistent file system state along the way.
                                     */

