GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/dosfs_core.c
#if (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 0)
                                    status = dosfs_volume_dirty(volume);

                                    if (status == F_NO_ERROR)
#endif /* (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 0) */
                                    {
                                        status = dosfs_cluster_chain_create(volume, DOSFS_CLSNO_NONE, 1, &clsno_s, NULL);
                                
                                        if (status == F_NO_ERROR)
                                        {
                                            blkno_s = DOSFS_CLSNO_TO_BLKNO(clsno_s);
                                    
                                            status = dosfs_volume_zero(volume, blkno_s, volume->cls_blk_size, true);

                                            if (status == F_NO_ERROR)
                                            {
                                                status = dosfs_dir_cache_zero(volume, blkno_s, &entry);

                                                if (status == F_NO_ERROR)
                                                {
#if defined(DOSFS_PORT_CORE_TIMEDATE)
                                                    DOSFS_PORT_CORE_TIMEDATE(&ctime, &cdate);
#else /* DOSFS_PORT_CORE_TIMEDATE */
                                                    ctime = 0;
                                                    cdate = 0;
#endif /* DOSFS_PORT_CORE_TIMEDATE */
                                                
                                                    dosfs_path_setup_entry(volume, dosfs_dirname_dot, DOSFS_DIR_ATTR_DIRECTORY, clsno_s, ctime, cdate, ((dosfs_dir_t*)((void*)entry->data)));
                                                    dosfs_path_setup_entry(volume, dosfs_dirname_dotdot, DOSFS_DIR_ATTR_DIRECTORY, clsno_d, ctime, cdate, ((dosfs_dir_t*)((void*)(entry->data + sizeof(dosfs_dir_t)))));
                                                
                                                    status = dosfs_dir_cache_write(volume);
                                                
                                                    if (status == F_NO_ERROR)
                                                    {
                                                        /* Subdirectory has been created, so back to hooking up the directory entry.
                                                         */
                                                    
                                                        status = dosfs_path_create_entry(volume, clsno_d, clsno, index, NULL, DOSFS_DIR_ATTR_DIRECTORY, clsno_s, ctime, cdate);

                                                        if (status == F_ERR_NOMOREENTRY)
                                                        {
                                                            dosfs_cluster_chain_destroy(volume, clsno_s, DOSFS_CLSNO_FREE);
                                                        }
                                                    }
                                                }
                                            }
                                        }

#if (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 0)
                                        status = dosfs_volume_clean(volume, status);
#endif /* (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 0) */
                                    }
                                }
                                else
                                {
                                    status = F_ERR_DUPLICATED;
                                }
                            }
                        }
                    }
                }
            }
        }

        status = dosfs_volume_unlock(volume, status);
    }

    return status;
}

int f_rmdir(const char *dirname)
{
    int status = F_NO_ERROR;
    uint32_t clsno, clsno_d, index, first_clsno;
#if (DOSFS_CONFIG_VFAT_SUPPORTED == 1)
    unsigned int entries;
#endif /* (DOSFS_CONFIG_VFAT_SUPPORTED == 1) */
    dosfs_dir_t *dir;
    dosfs_volume_t *volume;

    volume = DOSFS_PATH_VOLUME(dirname);
    
    status = dosfs_volume_lock(volume);
    
    if (status == F_NO_ERROR)
    {
        if (volume->flags & DOSFS_VOLUME_FLAG_WRITE_PROTECTED)
        {
            status = F_ERR_WRITEPROTECT;
        }
        else
        {
            if (((dirname[0] == '/') || (dirname[0] == '\\')) && (dirname[1] == '\0'))
            {
                status = F_ERR_INVALIDDIR;
            }
            else
            {
                status = dosfs_path_find_directory(volume, dirname, &dirname, &clsno_d);
            
                if (status == F_NO_ERROR)
                {
                    status = dosfs_path_convert_filename(volume, dirname, NULL);

                    if (status == F_NO_ERROR)
                    {
                        if (volume->dir.dir_name[0] == '.')
                        {
                            status = F_ERR_NOTFOUND;
                        }
                        else
                        {
                            // ### FIXME ... filter out "/"
                            status = dosfs_path_find_entry(volume, clsno_d, 0, 0, dosfs_path_find_callback_name, NULL, &clsno, &index, &dir);
                        
                            if (status == F_NO_ERROR)
                            {
                                if (dir != NULL)
                                {
                                    if (dir->dir_attr & DOSFS_DIR_ATTR_DIRECTORY)
                                    {
#if (DOSFS_CONFIG_VFAT_SUPPORTED == 1)
                                        /* dosfs_path_find_callback_name() fills in the proper volume->dir_entries on a match.
                                         */
                                        entries = volume->dir_entries;
#endif /* (DOSFS_CONFIG_VFAT_SUPPORTED == 1) */

                                        if (volume->type == DOSFS_VOLUME_TYPE_FAT32)
                                        {
                                            first_clsno = ((uint32_t)DOSFS_FTOHS(dir->dir_clsno_hi) << 16) | (uint32_t)DOSFS_FTOHS(dir->dir_clsno_lo);
                                        }
                                        else
                                        { 
                                            first_clsno = (uint32_t)DOSFS_FTOHS(dir->dir_clsno_lo);
                                        }

                                        /* Skip "." and ".."
                                         */
                                        status = dosfs_path_find_entry(volume, first_clsno, 2, 0, dosfs_path_find_callback_empty, NULL, NULL, NULL, &dir);

                                        if (status == F_NO_ERROR)
                                        {
                                            if (dir == NULL)
                                            {
#if (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 0)
                                                status = dosfs_volume_dirty(volume);

                                                if (status == F_NO_ERROR)
#endif /* (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 0) */
                                                {
#if (DOSFS_CONFIG_VFAT_SUPPORTED == 1)
                                                    status = dosfs_path_destroy_entry(volume, clsno, index, entries, first_clsno);
#else /* (DOSFS_CONFIG_VFAT_SUPPORTED == 1) */
                                                    status = dosfs_path_destroy_entry(volume, clsno, index, first_clsno);
#endif /* (DOSFS_CONFIG_VFAT_SUPPORTED == 1) */
                                            
                                                    if (status == F_NO_ERROR)
                                                    {
                                                        if (volume->cwd_clsno == first_clsno)
                                                        {
                                                            volume->cwd_clsno = DOSFS_CLSNO_END_OF_CHAIN;
                                                        }
                                                    }

                                            
