GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/dosfs_core.c
#if (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 0)
                                                    status = dosfs_volume_clean(volume, status);
#endif /* (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 0) */
                                                }
                                            }
                                            else
                                            {
                                                status = F_ERR_NOTEMPTY;
                                            }
                                        }
                                    }
                                    else
                                    {
                                        status = F_ERR_INVALIDDIR;
                                    }
                                }
                                else
                                {
                                    status = F_ERR_NOTFOUND;
                                }
                            }
                        }
                    }
                }
            }
        }

        status = dosfs_volume_unlock(volume, status);
    }

    return status;
}

int f_chdir(const char *dirname)
{
    int status = F_NO_ERROR;
    uint32_t clsno_d, blkno_d;
    dosfs_cache_entry_t *entry;
    dosfs_dir_t *dir;
    dosfs_volume_t *volume;

    volume = DOSFS_PATH_VOLUME(dirname);

    status = dosfs_volume_lock(volume);
    
    if (status == F_NO_ERROR)
    {
        if (((dirname[0] == '/') || (dirname[0] == '\\')) && (dirname[1] == '\0'))
        {
            /* dosfs_path_find_directory cannot return a vaild "dir" for the "/",
             * so special code this here.
             */
            volume->cwd_clsno = DOSFS_CLSNO_NONE;
        }
        else
        {
            status = dosfs_path_find_directory(volume, dirname, &dirname, &clsno_d);
            
            if (status == F_NO_ERROR)
            {
                status = dosfs_path_convert_filename(volume, dirname, NULL);
                
                if (status == F_NO_ERROR)
                {
                    if (volume->dir.dir_name[0] == '.')
                    {
                        if (volume->dir.dir_name[1] == ' ')
                        {
                            /* "." */
                            volume->cwd_clsno = clsno_d;
                        }
                        else
                        {
                            /* ".." */

                            if (clsno_d != DOSFS_CLSNO_NONE)
                            {
                                blkno_d = DOSFS_CLSNO_TO_BLKNO(clsno_d);

                                status = dosfs_dir_cache_read(volume, blkno_d, &entry);
                                                
                                if (status == F_NO_ERROR)
                                {
                                    dir = (dosfs_dir_t*)((void*)(entry->data + sizeof(dosfs_dir_t)));
                                
                                    if (volume->type == DOSFS_VOLUME_TYPE_FAT32)
                                    {
                                        volume->cwd_clsno = ((uint32_t)DOSFS_FTOHS(dir->dir_clsno_hi) << 16) | (uint32_t)DOSFS_FTOHS(dir->dir_clsno_lo);
                                    }
                                    else
                                    {
                                        volume->cwd_clsno = (uint32_t)DOSFS_FTOHS(dir->dir_clsno_lo);
                                    }
                                }
                            }
                            else
                            {
                                status = F_ERR_NOTFOUND;
                            }
                        }
                    }
                    else
                    {
                        status = dosfs_path_find_entry(volume, clsno_d, 0, 0, dosfs_path_find_callback_name, NULL, NULL, NULL, &dir);

                        if (status == F_NO_ERROR)
                        {
                            if (dir != NULL)
                            {
                                if (dir->dir_attr & DOSFS_DIR_ATTR_DIRECTORY)
                                {
                                    if (volume->type == DOSFS_VOLUME_TYPE_FAT32)
                                    {
                                        volume->cwd_clsno = ((uint32_t)DOSFS_FTOHS(dir->dir_clsno_hi) << 16) | (uint32_t)DOSFS_FTOHS(dir->dir_clsno_lo);
                                    }
                                    else
                                    {
                                        volume->cwd_clsno = (uint32_t)DOSFS_FTOHS(dir->dir_clsno_lo);
                                    }
                                }
                                else
                                {
                                    status = F_ERR_INVALIDDIR;
                                }
                            }
                            else
                            {
                                status = F_ERR_NOTFOUND;
                            }
                        }
                    }
                }
            }
        }

        status = dosfs_volume_unlock(volume, status);
    }

    return status;
}

int f_getcwd(char *dirname, int length)
{
    int status = F_NO_ERROR;
    uint32_t clsno_s, clsno_p, clsno_g, blkno, index;
    char *dirname_e;
    dosfs_cache_entry_t *entry;
    dosfs_dir_t *dir;
    dosfs_volume_t *volume;
    
    volume = DOSFS_DEFAULT_VOLUME();

    status = dosfs_volume_lock(volume);
    
    if (status == F_NO_ERROR)
    {
        if (length == 1)
        {
            status = F_ERR_TOOLONGNAME;
        }
        else
        {
            clsno_s = volume->cwd_clsno;
        
            index = length -1;
            
            if (clsno_s != DOSFS_CLSNO_NONE)
            {
                blkno = volume->cls_blk_offset + (clsno_s << volume->cls_blk_shift);
                    
                status = dosfs_dir_cache_read(volume, blkno, &entry);

                if (status == F_NO_ERROR)
                {
                    dir = (dosfs_dir_t*)((void*)(entry->data + sizeof(dosfs_dir_t)));
                    
                    if (volume->type == DOSFS_VOLUME_TYPE_FAT32)
                    {
                        clsno_p = ((uint32_t)DOSFS_FTOHS(dir->dir_clsno_hi) << 16) | (uint32_t)DOSFS_FTOHS(dir->dir_clsno_lo);
                    }
                    else
                    {
                        clsno_p = (uint32_t)DOSFS_FTOHS(dir->dir_clsno_lo);
                    }
                    
                    do
                    {
                        if (clsno_p != DOSFS_CLSNO_NONE)
                        {
                            blkno = volume->cls_blk_offset + (clsno_p << volume->cls_blk_shift);
                            
                            status = dosfs_dir_cache_read(volume, blkno, &entry);
                            
                            if (status == F_NO_ERROR)
                            {
                                dir = (dosfs_dir_t*)((void*)(entry->data + sizeof(dosfs_dir_t)));
                                
                                if (volume->type == DOSFS_VOLUME_TYPE_FAT32)
                                {
                                    clsno_g = ((uint32_t)DOSFS_FTOHS(dir->dir_clsno_hi) << 16) | (uint32_t)DOSFS_FTOHS(dir->dir_clsno_lo);
                                }
                                else
                                {
                                    clsno_g = (uint32_t)DOSFS_FTOHS(dir->dir_clsno_lo);
                                }
                            }
                        }
                        else
                        {
                            clsno_g = DOSFS_CLSNO_NONE;
                        }

                        if (status == F_NO_ERROR)
                        {
                            status = dosfs_path_find_entry(volume, clsno_p, 0, 0, dosfs_path_find_callback_directory, (void*)clsno_s, NULL, NULL, &dir);

                            if (status == F_NO_ERROR)
                            {
                                if (dir != NULL)
                                {
                                    if (clsno_s != volume->cwd_clsno)
                                    {
                                        if (index != 0)
                                        {
                                            dirname[index--] = F_SEPARATORCHAR;
                                        }
                                        else
                                        {
                                            status = F_ERR_TOOLONGNAME;
                                        }
                                    }
                                    
                                    if (status == F_NO_ERROR)
                                    {
#if (DOSFS_CONFIG_VFAT_SUPPORTED == 1)
                                        /* It's possible to have a sfn_name only ("." and ".." for example).
                                         */
                                        if (volume->lfn_count)
                                        {
                                            dirname_e = dosfs_name_uniname_to_cstring(volume->lfn_name, volume->lfn_count, dirname, dirname + index);
                                        }
                                        else
#endif /* (DOSFS_CONFIG_VFAT_SUPPORTED == 1) */
                                        {
                                            dirname_e = dosfs_name_dosname_to_cstring(dir->dir_name, dir->dir_nt_reserved, dirname, dirname + index);
                                        }
                                        
                                        if (dirname_e != NULL)
                                        {
                                            index -= (dirname_e - dirname -1);
                                            
