GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/dosfs_core.c
                                            memmove(&dirname[index+1], &dirname[0], (dirname_e - dirname -1));
                                            
                                            clsno_s = clsno_p;
                                            clsno_p = clsno_g;
                                        }
                                        else
                                        {
                                            status = F_ERR_TOOLONGNAME;
                                        }
                                    }
                                }
                                else
                                {
                                    status = F_ERR_NOTFOUND;
                                }
                            }
                        }
                    }
                    while ((status == F_NO_ERROR) && (clsno_s != DOSFS_CLSNO_NONE));
                }
            }
                
            if (status == F_NO_ERROR)
            {
                if (index >= 2)
                {
                    dirname[index] = F_SEPARATORCHAR;
                    
                    memmove(&dirname[0], &dirname[index], (length - index));
                    
                    dirname[length - index] = '\0';
                }
                else
                {
                    status = F_ERR_TOOLONGNAME;
                }
            }
        }

        status = dosfs_volume_unlock(volume, status);
    }
        
    return status;
}

int f_opendir(F_DIR *dir, const char *dirname)
{
    int status = F_NO_ERROR;
    uint32_t clsno_d;
    dosfs_volume_t *volume;
    dosfs_dir_t *dir_e;

    dir->dot_clsno = DOSFS_CLSNO_END_OF_CHAIN;
    dir->dir_clsno = DOSFS_CLSNO_END_OF_CHAIN;
    dir->dir_index = 0;

    volume = DOSFS_PATH_VOLUME(dirname);
    
    status = dosfs_volume_lock(volume);
    
    if (status == F_NO_ERROR)
    {
        if (((dirname[0] == '/') || (dirname[0] == '\\')) && (dirname[1] == '\0'))
        {
            clsno_d = DOSFS_CLSNO_NONE;
        }
        else
        {
            status = dosfs_path_find_file(volume, dirname, NULL, NULL, &dir_e);

            if (status == F_NO_ERROR)
            {
                if (dir_e->dir_attr & DOSFS_DIR_ATTR_DIRECTORY)
                {
                    if (volume->type == DOSFS_VOLUME_TYPE_FAT32)
                    {
                        clsno_d = ((uint32_t)DOSFS_FTOHS(dir_e->dir_clsno_hi) << 16) | (uint32_t)DOSFS_FTOHS(dir_e->dir_clsno_lo);
                    }
                    else
                    {
                        clsno_d = (uint32_t)DOSFS_FTOHS(dir_e->dir_clsno_lo);
                    }
                }
                else
                {
                    status = F_ERR_INVALIDDIR;
                }
            }
        }

        if (status == F_NO_ERROR)
        {
            dir->dir_clsno = dir->dot_clsno = clsno_d;
        }
    }

    return status;
}

int f_readdir(F_DIR *dir, F_DIRENT *dirent)
{
    int status = F_NO_ERROR;
    dosfs_volume_t *volume;
    dosfs_dir_t *dir_e;

    volume = DOSFS_FIND_VOLUME(find);

    status = dosfs_volume_lock(volume);
    
    if (status == F_NO_ERROR)
    {
        if (dir->dir_clsno == DOSFS_CLSNO_END_OF_CHAIN)
        {
            status = F_ERR_NOTFOUND;
        }
        else
        {
            status = dosfs_path_find_pattern(volume, dir, NULL, dirent->filename, &dir_e);

            if (status == F_NO_ERROR)
            {
                dirent->attr = dir_e->dir_attr;
                dirent->filesize = DOSFS_FTOHL(dir_e->dir_file_size);
            }
        }

        status = dosfs_volume_unlock(volume, status);
    }

    return status;
}

int f_rewinddir(F_DIR *dir)
{
    int status = F_NO_ERROR;

    if (dir->dot_clsno == DOSFS_CLSNO_END_OF_CHAIN)
    {
        status = F_ERR_INVALIDDIR;
    }
    else
    {
        dir->dir_clsno = dir->dot_clsno;
        dir->dir_index = 0;
    }

    return status;
}

int f_closedir(F_DIR *dir)
{
    int status = F_NO_ERROR;

    dir->dot_clsno = DOSFS_CLSNO_END_OF_CHAIN;
    dir->dir_clsno = DOSFS_CLSNO_END_OF_CHAIN;
    dir->dir_index = 0;

    return status;
}


int f_rename(const char *filename, const char *newname)
{
    int status = F_NO_ERROR;
    uint32_t blkno, clsno_d, clsno_o, index_o;
#if (DOSFS_CONFIG_VFAT_SUPPORTED == 1)
    uint32_t clsno, index, entries_o, count;
    uint8_t nt_reserved_o;
#endif /* (DOSFS_CONFIG_VFAT_SUPPORTED == 1) */
    dosfs_dir_t *dir;
    dosfs_cache_entry_t *entry;
    dosfs_volume_t *volume;

    volume = DOSFS_PATH_VOLUME(filename);

    status = dosfs_volume_lock(volume);
    
    if (status == F_NO_ERROR)
    {
        if (volume->flags & DOSFS_VOLUME_FLAG_WRITE_PROTECTED)
        {
            status = F_ERR_WRITEPROTECT;
        }
        else
        {
            status = dosfs_path_find_directory(volume, filename, &filename, &clsno_d);
            
            if (status == F_NO_ERROR)
            {
                status = dosfs_path_convert_filename(volume, filename, NULL);
            
                if (status == F_NO_ERROR)
                {
                    status = dosfs_path_find_entry(volume, clsno_d, 0, 0, dosfs_path_find_callback_name, NULL, &clsno_o, &index_o, &dir);

                    if (status == F_NO_ERROR)
                    {
                        if (dir != NULL)
                        {
                            if (dir->dir_attr & DOSFS_DIR_ATTR_READ_ONLY)
                            {
                                status = F_ERR_ACCESSDENIED;
                            }
                            else
                            {
                                if (dosfs_file_enumerate(volume, NULL, clsno_o, index_o))
                                {
                                    status = F_ERR_LOCKED;
                                }
                                else
                                {
#if (DOSFS_CONFIG_VFAT_SUPPORTED == 1)
                                    memcpy(&volume->dir, dir, sizeof(dosfs_dir_t));

                                    nt_reserved_o = dir->dir_nt_reserved;

                                    /* dosfs_path_find_callback_name() fills in the proper volume->dir_entries on a match.
                                     */
                                    entries_o = volume->dir_entries;
#endif /* (DOSFS_CONFIG_VFAT_SUPPORTED == 1) */

