GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/dosfs_core.c
                                    status = dosfs_path_convert_filename(volume, newname, NULL);
                                
                                    if (status == F_NO_ERROR)
                                    {
#if (DOSFS_CONFIG_VFAT_SUPPORTED == 1)
                                        if ((volume->dir.dir_name[0] == '\0') || (volume->dir.dir_nt_reserved & DOSFS_DIR_TYPE_LOSSY))
                                        {
                                            count = 1 + volume->dir_entries;
                                        }
                                        else
                                        {
                                            count = 1;
                                        }

                                        status = dosfs_path_find_entry(volume, clsno_d, 0, count, dosfs_path_find_callback_name, NULL, &clsno, &index, &dir);
#else /* (DOSFS_CONFIG_VFAT_SUPPORTED == 1) */
                                        status = dosfs_path_find_entry(volume, clsno_d, 0, 0, dosfs_path_find_callback_name, NULL, NULL, NULL, &dir);
#endif /* (DOSFS_CONFIG_VFAT_SUPPORTED == 1) */
                                    
                                        if (status == F_NO_ERROR)
                                        {
                                            if (dir != NULL)
                                            {
                                                status = F_ERR_DUPLICATED;
                                            }
                                            else
                                            {
#if (DOSFS_CONFIG_VFAT_SUPPORTED == 1)
                                                if ((entries_o != 0) || (count != 1))
                                                {
#if (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 1)
                                                    /* For TRANSACTION_SAFE, the DOSFS_DIR_FLAG_DESTROY_ENTRY operation is recorded first, and
                                                     * the dosfs_path_create_entry() gets called to add the DOSFS_DIR_FLAG_CREATE_ENTRY part.
                                                     * If that fails somehow, then the pending operations are canceled.
                                                     */
                                                    volume->dir_flags |= DOSFS_DIR_FLAG_DESTROY_ENTRY;
                                                    volume->del_clsno = clsno_o;
                                                    volume->del_index = index_o;
#if (DOSFS_CONFIG_VFAT_SUPPORTED == 1)
                                                    volume->del_entries = entries_o;
#endif /* (DOSFS_CONFIG_VFAT_SUPPORTED == 1) */

                                                    /* The call to dosfs_path_create_entry() is special. The DOSFS_CLUSTER_END_OF_CHAIN tells it
                                                     * use the existing volume->dir as a template, and to overlay "attr" onto dir_nt_reserved.
                                                     */
                                                    status = dosfs_path_create_entry(volume, clsno_d, clsno, index, NULL, nt_reserved_o, DOSFS_CLSNO_END_OF_CHAIN, 0, 0);
                                                
                                                    if (status != F_NO_ERROR)
                                                    {
                                                        volume->dir_flags &= ~(DOSFS_DIR_FLAG_DESTROY_ENTRY | DOSFS_DIR_FLAG_CREATE_ENTRY);
                                                    }

#else /* (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 1) */
                                                    status = dosfs_volume_dirty(volume);

                                                    if (status == F_NO_ERROR)
                                                    {
                                                        /* The call to dosfs_path_create_entry() is special. The DOSFS_CLUSTER_END_OF_CHAIN tells it
                                                         * use the existing volume->dir as a template, and to overlay "attr" onto dir_nt_reserved.
                                                         */

                                                        status = dosfs_path_create_entry(volume, clsno_d, clsno, index, NULL, nt_reserved_o, DOSFS_CLSNO_END_OF_CHAIN, 0, 0);
                                                    
                                                        if (status == F_NO_ERROR)
                                                        {
#if (DOSFS_CONFIG_VFAT_SUPPORTED == 1)
                                                            status = dosfs_path_destroy_entry(volume, clsno_o, index_o, entries_o, DOSFS_CLSNO_NONE);
#else /* (DOSFS_CONFIG_VFAT_SUPPORTED == 1) */
                                                            status = dosfs_path_destroy_entry(volume, clsno_o, index_o, DOSFS_CLUSTER_NONE);
#endif /* (DOSFS_CONFIG_VFAT_SUPPORTED == 1) */
                                                        }

                                                        status = dosfs_volume_clean(volume, status);
                                                    }
#endif /* (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 1) */
                                                }
                                                else
#endif /* (DOSFS_CONFIG_VFAT_SUPPORTED == 1) */
                                                {
                                                    /* Nothing special to do here for TRANSACTION_SAFE/VOLUME_DIRTY/FSINFO. The dir entry
                                                     * update is atomic and not dependent upon the FAT.
                                                     */

                                                    if (clsno_o == DOSFS_CLSNO_NONE)
                                                    {
                                                        blkno = volume->root_blkno + DOSFS_INDEX_TO_BLKCNT_ROOT(index_o);
                                                    }
                                                    else
                                                    {
                                                        blkno = DOSFS_CLSNO_TO_BLKNO(clsno_o) + DOSFS_INDEX_TO_BLKCNT(index_o);
                                                    }
                                                
                                                    status = dosfs_dir_cache_read(volume, blkno, &entry);
                                                
                                                    if (status == F_NO_ERROR)
                                                    {
                                                        dir = (dosfs_dir_t*)((void*)(entry->data + DOSFS_INDEX_TO_BLKOFS(index_o)));
                                                    
                                                        memcpy(dir->dir_name, volume->dir.dir_name, 11);
                                                    
                                                        dir->dir_nt_reserved = volume->dir.dir_nt_reserved;
                                                    
                                                        status = dosfs_dir_cache_write(volume);
                                                    }
                                                }
                                            }
                                        }
                                    }
                                }
                            }
                        }
                        else
                        {
                            status = F_ERR_NOTFOUND;
                        }
                    }
                }
            }
        }

        status = dosfs_volume_unlock(volume, status);
    }

