GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/dosfs_core.c
    return status;
}


int f_move(const char *filename, const char *newname)
{
    int status = F_NO_ERROR;
    uint32_t blkno, clsno_d, clsno_o, index_o, clsno_s, clsno, index;
#if (DOSFS_CONFIG_VFAT_SUPPORTED == 1)
    uint32_t entries_o, count;
    uint8_t nt_reserved_o;
#endif /* (DOSFS_CONFIG_VFAT_SUPPORTED == 1) */
    dosfs_dir_t *dir;
    dosfs_cache_entry_t *entry;
    dosfs_volume_t *volume;

    volume = DOSFS_PATH_VOLUME(filename);

    status = dosfs_volume_lock(volume);
    
    if (status == F_NO_ERROR)
    {
        if (volume->flags & DOSFS_VOLUME_FLAG_WRITE_PROTECTED)
        {
            status = F_ERR_WRITEPROTECT;
        }
        else
        {
            status = dosfs_path_find_directory(volume, filename, &filename, &clsno_d);
            
            if (status == F_NO_ERROR)
            {
                status = dosfs_path_convert_filename(volume, filename, NULL);
            
                if (status == F_NO_ERROR)
                {
                    status = dosfs_path_find_entry(volume, clsno_d, 0, 0, dosfs_path_find_callback_name, NULL, &clsno_o, &index_o, &dir);

                    if (status == F_NO_ERROR)
                    {
                        if (dir != NULL)
                        {
                            if (dir->dir_attr & DOSFS_DIR_ATTR_READ_ONLY)
                            {
                                status = F_ERR_ACCESSDENIED;
                            }
                            else
                            {
                                if (dosfs_file_enumerate(volume, NULL, clsno_o, index_o))
                                {
                                    status = F_ERR_LOCKED;
                                }
                                else
                                {
#if (DOSFS_CONFIG_VFAT_SUPPORTED == 1)
                                    memcpy(&volume->dir, dir, sizeof(dosfs_dir_t));

                                    nt_reserved_o = dir->dir_nt_reserved;

                                    /* dosfs_path_find_callback_name() fills in the proper volume->dir_entries on a match.
                                     */
                                    entries_o = volume->dir_entries;
#endif /* (DOSFS_CONFIG_VFAT_SUPPORTED == 1) */

                                    status = dosfs_path_find_directory(volume, newname, &newname, &clsno_d);
            
                                    if (status == F_NO_ERROR)
                                    {
                                        status = dosfs_path_convert_filename(volume, newname, NULL);
                                        
                                        if (status == F_NO_ERROR)
                                        {
                                            status = dosfs_path_convert_filename(volume, newname, NULL);
                                
                                            if (status == F_NO_ERROR)
                                            {
#if (DOSFS_CONFIG_VFAT_SUPPORTED == 1)
                                                if ((volume->dir.dir_name[0] == '\0') || (volume->dir.dir_nt_reserved & DOSFS_DIR_TYPE_LOSSY))
                                                {
                                                    count = 1 + volume->dir_entries;
                                                }
                                                else
                                                {
                                                    count = 1;
                                                }

                                                status = dosfs_path_find_entry(volume, clsno_d, 0, count, dosfs_path_find_callback_name, NULL, &clsno, &index, &dir);
#else /* (DOSFS_CONFIG_VFAT_SUPPORTED == 1) */
                                                status = dosfs_path_find_entry(volume, clsno_d, 0, 0, dosfs_path_find_callback_name, NULL, &clsno, &index, &dir);
#endif /* (DOSFS_CONFIG_VFAT_SUPPORTED == 1) */
                                    
                                                if (status == F_NO_ERROR)
                                                {
                                                    if (dir != NULL)
                                                    {
                                                        status = F_ERR_DUPLICATED;
                                                    }
                                                    else
                                                    {
#if (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 1)
                                                        /* For TRANSACTION_SAFE, the DOSFS_DIR_FLAG_DESTROY_ENTRY operation is recorded first, and
                                                         * the dosfs_path_create_entry() gets called to add the DOSFS_DIR_FLAG_CREATE_ENTRY part.
                                                         * If that fails somehow, then the pending operations are canceled.
                                                         */
                                                        volume->dir_flags |= DOSFS_DIR_FLAG_DESTROY_ENTRY;
                                                        volume->del_clsno = clsno_o;
                                                        volume->del_index = index_o;
#if (DOSFS_CONFIG_VFAT_SUPPORTED == 1)
                                                        volume->del_entries = entries_o;
#endif /* (DOSFS_CONFIG_VFAT_SUPPORTED == 1) */

                                                        /* The call to dosfs_path_create_entry() is special. The DOSFS_CLUSTER_END_OF_CHAIN tells it
                                                         * use the existing volume->dir as a template, and to overlay "attr" onto dir_nt_reserved.
                                                         */
#if (DOSFS_CONFIG_VFAT_SUPPORTED == 1)
                                                        status = dosfs_path_create_entry(volume, clsno_d, clsno, index, NULL, nt_reserved_o, DOSFS_CLSNO_END_OF_CHAIN, 0, 0);
#else /* (DOSFS_CONFIG_VFAT_SUPPORTED == 1) */
                                                        status = dosfs_path_create_entry(volume, clsno_d, clsno, index, NULL, 0, DOSFS_CLSNO_END_OF_CHAIN, 0, 0);
#endif /* (DOSFS_CONFIG_VFAT_SUPPORTED == 1) */
                                                        
                                                        if (status != F_NO_ERROR)
                                                        {
                                                            volume->dir_flags &= ~(DOSFS_DIR_FLAG_DESTROY_ENTRY | DOSFS_DIR_FLAG_CREATE_ENTRY);
                                                        }

#else /* (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 1) */
                                                        status = dosfs_volume_dirty(volume);

                                                        if (status == F_NO_ERROR)
                                                        {
                                                            /* The call to dosfs_path_create_entry() is special. The DOSFS_CLUSTER_END_OF_CHAIN tells it
                                                             * use the existing volume->dir as a template, and to overlay "attr" onto dir_nt_reserved.
                                                             */
                                                            
#if (DOSFS_CONFIG_VFAT_SUPPORTED == 1)
                                                            status = dosfs_path_create_entry(volume, clsno_d, clsno, index, NULL, nt_reserved_o, DOSFS_CLSNO_END_OF_CHAIN, 0, 0);
#else /* (DOSFS_CONFIG_VFAT_SUPPORTED == 1) */
                                                            status = dosfs_path_create_entry(volume, clsno_d, clsno, index, NULL, 0, DOSFS_CLSNO_END_OF_CHAIN, 0, 0);
#endif /* (DOSFS_CONFIG_VFAT_SUPPORTED == 1) */

                                                            if (status == F_NO_ERROR)
                                                            {
                                                                if (volume->dir.dir_attr & DOSFS_DIR_ATTR_DIRECTORY)
                                                                {
                                                                    if (volume->type == DOSFS_VOLUME_TYPE_FAT32)
                                                                    {
                                                                        clsno_s = ((uint32_t)DOSFS_FTOHS(volume->dir.dir_clsno_hi) << 16) | (uint32_t)DOSFS_FTOHS(volume->dir.dir_clsno_lo);
                                                                    }
                                                                    else
                                                                    {
                                                                        clsno_s = (uint32_t)DOSFS_FTOHS(volume->dir.dir_clsno_lo);
                                                                    }

                                                                    blkno = DOSFS_CLSNO_TO_BLKNO(clsno_s);
                                                                        
                                                                    status = dosfs_dir_cache_read(volume, blkno, &entry);
                                                                    
                                                                    if (status == F_NO_ERROR)
                                                                    {
                                                                        dir = (dosfs_dir_t*)((void*)(entry->data + DOSFS_INDEX_TO_BLKOFS(1)));

                                                                        dir->dir_clsno_lo = clsno_d;

                                                                        if (volume->type == DOSFS_VOLUME_TYPE_FAT32)
                                                                        {
                                                                            dir->dir_clsno_hi = clsno_d >> 16;
                                                                        }

                                                                        status = dosfs_dir_cache_write(volume);
                                                                    }
                                                                }
                                                            }

                                                            if (status == F_NO_ERROR)
                                                            {
#if (DOSFS_CONFIG_VFAT_SUPPORTED == 1)
                                                                status = dosfs_path_destroy_entry(volume, clsno_o, index_o, entries_o, DOSFS_CLSNO_NONE);
#else /* (DOSFS_CONFIG_VFAT_SUPPORTED == 1) */
                                                                status = dosfs_path_destroy_entry(volume, clsno_o, index_o, DOSFS_CLSNO_NONE);
#endif /* (DOSFS_CONFIG_VFAT_SUPPORTED == 1) */
                                                            }
                                                            
                                                            status = dosfs_volume_clean(volume, status);
                                                        }
#endif /* (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 1) */
                                                    }
                                                }
                                            }
                                        }
                                    }
                                }
                            }
                        }
                        else
                        {
                            status = F_ERR_NOTFOUND;
                        }
                    }
                }
            }
        }

        status = dosfs_volume_unlock(volume, status);
    }

