GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/dosfs_core.c
    return status;
}


int f_delete(const char *filename)
{
    int status = F_NO_ERROR;
    uint32_t clsno, index, first_clsno;
    dosfs_dir_t *dir;
    dosfs_volume_t *volume;

    volume = DOSFS_PATH_VOLUME(filename);

    status = dosfs_volume_lock(volume);
    
    if (status == F_NO_ERROR)
    {
        if (volume->flags & DOSFS_VOLUME_FLAG_WRITE_PROTECTED)
        {
            status = F_ERR_WRITEPROTECT;
        }
        else
        {
            status = dosfs_path_find_file(volume, filename, &clsno, &index, &dir);
            
            if (status == F_NO_ERROR)
            {
                if (dir->dir_attr & DOSFS_DIR_ATTR_DIRECTORY)
                {
                    status = F_ERR_NOTFOUND;
                }
                else if (dir->dir_attr & DOSFS_DIR_ATTR_READ_ONLY)
                {
                    status = F_ERR_ACCESSDENIED;
                }
                else
                {
                    if (dosfs_file_enumerate(volume, NULL, clsno, index))
                    {
                        status = F_ERR_LOCKED;
                    }
                    else
                    {
                        if (volume->type == DOSFS_VOLUME_TYPE_FAT32)
                        {
                            first_clsno = ((uint32_t)DOSFS_FTOHS(dir->dir_clsno_hi) << 16) | (uint32_t)DOSFS_FTOHS(dir->dir_clsno_lo);
                        }
                        else
                        { 
                            first_clsno = (uint32_t)DOSFS_FTOHS(dir->dir_clsno_lo);
                        }

#if (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 0)
                        status = dosfs_volume_dirty(volume);
                    
                        if (status == F_NO_ERROR)
#endif /* (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 0) */
                        {
#if (DOSFS_CONFIG_VFAT_SUPPORTED == 1)
                            /* dosfs_path_find_file() fills in the proper volume->dir_entries on a match.
                             */
                            status = dosfs_path_destroy_entry(volume, clsno, index, volume->dir_entries, first_clsno);
#else /* (DOSFS_CONFIG_VFAT_SUPPORTED == 1) */
                            status = dosfs_path_destroy_entry(volume, clsno, index, first_clsno);
#endif /* (DOSFS_CONFIG_VFAT_SUPPORTED == 1) */

#if (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 0)
                            status = dosfs_volume_clean(volume, status);
#endif /* (DOSFS_CONFIG_TRANSACTION_SAFE_SUPPORTED == 0) */
                        }
                    }
                }
            }
        }

        status = dosfs_volume_unlock(volume, status);
    }

    return status;
}

long f_filelength(const char *filename)
{
    int status = F_NO_ERROR;
    uint32_t length;
    dosfs_dir_t *dir;
    dosfs_volume_t *volume;

    length = 0;

    volume = DOSFS_PATH_VOLUME(filename);

    status = dosfs_volume_lock(volume);
    
    if (status == F_NO_ERROR)
    {
      status = dosfs_path_find_file(volume, filename, NULL, NULL, &dir);
            
        if (status == F_NO_ERROR)
        {
            length = dir->dir_file_size;
        }

        status = dosfs_volume_unlock(volume, status);
    }

    return (long)length;
}

int f_findfirst(const char *filename, F_FIND *find)
{
    int status = F_NO_ERROR;
    dosfs_volume_t *volume;

    find->find_dir.dot_clsno = DOSFS_CLSNO_END_OF_CHAIN;
    find->find_dir.dir_clsno = DOSFS_CLSNO_END_OF_CHAIN;
    find->find_dir.dir_index = 0;

    volume = DOSFS_PATH_VOLUME(filename);

    status = dosfs_volume_lock(volume);
    
    if (status == F_NO_ERROR)
    {
        status = dosfs_path_find_directory(volume, filename, &filename, &find->find_dir.dot_clsno);
            
        if (status == F_NO_ERROR)
        {
            find->find_dir.dir_clsno = find->find_dir.dot_clsno;

#if (DOSFS_CONFIG_VFAT_SUPPORTED == 0)

            /* For non-VFAT, build a MSDOS style template where '*' is expanded into
             * a sequence of '?'.
             */

            filename = dosfs_name_cstring_to_pattern(filename, find->find_pattern);

            if (filename == NULL)
            {
                status = F_ERR_INVALIDNAME;
            }

#else /* (DOSFS_CONFIG_VFAT_SUPPORTED == 0) */

            /* Copy the remaining filename into find_pattern, and do a WINNT compatible
             * pattern match based upon the incoming lfn_name, or the converted sfn_name.
             */

            char c, *pattern, *pattern_e;
            
            pattern = &find->find_pattern[0];
            pattern_e = &find->find_pattern[F_MAXPATH];
            
            do
            {
                if (pattern == pattern_e)
                {
                    status = F_ERR_TOOLONGNAME;
                }
                else
                {
                    c = *filename++;
                    
                    *pattern++ = c;
                }
            }
            while ((status == F_NO_ERROR) && (c != '\0'));
#endif /* (DOSFS_CONFIG_VFAT_SUPPORTED == 0) */
        }

        if (status != F_NO_ERROR)
        {
            find->find_dir.dir_clsno = DOSFS_CLSNO_END_OF_CHAIN;
        }

        status = dosfs_volume_unlock(volume, status);
    }

    if (status == F_NO_ERROR)
    {
        status = f_findnext(find);
    }

    return status;
}

int f_findnext(F_FIND *find)
{
    int status = F_NO_ERROR;
    dosfs_volume_t *volume;
    dosfs_dir_t *dir_e;

    volume = DOSFS_FIND_VOLUME(find);

    status = dosfs_volume_lock(volume);
    
    if (status == F_NO_ERROR)
    {
        if (find->find_dir.dir_clsno == DOSFS_CLSNO_END_OF_CHAIN)
        {
            status = F_ERR_NOTFOUND;
        }
        else
        {
            status = dosfs_path_find_pattern(volume, &find->find_dir, find->find_pattern, find->filename, &dir_e);

            if (status == F_NO_ERROR)
            {
                memcpy(&find->name[0], &dir_e->dir_name[0], (F_MAXNAME+F_MAXEXT));
                
                find->attr = dir_e->dir_attr;
                find->ctime = DOSFS_FTOHS(dir_e->dir_wrt_time);
                find->cdate = DOSFS_FTOHS(dir_e->dir_wrt_date);
                find->filesize = DOSFS_FTOHL(dir_e->dir_file_size);

                if (volume->type == DOSFS_VOLUME_TYPE_FAT32)
                {
                    find->cluster = ((uint32_t)DOSFS_FTOHS(dir_e->dir_clsno_hi) << 16) | (uint32_t)DOSFS_FTOHS(dir_e->dir_clsno_lo);
                }
                else
                {
                    find->cluster = (uint32_t)DOSFS_FTOHS(dir_e->dir_clsno_lo);
                }
            }
        }

        status = dosfs_volume_unlock(volume, status);
    }

