GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/dosfs_core.c
    return status;
}


int f_settimedate(const char *filename, unsigned short ctime, unsigned short cdate)
{
    int status = F_NO_ERROR;
    dosfs_dir_t *dir;
    dosfs_volume_t *volume;

    volume = DOSFS_PATH_VOLUME(filename);

    status = dosfs_volume_lock(volume);
    
    if (status == F_NO_ERROR)
    {
        if (volume->flags & DOSFS_VOLUME_FLAG_WRITE_PROTECTED)
        {
            status = F_ERR_WRITEPROTECT;
        }
        else
        {
            status = dosfs_path_find_file(volume, filename, NULL, NULL, &dir);
        
            if (status == F_NO_ERROR)
            {
                /* Nothing special to do here for TRANSACTION_SAFE/VOLUME_DIRTY/FSINFO. The dir entry
                 * update is atomic and not dependent upon the FAT.
                 */
                dir->dir_wrt_time = DOSFS_HTOFS(ctime);
                dir->dir_wrt_date = DOSFS_HTOFS(cdate);
            
                status = dosfs_dir_cache_write(volume);
            }
        }

        status = dosfs_volume_unlock(volume, status);
    }

    return status;
}

int f_gettimedate(const char *filename, unsigned short *p_ctime, unsigned short *p_cdate)
{
    int status = F_NO_ERROR;
    dosfs_dir_t *dir;
    dosfs_volume_t *volume;

    volume = DOSFS_PATH_VOLUME(filename);

    status = dosfs_volume_lock(volume);
    
    if (status == F_NO_ERROR)
    {
        status = dosfs_path_find_file(volume, filename, NULL, NULL, &dir);
        
        if (status == F_NO_ERROR)
        {
            *p_ctime = DOSFS_FTOHS(dir->dir_wrt_time);
            *p_cdate = DOSFS_FTOHS(dir->dir_wrt_date);
        }

        status = dosfs_volume_unlock(volume, status);
    }

    return status;
}

int f_setattr(const char *filename, unsigned char attr)
{
    int status = F_NO_ERROR;
    dosfs_dir_t *dir;
    dosfs_volume_t *volume;

    volume = DOSFS_PATH_VOLUME(filename);

    status = dosfs_volume_lock(volume);
    
    if (status == F_NO_ERROR)
    {
        if (volume->flags & DOSFS_VOLUME_FLAG_WRITE_PROTECTED)
        {
            status = F_ERR_WRITEPROTECT;
        }
        else
        {
            status = dosfs_path_find_file(volume, filename, NULL, NULL, &dir);
        
            if (status == F_NO_ERROR)
            {
                /* Nothing special to do here for TRANSACTION_SAFE/VOLUME_DIRT/FSINFO. The dir entry
                 * update is atomic and not dependent upon the FAT.
                 */
                dir->dir_attr = ((dir->dir_attr & ~(F_ATTR_ARC | F_ATTR_SYSTEM | F_ATTR_HIDDEN | F_ATTR_READONLY)) |
                                 (attr & (F_ATTR_ARC | F_ATTR_SYSTEM | F_ATTR_HIDDEN | F_ATTR_READONLY)));
            
                status = dosfs_dir_cache_write(volume);
            }
        }

        status = dosfs_volume_unlock(volume, status);
    }

    return status;
}

int f_getattr(const char *filename, unsigned char *p_attr)
{
    int status = F_NO_ERROR;
    dosfs_dir_t *dir;
    dosfs_volume_t *volume;

    volume = DOSFS_PATH_VOLUME(filename);

    status = dosfs_volume_lock(volume);
    
    if (status == F_NO_ERROR)
    {
        status = dosfs_path_find_file(volume, filename, NULL, NULL, &dir);
        
        if (status == F_NO_ERROR)
        {
            *p_attr = dir->dir_attr;
        }

        status = dosfs_volume_unlock(volume, status);
    }

    return status;
}


int f_open(F_FILE *file, const char *filename, const char *type)
{
    int status = F_NO_ERROR;
    int c;
    uint32_t mode, size;
    dosfs_volume_t *volume;

    mode = 0;
    size = 0;

    while ((status == F_NO_ERROR) && (c = *type++))
    {
        if ((c == 'r') || (c == 'w') || (c == 'a'))
        {
            if (!(mode & (DOSFS_FILE_MODE_READ | DOSFS_FILE_MODE_WRITE)))
            {
                if (c == 'r')
                {
                    mode = DOSFS_FILE_MODE_READ;
                }
                else if (c == 'w')
                {
                    mode = DOSFS_FILE_MODE_WRITE | DOSFS_FILE_MODE_CREATE | DOSFS_FILE_MODE_TRUNCATE;
                }
                else
                {
                    mode = DOSFS_FILE_MODE_WRITE | DOSFS_FILE_MODE_CREATE | DOSFS_FILE_MODE_APPEND;
                }
                
                if (*type == '+')
                {
                    mode |= (DOSFS_FILE_MODE_READ | DOSFS_FILE_MODE_WRITE);
                    type++;
                }
            }
            else
            {
                status = F_ERR_NOTUSEABLE;
            }
        }
        else if (c == 'S')
        {
            mode |= DOSFS_FILE_MODE_SEQUENTIAL;
        }
        else if (c == 'R')
        {
            mode |= DOSFS_FILE_MODE_RANDOM;
        }
#if (DOSFS_CONFIG_CONTIGUOUS_SUPPORTED == 1)
        else if ((c == ',') && (*type != '\0'))
        {
            /* ",<size>". Make sure that <size> does not overflow
             * DOSFS_FILE_SIZE_MAX.
             */
            while ((status == F_NO_ERROR) && (*type != '\0'))
            {
                c = *type++;

                if ((c >= '0') && (c <= '9'))
                {
                    if (size >= (DOSFS_FILE_SIZE_MAX / 10u))
                    {
                        size = DOSFS_FILE_SIZE_MAX;
                    }
                    else
                    {
                        size = size * 10u;

                        if (size >= (DOSFS_FILE_SIZE_MAX - (c - '0')))
                        {
                            size = DOSFS_FILE_SIZE_MAX;
                        }
                        else
                        {
                            size += (c - '0');
                        }
                    }
                }
                else if (*type == '\0')
                {
                    if (size >= DOSFS_FILE_SIZE_MAX)
                    {
                        size = DOSFS_FILE_SIZE_MAX;
                    }
                }
                else
                {
                    status = F_ERR_NOTUSEABLE;
                }
            }
        }
#endif /* (DOSFS_CONFIG_CONTIGUOUS_SUPPORTED == 1) */
        else
        {
            status = F_ERR_NOTUSEABLE;
        }
    }

