GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/dosfs_core.c
    if ((status == F_NO_ERROR) && (mode & (DOSFS_FILE_MODE_READ | DOSFS_FILE_MODE_WRITE)))
    {
        volume = DOSFS_PATH_VOLUME(filename);
      
        status = dosfs_volume_lock(volume);
    
        if (status == F_NO_ERROR)
        {
            status = dosfs_file_open(volume, file, filename, mode, size);

            status = dosfs_volume_unlock(volume, status);
        }
    }
    else
    {
        status = F_ERR_NOTUSEABLE;
    }

    return status;
}

int f_close(F_FILE *file)
{
    int status = F_NO_ERROR;
    dosfs_volume_t *volume;

    if (!file || !file->mode)
    {
        status = F_ERR_NOTOPEN;
    }
    else
    {
        /* There is no check for "file->status" here, as this
         * is handled in dosfs_file_close(), so that the meta
         * data gets updated, while the file data is treated
         * as optional.
         */

        volume = DOSFS_FILE_VOLUME(file);
    
        status = dosfs_volume_lock(volume);
    
        if (status == F_NO_ERROR)
        {
            status = dosfs_file_close(volume, file);

            status = dosfs_volume_unlock(volume, status);
        }
    }

    return status;
}

int f_flush(F_FILE *file)
{
    int status = F_NO_ERROR;
    dosfs_volume_t *volume;

    if (!file || !file->mode)
    {
        status = F_ERR_NOTOPEN;
    }
    else
    {
        status = file->status;
        
        if (status == F_NO_ERROR)
        {
            if (file->mode & DOSFS_FILE_MODE_WRITE)
            {
                volume = DOSFS_FILE_VOLUME(file);
            
                status = dosfs_volume_lock(volume);
                
                if (status == F_NO_ERROR)
                {
                    status = dosfs_file_flush(volume, file, FALSE);
                    
                    status = dosfs_volume_unlock(volume, status);
                }
            }
        }
    }

    return status;
}

long f_write(const void *buffer, long size, long count, F_FILE *file)
{
    int status = F_NO_ERROR;
    long result = 0;
    uint32_t total;
    dosfs_volume_t *volume;

    if (!file || !file->mode)
    {
        status = F_ERR_NOTOPEN;
    }
    else
    {
        if (!(file->mode & DOSFS_FILE_MODE_WRITE))
        {
            status = F_ERR_ACCESSDENIED;
        }
        else
        {
            status = file->status;
            
            if (status == F_NO_ERROR)
            {
                if ((size > 0) && (count > 0))
                {
                    volume = DOSFS_FILE_VOLUME(file);
                    
                    status = dosfs_volume_lock(volume);
                    
                    if (status == F_NO_ERROR)
                    {
                        status = dosfs_file_write(volume, file, (const uint8_t*)buffer, (unsigned long)count * (unsigned long)size, &total);

                        result = total / (unsigned long)size;
                        
                        status = dosfs_volume_unlock(volume, status);
                    }
                }
            }
        }
    }

    return result;
}

long f_read(void *buffer, long size, long count, F_FILE *file)
{
    int status = F_NO_ERROR;
    long result = 0;
    uint32_t total;
    dosfs_volume_t *volume;

    if (!file || !file->mode)
    {
        status = F_ERR_NOTOPEN;
    }
    else
    {
        if (!(file->mode & DOSFS_FILE_MODE_READ))
        {
            status = F_ERR_ACCESSDENIED;
        }
        else
        {
            status = file->status;
                
            if (status == F_NO_ERROR)
            {
                if ((size > 0) && (count > 0))
                {
                    volume = DOSFS_FILE_VOLUME(file);
                    
                    status = dosfs_volume_lock(volume);
                    
                    if (status == F_NO_ERROR)
                    {
                        status = dosfs_file_read(volume, file, (uint8_t*)buffer, (unsigned long)count * (unsigned long)size, &total);

                        result = total / (unsigned long)size;

                        status = dosfs_volume_unlock(volume, status);
                    }
                }
            }
        }
    }

    return result;
}

int f_seek(F_FILE *file, long offset, int whence)
{
    int status = F_NO_ERROR;
    uint32_t position;
    dosfs_volume_t *volume;

    if (!file || !file->mode)
    {
        status = F_ERR_NOTOPEN;
    }
    else
    {
        status = file->status;

        if (status == F_NO_ERROR)
        {
            switch (whence) {
            case F_SEEK_CUR:
                if ((offset >= 0)
                    ? ((uint32_t)offset > (DOSFS_FILE_SIZE_MAX - file->position))
                    : ((uint32_t)(0 - offset) > file->position))
                {
                    status = F_ERR_NOTUSEABLE;
                }
                else
                {
                    position = file->position + offset;
                }
                break;

            case F_SEEK_END:
                if ((offset >= 0)
                    ? ((uint32_t)offset > (DOSFS_FILE_SIZE_MAX - file->length))
                    : ((uint32_t)(0 - offset) > file->length))
                {
                    status = F_ERR_NOTUSEABLE;
                }
                else
                {
                    position = file->length + offset;
                }
                break;

            case F_SEEK_SET:
                if (offset < 0)
                {
                    status = F_ERR_NOTUSEABLE;
                }
                else
                {
                    position = offset;
                }
                break;

            default:
                status = F_ERR_NOTUSEABLE;
                break;
            }
            
            if (status == F_NO_ERROR)
            {
                volume = DOSFS_FILE_VOLUME(file);

                status = dosfs_volume_lock(volume);
    
                if (status == F_NO_ERROR)
                {
                    status = dosfs_file_seek(volume, file, position);

                    status = dosfs_volume_unlock(volume, status);
                }
            }
        }
    }

