GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/dosfs_core.c
    return status;
}

long f_tell(F_FILE *file)
{
    int status = F_NO_ERROR;
    uint32_t position;
    
    if (!file || !file->mode)
    {
        status = F_ERR_NOTOPEN;
    }
    else
    {
        status = file->status;
        position = file->position;
    }

    return (status == F_NO_ERROR) ? (long)position : -1;
}

long f_length(F_FILE *file)
{
    int status = F_NO_ERROR;
    uint32_t length;
    
    if (!file || !file->mode)
    {
        status = F_ERR_NOTOPEN;
    }
    else
    {
        status = file->status;
        length = file->length;
    }

    return (status == F_NO_ERROR) ? (long)length : -1;
}

int f_eof(F_FILE *file)
{
    return (!file || !file->mode || (file->position >= file->length));
}

int f_error(F_FILE *file)
{
    int status = F_NO_ERROR;

    if (!file || !file->mode)
    {
        status = F_ERR_NOTOPEN;
    }
    else
    {
        status = file->status;
    }

    return status;
}

int f_rewind(F_FILE *file)
{
    int status = F_NO_ERROR;
    dosfs_volume_t *volume;
    dosfs_device_t *device;

    if (!file || !file->mode)
    {
        status = F_ERR_NOTOPEN;
    }
    else
    {
        volume = DOSFS_FILE_VOLUME(file);
        device = DOSFS_VOLUME_DEVICE(volume);

        status = dosfs_volume_lock(volume);
    
        if (status == F_NO_ERROR)
        {
            /* Call (*device->interface->sync)() to collect all outstanding asynchronous
             * errors. If that succeeds, clear the error status for the file
             * and seek to the beginning of the time.
             */

            status = dosfs_data_cache_flush(volume, file);

            if (status == F_NO_ERROR)
            {
                status = (*device->interface->sync)(device->context);

                if (status == F_NO_ERROR)
                {
                    file->status = F_NO_ERROR;
                    
                    status = dosfs_file_seek(volume, file, 0);
                }
            }

            status = dosfs_volume_unlock(volume, status);
        }
    }

    return status;
}

int f_putc(int c, F_FILE *file)
{
    int status = F_NO_ERROR;
    int result = -1;
    uint8_t data;
    uint32_t total;
    dosfs_cache_entry_t *entry;
    dosfs_volume_t *volume;

    if (!file || !file->mode)
    {
        status = F_ERR_NOTOPEN;
    }
    else
    {
        if (!(file->mode & DOSFS_FILE_MODE_WRITE))
        {
            status = F_ERR_ACCESSDENIED;
        }
        else
        {
            status = file->status;

            if (status == F_NO_ERROR)
            {
                volume = DOSFS_FILE_VOLUME(file);

#if (DOSFS_CONFIG_FILE_DATA_CACHE == 1)
                entry = &file->data_cache;
#else /* (DOSFS_CONFIG_FILE_DATA_CACHE) */
                entry = &volume->dir_cache;
#endif /* (DOSFS_CONFIG_FILE_DATA_CACHE) */

                if ((entry->blkno == file->blkno) && ((file->mode & DOSFS_FILE_MODE_APPEND) ? (file->position == file->length) : (file->position <= file->length)))
                {
                    file->flags |= DOSFS_FILE_FLAG_DATA_MODIFIED;

                    *(entry->data + (file->position & DOSFS_BLK_MASK)) = c;

                    dosfs_data_cache_modify(volume, file);
                
                    file->position++;
                
                    if (!(file->position & DOSFS_BLK_MASK))
                    {
                        file->blkno++;
                    }
                
                    if (file->position >= file->length)
                    {
                        file->length = file->position;
                    }

                    result = c;
                }
                else
                {
                    status = dosfs_volume_lock(volume);
                
                    if (status == F_NO_ERROR)
                    {
                        data = c;
                
                        status = dosfs_file_write(volume, file, &data, 1, &total);

                        if (status == F_NO_ERROR)
                        {
                            if (total == 1)
                            {
                                result = c;
                            }
                        }

                        status = dosfs_volume_unlock(volume, status);
                    }
                }
            }
        }
    }

    return result;
}

int f_getc(F_FILE *file)
{
    int status = F_NO_ERROR;
    int result = -1;
    uint8_t data;
    uint32_t total;
    dosfs_cache_entry_t *entry;
    dosfs_volume_t *volume;

    if (!file || !file->mode)
    {
        status = F_ERR_NOTOPEN;
    }
    else
    {
        if (!(file->mode & DOSFS_FILE_MODE_READ))
        {
            status = F_ERR_ACCESSDENIED;
        }
        else
        {
            status = file->status;

            if (status == F_NO_ERROR)
            {
                volume = DOSFS_FILE_VOLUME(file);

#if (DOSFS_CONFIG_FILE_DATA_CACHE == 1)
                entry = &file->data_cache;
#else /* (DOSFS_CONFIG_FILE_DATA_CACHE) */
                entry = &volume->dir_cache;
#endif /* (DOSFS_CONFIG_FILE_DATA_CACHE) */
                    
                if ((entry->blkno == file->blkno) && (file->position < file->length))
                {
                    result = *(entry->data + (file->position & DOSFS_BLK_MASK));
                        
                    file->position++;
                        
                    if (!(file->position & DOSFS_BLK_MASK))
                    {
                        file->blkno++;
                    }
                }
                else
                {
                    status = dosfs_volume_lock(volume);
                        
                    if (status == F_NO_ERROR)
                    {
                        status = dosfs_file_read(volume, file, &data, 1, &total);
                            
                        if (total == 1)
                        {
                            result = data;
                        }
                            
                        status = dosfs_volume_unlock(volume, status);
                    }
                }
            }
        }
    }

    return result;
}

int f_seteof(F_FILE *file)
{
    int status = F_NO_ERROR;
    dosfs_volume_t *volume;

    if (!file || !file->mode)
    {
        status = F_ERR_NOTOPEN;
    }
    else
    {
        status = file->status;
        
        if (status == F_NO_ERROR)
        {
            volume = DOSFS_FILE_VOLUME(file);

            status = dosfs_volume_lock(volume);
        
            if (status == F_NO_ERROR)
            {
                /* Allow always a truncation, to deal with the case where there
                 * was a file->length but no cluster allocated.
                 */
                if ((file->position == 0) || (file->position < file->length))
                {
                    status = dosfs_file_shrink(volume, file);
                }
                else
                {
                    if ((file->first_clsno == DOSFS_CLSNO_NONE) || (file->length < file->position))
                    {
#if (DOSFS_CONFIG_CONTIGUOUS_SUPPORTED == 1)
                        if (file->flags & DOSFS_FILE_FLAG_CONTIGUOUS)
                        {
                            if (file->size < file->position)
                            {
                                status = F_ERR_EOF;
                            }
                        }

                        if (status == F_NO_ERROR)
#endif /* (DOSFS_CONFIG_CONTIGUOUS_SUPPORTED == 1) */
                        {
                            status = dosfs_file_extend(volume, file, file->position);
                        }
                    }
                }
                
                status = dosfs_volume_unlock(volume, status);
            }
        }
    }

    return status;
}

int f_truncate(F_FILE *file, const char *filename, long length)
{
    int status = F_NO_ERROR;

    status = f_open(file, filename, "r+");

    if (status == F_NO_ERROR)
    {
        status = f_seek(file, length, F_SEEK_SET);

        if (status == F_NO_ERROR)
        {
            status = f_seteof(file);
        }
        
        if (status != F_NO_ERROR)
        {
            f_close(file);
        }
    }

    return status;
}
